[
  {
    "title": "The Mystery of Miquella's Cocoon",
    "category": "Demigods",
    "body": "Deep within the Haligtree, Miquella's cocoon hangs suspended, a testament to his eternal slumber. But what secrets does this chrysalis hold? Some scholars believe that Miquella's transformation was not merely physical, but a fundamental alteration of his very essence.\n\nThe cocoon itself appears to be made of a substance unknown to the Lands Between - neither flesh nor bark, but something altogether more ethereal. It pulses with a faint golden light, reminiscent of the Erdtree's grace, yet distinctly different.\n\nCould it be that Miquella sought to transcend his cursed eternal youth through metamorphosis? The implications are staggering...",
    "score": 847,
    "image_url": null,
    "scraped_at": "2025-01-01T12:00:00.000Z",
    "comments": [
      {
        "body": "This is fascinating! I never considered that the cocoon material might be something entirely new. The way it interacts with light is definitely unique compared to other divine artifacts we see.",
        "score": 156
      },
      {
        "body": "The parallel between Miquella's cocoon and the chrysalis of the Cleanrot Knights is worth exploring. Both seem to represent transformation through divine intervention.",
        "score": 89
      }
    ]
  },
  {
    "title": "The Fell God's True Identity",
    "category": "Outer Gods",
    "body": "The Fell God of the Fire Giants has long been dismissed as a mere antagonist to the Golden Order, but recent discoveries suggest a far more complex relationship with the cosmic forces that shape the Lands Between.\n\nConsider this: the Fell God's flame is not destructive in the way we typically understand fire. Instead, it appears to be a force of renewal, burning away the old to make way for the new. This is evidenced by the way the Flame of Ruin interacts with the Erdtree - not destroying it outright, but transforming it.\n\nThe Fire Giants themselves were not mere servants, but guardians of a sacred duty. Their eternal vigil over the Flame of Ruin was not imprisonment, but stewardship of a power too dangerous to unleash carelessly.",
    "category": "Outer Gods",
    "score": 1203,
    "image_url": null,
    "scraped_at": "2025-01-01T10:30:00.000Z",
    "comments": [
      {
        "body": "The connection between renewal and destruction is central to understanding the Fell God. It's not chaos for chaos's sake, but a necessary force of change.",
        "score": 234
      },
      {
        "body": "This makes me wonder about the relationship between the Fell God and the Frenzied Flame. Are they opposing forces, or two sides of the same cosmic principle?",
        "score": 178
      },
      {
        "body": "The Fire Giants' culture and their reverence for the flame suggests they understood something about cosmic balance that the Golden Order never grasped.",
        "score": 145
      }
    ]
  }
]