[
  {
    "title": "Why does Morgott’s appearance change so drastically after we defeat him?",
    "url": "https://i.redd.it/9c9a3op9g62g1.jpeg",
    "score": 1350,
    "subreddit": "EldenRingLoreTalk",
    "body": "I’ve been thinking about Morgott and how drastically his appearance changes once you defeat him.\n\nWhen we first encounter him, he looms above us. He looms above us - muscular, and imposing. When we encounter him as Margit he jumps to the ground causing it to quake and leaves a crater behind. Even with most of his body hidden under his robes, you can see he’s physically powerful. \n\nBut after you defeat him, he doesn’t just appear to have been defeated….he looks completely different. He’s suddenly sporting a much smaller frame. His skin is clinging to bare bones. His omen horns are completely gone, his body is clearly diminished, and even his tail has disappeared. He almost doesn’t look like an Omen anymore. \n\nDoes the lore offer any solid explanation for why he changes so drastically?\nCould this be tied to the loss of his Great Rune… or is something else entirely going on here? \n\nVaatiVidya’s lore video makes the statement  *“In death, Morgott’s horns disappear. Perhaps it was final mercy from the Erdtree.”*  We know that Morgott is spurned by the Erdtree and devoid of it’s grace, but could the Erdtree have granted him grace in his final moments? Afterall, Morgott did take up the task of protecting the tree when all others had abandoned the duty.\n\nCould this perhaps be FromSoft’s way of revealing the metaphor at the heart of Morgott’s story… by stripping away his imposing exterior they allow us to see him for what he truly is…not as The Fell Omen or this intimidating demigod….but as the unfortunate result of being born far too late into a world that once would have revered him.\n\nIn the words of our Lord and Savior VaatiVidya: *“The other Demigods all had what Morgott was denied from birth - the Erdtree’s grace, a mother and a fate to call their own. But while Morgott was shackled deep below the Earth they threw it all away, so even though he was born a graceless Omen child Morgott tried to be the Erdtree’s protector. He was never loved and should never have learned love, but nevertheless love the Erdtree, he did.”*\n\nI’m really curious to hear what interpretations or theories others have. FromSoft loves revealing just enough to push players to connect the dots, so I feel like there’s probably something deeper happening here that I’m missing.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:07.713243",
    "comments": [
      {
        "body": "People are giving the most absurd paradoxal answers ever.\n\nMorgott was “cleansed” of his Omen blood by the Grace of Gold for defending the Erdtree until his last strength. He already was grace-given and it shows on his body, but the complete removal was a way to reward him with his last wish before his lights went out. To show him he wasn’t completely forsaken.\n\nThat didn’t happened to Mohg so is definitely related to the Grace of Gold.",
        "score": 57
      },
      {
        "body": "Vaati was wrong about that. \n\nMorgott had Grace *before* he is defeated by the Tarnished.  He was denied the love from his mother, family, and the Golden Order initially, so was born a Graceless child (or an “unblessed, forbidden child” in JPN). *But* at some point, he had come to be known as the Grace-Given.  Gideon’s dialogue and the Banished Knight Oleg Ashes’ description call him this, and Morgott’s eyes show evidence of Grace as well.  \n\n(Beings born outside the embrace of Grace retain their own eye color unaffected by the gold light, as seen in Rennala’s, the Tarnished, Hornsent, and the eyes of the Shadowbound Beasts.)\n\nThe Erdtree itself is not a thing with opinion or affection, it’s a tree. A very important and iconic magic tree that represents the Crucible’s power and the Golden Order, but it doesn’t grant Grace or show love to anyone; Grace is attributed to Marika alone. She is the one who created and distributed Grace, and leads the Tarnished with the Guidance of Grace as well.  “Graceless” is someone she either denied from Grace or had removed Grace from; this is what she did to create the Tarnished when sending Godfrey and his fellowship on their long March.  Since Morgott and Mohg were denied by their own mother soon after birth for the presence of their horns, resembling the Hornsent, she declared horned babies Graceless and forbidden in her kingdom. This lead to the subjugation, imprisonment, and often the death of horned children. “Omen” was essentially a kind of slur to instil fear in the families who would have otherwise kept their baby a secret. (In JPN again, they’re called “Cursed” and not “Omen”, to be even more direct that they were extremely taboo)\n\nAs for why Morgott or Mohg had Grace later even after being born denied it, I think it runs in the same parallel as the Tarnished; Marika took the Grace from Godfrey and co, and promised to return it to “wage war and brandish the Elden Ring.”  This commandment reminds me of Marika’s words to her own children; to become a Lord, a God, anything but nothing.  Marika created the Tarnished to return to TLB once she had “died”, unbeknownst to them, so one among them could reach her and the Elden Ring through hardship and  ambition to start a new Age in whatever fashion they desired- this could have also extended to her own children. Though not Tarnished, most of the Demigods had the same feverish Ambition to take the position of Elden Lord and reach the Elden Ring as well. Like the Tarnished, many amassed Runes and became hungry for more power.  Morgott was the closest of anyone to reach that end goal of being the Elden Lord; he just lacked the means to enter the Erdtree.  It’s possible then to assume Morgott was given his Grace when Marika “died” and Grace called the Tarnished  back to TLB.  Any and all with potential to become Elden Lord may have been granted a chance at obtaining Grace again.\n\nSo there are a few key scenarios that happened after Morgott was banished and grew up in the sewer: Marika shattered the Elden Ring and the shards were claimed by her children, including Morgott.  The strength of the Great Runes tainted the Demigods with madness, spurring the Shattering War. Morgott took it upon himself to take the title of Lord of Leyndell and protector of the Erdtree, defeating all his siblings who had tried to take the throne as well. X/thousand years later a Tarnished arrives and defeats Morgott, whose body changes and horns inexplicably disappear.  \n\nWe know that Omen’s horns don’t just vanish when they die; none do in the sewers and Mohg still has his horns even when his body is used to resurrect Radahn, just not on his head.  It’s been established that Morgott was already Graced prior to his death and his horns didn’t vanish while he was alive, and that horns don’t crumble when an Omen dies either; the last possible outlet of why the horns disappear as he dies very likely lies in his blood.  His decrepit dying/dead corpse has no eyes, but also a very large gouge under his diaphragm- this is also easily seen in the concept art for his dead body.  Morgott recanted his “accursed blood” into his sword hidden in his walking stick. Presumably the sword ceases to exist when he is defeated (Demigod goods are recalled into existence via their Remembrances), and because none of the other Omens, including Mohg, ever extracted their own blood in entirety to concentrate it into something outside their own bodies, this is the only major outlier that sets Morgott apart.  \n\nWhile fighting him in Leyndell, he says something while entering his Phase 2 in the fight: *”The thrones… stained by my curse… such shame I cannot bear. Thy part in this shall not be forgiven.”* He’s talking about his blood. His blood is what is believed to be “cursed”, and what has splattered on the thrones that he has kept intact at the Elden Throne balcony.  He is not just using his sword on the Tarnished either; he uses his blood *constantly* to imbue his sword with its power. He is bled dry by the end of the fight not just from the wounds inflicted by us, but on himself.\n\nBlood being where the “Omen” is also ties back to why Miquella specifically needed Mohg to venture into the Land of Shadow.  Like Morgott as well, Miquella’s leftover corpse is shrivelled and devoid of its own blood, yet used Mohg’s “accursed” blood to travel into the LOS. \n\nBonus ties between Omen and LOS:  what Morgott spits up entering second phase, and the Fell Twins’ (the minibosses leading to the Divine Tower) looks like a liquid “Flame” and is also curiously the same color as the projectile “Flames” produced by the Scadutree Avatar in the Land of Shadow Incantation: *This incantation channels the force of the Scadutree’s power, and its gold is accompanied by shadow.* The Omen are arguably related to Hornsent, and being that the blood is where the physical aspects of their genes are, Omen are the children of those who carried the genetic material of Hornsent while hornless themselves. The Hornsent are just humans, but humans who believed themselves holier and superior to all others for their “blessing” of horns.  Despite whichever culture’s opinion on cursed vs blessed, the horns are a product of blood and an ancient power.  The Bloodfiends were also human once, yet hornless they were trapped in LOS and victim to the Crusade. Blood is power and a gateway.\n\nTL;DR: Morgott bled out from fighting the Tarnished and his blood is where his Omen-ness comes from.  He’s just a withered dehydrated and bloodless man without it.",
        "score": 52
      },
      {
        "body": "The implication is the Erdtree or some other powerful entity removed his omen curse when he was felled protecting the Erdtree.\n\nThe messed up part is that means whatever removed his curse could have done so at any time but kept him as an omen because he was stronger that way and a better protector, only granting him full grace when he’s three breaths from dead.",
        "score": 38
      }
    ]
  },
  {
    "title": "Looking At The Carians Knowing Now That Albanaurics Could Walk And Looked Normal",
    "url": "https://i.redd.it/dq37y8u6906g1.jpeg",
    "score": 1206,
    "subreddit": "EldenRingLoreTalk",
    "body": "Well, the new Nightreign DLC came out. The Scholar character, we find out, is actually an Albanauric. And boy did that suddenly take me back to my favorite, scholarly, pale skinned royal family. \n\nOh and did you know that Radahn really loved his horse. He never got off the damn thing. He even studied gravity sorcery just so that he could forever ride the horse even after he got too big. Nothing else there. \n\nAnd what was up with Rykard. The game seems to note his aging physique. His faded red hair with a pale silver strand. Even though he's a demigod. He was aging, thats weird. \n\nRanni and Rennalla are technically never seen walking in their real bodies. \n\nEven the so called- Carian weed, who may not be Carian, Sellen, we never actually see her stand in her real body, but maybe im getting too ahead of myself.\n\nWere they cursed? Who knows. Regardless, I have my eyes on them.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:10.060622",
    "comments": [
      {
        "body": "Radahn can't fight you on his legs because his feet have been worn down to nubs from the years of them dragging across the sand.",
        "score": 93
      },
      {
        "body": "Miquella's implied connections with Caria, his dedication to saving the Albinaurics, and the way the his DLC boss cutscene focuses in on his legs as he walks out of the gate, like it's something important or to take note of, all have me looking at him the same way. There are also other things, like certain myths real-world ancient cultures held about albino people, that could imply an even deeper connection to the Albinaurics than were told in game if you want to go that far. Either way, you can't deny that it's a bit weird",
        "score": 83
      },
      {
        "body": "[**Sorcerer Thops** (unused line): *\"Oh, one more thing... Beware the Albinaurics... ...accursed souls born of a forbidden rite of the Eternal City. The curse withered the legs of the old, and silenced the tongues of the Frogs. And now they hold deep grudges for anyone left untouched.\"*](https://youtu.be/LT81hq7cEkI?si=180uuBPqNPaysRym)\n\nThis suggests that their disease/curse is a byproduct of their arcane origin.",
        "score": 76
      }
    ]
  },
  {
    "title": "In regards to Rennala,",
    "url": "https://i.redd.it/k7eudi2l7l3g1.jpeg",
    "score": 890,
    "subreddit": "EldenRingLoreTalk",
    "body": "I’ve watched Hawkshaw and many a-likes Elden Ring lore videos, and while information on Rennala was plentiful, I’m earnestly interested in learning her POV of the timeline (of which she lived) and how she was affected or made to feel. \nSuch as her relationship to her children and Consort(‘s) and whatever information can be gleaned of it from lore and item descriptions. I know the foundation of Rennala’s lore, but if anyone is educated and willing to share, I’d love to hear more about her and Caria as well.\nShe is such a complex character, of and outside of motherhood, and the lack of content produced from her story makes me weep.\n(If I’ve simply been looking in the wrong places, please link threads/videos.)\n",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:12.407429",
    "comments": [
      {
        "body": "I believe it wasn't just Radagon's abandonment that caused her to break. She's clearly trying to Rebirth children in the library boss arena, specifically daughters. Ranni's perceived death, Radahn abandonment for the Golden Order and his father and Rykards blasphemy probably were the main causes. \n\nActually Id love to learn more about the logistics of Ranni's death. She must have staged her body's death and let no one save Blaidd, Iji and Seluvis know of her true plans.... but then she was present on the Demigod council before the war so I don't know.... Was she present in doll form, where the other demigods not suspicious, did they just not care?",
        "score": 39
      },
      {
        "body": "Everyone sharing sad lore or just stuff from her past, so ima throw a wholesome bit of lore in here\n\nRellana, Rennala's twin-sister actually has short hair, the braid of long black hair that hangs out of her helmet isn't hers. Instead, it's a braid of Rennala's hair, Rennala gave it to her as a parting gift and sign that they will always be connected when Rellana forsook her Carian heritage to join Messmer in his crusade\n\nRennala was a good sister that supported Rellana's choices, and the two separated on good terms\n\nSouce is Rellana's helmet that pretty much states this directly",
        "score": 34
      },
      {
        "body": "The turtle in Liurnia (Miriel?) tells you a story about how they met and how their love bloomed from Radagon’s apology for his behavior. They did indeed love each other, and there’s proof of that still, where Radagon’s wolves are guarding their vicinities, and Rennala’s holding onto the amber egg he left her with. \n\nI think she generally had a good relationship with her children, as Radahn was always on Sellia’s guard, Rykard left his mom some Iron Virgins and defense and helped create magma sorceries, and Ranni protected her mother with a projection she created in case of intruders bothering her. Since house Carian is a matriarch, Ranni was the next heir, which is probably why Rennala is even more devastated after the loss of her entire family. ",
        "score": 31
      }
    ]
  },
  {
    "title": "Miquella was actually never that kind. (Warning: Immense yapping mega-post)",
    "url": "https://i.redd.it/ceknsptudp0g1.jpeg",
    "score": 758,
    "subreddit": "EldenRingLoreTalk",
    "body": "*(thumbnail art credit: notsakku on X)*\n\n&gt;\"Miquella had a good goal, but did things in an evil way.\"\n\n&gt;\"Miquella did nothing wrong, extreme solutions required extreme sacrifice.\"\n\n&gt;\"Radahn consented.\"\n\nI've heard some flavor of all these arguments from lots of people.\n\nKindly Miquella is evil, and always has been. Not a misunderstood good, but an evil misunderstood to be good.\n\nHe had good in him, of course, as most villains do: Love for his family. Positive ideals. A willingness to sacrifice himself for others. He likely believed himself to be good as well, as most villains do. With a natural ability to compel others' affections, he likely never got the chance to see the error in his ways.\n\nRegardless of who the blame lies with, his actual goals were still evil, his methods of achieving them were evil, and there is evidence he sometimes did evil and reckless things for no *good* reason at all. Regardless of intent, he is a villain. A complicated one, yes, but not nearly as morally grey as some people present him to be. \n\nThis is basically a huge essay. I tried to shorten it, but couldn't, so feel free to skip around. Also, I skip most of the Mogh/Ansbach stuff, because I think that's pretty obvious. Most of this, especially later on, is from the base game (and sometimes informed by the DLC).\n\n# Age of Brainwashing: \"If you have known sin...\"\n\nSome have often said *\"Miquella had a righteous goal, but the ends no longer justified the means, that's why he's the villain\".*\n\nHis ends weren't good or righteous at all. The Age of Compassion had a shallow positivity that preyed on peoples' desperation in a miserable world, but beneath the surface, it was a clear death of the soul.\n\nWar, hate, and cruelty would be gone. This *is* a good thing. But *all* conflict, disagreement, struggle, and the healthy resolutions that can follow would be gone as well. We see this in Miquella's circle of followers. Their problems are gone because their *identities* are gone. This is not a group of followers - it is a garden, full of Miquella's unalloyed lilies, actual human-shaped vegetables who immediately begin regressing into unresolved trauma, old loyalties, or outright murderous impulses *the moment* that Miquella's charm is broken.\n\nIf you disagreed with me just now, then you've just exercised one of the most fundamental aspects of our lives - the ability to think for yourself. This is what Miquella wished to strip away.\n\nHis age would have been an endless, dream-like haze without free thought, without emotional introspection, and without personal growth. It would be ruled and controlled by a childish god, and enforced by his overwhelmingly powerful warlord Consort, Radahn.\n\nThose charmed by Miquella are 'alive', but they are not truly *living*. Succumb to his charm, and your lifebar fittingly drops to zero, because you are all but *dead.* This is the Age of Compassion ending.\n\nI believe Melina puts it best.\n\n&gt;*\"However ruined this world has become, however mired in torment and despair... Life endures. Births continue. There is beauty in that, is there not? If you would become Lord, do not deny this notion.\"*\n\n\\- Melina, in reference to the *Frenzied Flame*.\n\nMiquella denied this notion, and is frighteningly similar to the Frenzied Flame in how he advertises it.\n\n&gt;*Become their lord.*  \n*Take their torment, despair.*  \n*Their affliction.*  \n*Every sin, every curse.*  \n*And melt it all away. As the Lord of Chaos.*\n\n\\- Hyetta\n\n&gt;*Tarnished one. Aspiring Lord of the old order. If you have known sin, if you grieve for this world, then yield the path forward to us.  To I, Miquella, and my promised consort, Radahn.*\n\n&gt;*Let your thoughts be only of love.*\n\n\\- Miquella\n\nBoth the Frenzied Flame, and Miquella, wished to melt all individuality into one unvacillating perspective: Their own. Both of them also attempt to convince us, with nearly identical logic, that this is the right thing to do.\n\nBut that was just his end-game. I'm also claiming that this dangerous behavior isn't new to the DLC. Beneath his extremely charismatic persona, his entire life shows subtle, yet egregious signs of manipulation, hypocrisy, zealous extremism, and selfishness.\n\n# Like mother like son: \"Please die a true death.\"\n\nMiquella's motif, among many, is to be a protector and **champion of the meek**. Remember that description.\n\n&gt;*Who is it that Miquella shall bless, if not the low and the meek?*\n\n\\- Sacred Crown Helm\n\nNo group in Elden Ring is described as more meek, persecuted and leaderless than Those Who Live in Death.\n\nEvidence shows Miquella willingly, and knowingly, contributed to their persecution in the Golden Order, and that he continued to refuse them entry into the Haligtree even after leaving it. I believe St. Trina took pity on the dead, however, and this is one of the reasons Miquella felt he had to cast her away.\n\nNow for the evidence.\n\nWe find Revenants and Putrid Corpses in the Haligtree, but neither of these are actually *Those Who Live in Death*, and are more generic examples of 'Undead' that don't fit the criteria of the latter. The distinction is important, and there is plenty of reason to believe *there is* a real distinction in both cases. I believe Miquella made that distinction too. But why?\n\nLooking into Miquella's past for answers, we can piece together who he was, and why this might be:\n\n* He learned Golden Order Fundamentalism and created several incantations for Radagon, such as Discus of Light. Radagon's own attributed incantations were scholarly pursuits \"in all but name\", demonstrating the laws of Causality and Regression.\n* Miquella created Incantations which seemed to display mastery of these two laws - golden discs fly out, and then regress inward. Unlike Radagon's own spells, however, these are *weapons*.\n* Miquella seemingly also created the Pulley Bow and Pulley Crossbow, described as being \"*made by a certain genius who learned Golden Order fundamentalism.\"* Given that Miquella also created Malenia's arm, a robust and mechanically genius *weapon* in its own right, this description fits perfectly\n* Near the Craftsman Shack on Mt. Gelmir, we see one of Miquella's Lilies. This is where we find the Pulley Crossbow. This hints more strongly that Miquella made these, and that his genius was often used to *create weapons.* This is not very characteristic of one who 'blesses the meek'.\n* Miquella also created Radagon's Rings of Light, likely his final creation for the Fundamentalists, as the description states he eventually abandoned Fundamentalism due to its inability to cure Malenia's scarlet rot.\n\nRadagon's Rings of Light is depicted with a gesture, 'Golden Order Totality', given to us by Goldmask after uncovering the secret of Radagon for him. It symbolizes a deeper understanding of Fundamentalism, one that Miquella certainly had.\n\nThe only other Incantation in the game which has Golden Order Totality depicted on it is Litany of Proper Death.\n\n*(I tried embed images here, but failed x\\_x, I will figure it out later)*\n\nA \"Litany\" is a prayer, and a \"Proper\" death could also be called a \"True\" death.\n\nLooking at yet another weapon of Miquella's creation, the Golden Epitaph, we see this:\n\n&gt;*A sword made to commemorate the death of Godwyn the Golden, first of the demigods to die.*\n\n&gt;*Infused with the* ***humble prayer*** *of a young boy; \"O brother, lord brother, please die a* ***true death***.\"\n\nThe Golden Epitaph *was infused* with a *Litany of Proper Death*, quite literally. They both have the ability to permanently kill Those Who Live in Death. The weapon art also grants a version of Sacred Order, another highly effective tool at killing Those Who Live in Death - and it presents the emblem of the Haligtree upon use. This, then, is a tool of the Haligtree.\n\nBut why did he make this?\n\nMiquella certainly cares deeply for his siblings. We see this through his devotion to Malenia. He wants Godwyn to experience a true death, and it's safe to say that he viewed such a death as a mercy. These are arguably healthy things to feel, in his position.\n\nBut we *can't* kill Godwyn with the Epitaph, or seemingly at all. If the Golden Order could have given Godwyn a true death, they would have. Instead, they left him far below the earth, to fester out of sight.\n\nMiquella could have honored Godwyn in any other way. Why does *a weapon designed to permanently kill Those Who Live in Death* serve to honor his brother's death?\n\nMiquella made this weapon, among others, to support the Fundamentalist Hunters and their persecution of Those Who Live in Death. Much like how Marika's sorrow led to her shattering the Elden Ring soon after Godwyn's death, Miquella's own sorrow had warped into vengeance. It was a vengeance against the meek and the lost, because they reminded him of Godwyn's curse, and never once does he extend his gentle hand to them.\n\nYou may be asking yourself, \"Maybe he doesn't hate them, but simply misunderstands them, or just finds them beyond saving?\"\n\nThis underestimates Miquella's genius. Among the many ways you can describe Miquella, he has three definitive characteristics that disprove any claims of ignorance:\n\n1. His genius understanding of Fundamentalism\n2. His overall intellectual curiosity and genius in other pursuits (Haligtree, Unalloyed Gold, Eclipse, advanced craftsmanship of all sorts, etc.)\n3. His empathy, which seems to be *worshiped* by others.\n\nWe know three characters who can fit each of these descriptions in lesser, yet still extremely obvious ways.\n\n1. Goldmask - Fundamentalist Genius, but not on the level of Miquella, at least not at first.\n2. Sorcerer Rogier - Intellectually curious, motivated to learn more about Godwyn's fate, much like Miquella pursuing the 'Eclipse' in Castle Sol.\n3. Deathbed Companion Fia - Purely empathetic, she self-admits to having a poor grasp of 'these grand affairs', and acts instead out of kindness, regardless of how the world views her.\n\n**All three of them reach the** ***same*** **opinion** on Those Who Live in Death.\n\n&gt;*The noble Goldmask lamented what had become of the hunters. How easy it is for learning and learnedness to be reduced to the ravings of fanatics;* ***all the good and the great wanted, in their foolishness, was an absolute evil to contend with.***\n\n&gt;***Does such a notion exist in the fundamentals of Order?***\n\n\\- Order Healing\n\n&gt;*\"Disturb not the Death of Godwyn, the exalted. We, who humbly live in Death...Live in waiting, to one day welcome our Lord. What right does anyone have to object? Our Lord will rise. The Lord of* ***the many, and the meek.****\"*\n\n\\- Fia\n\n&gt;*\"Fascinating, isn't it? That the Golden Order was pliable enough to* ***absorb practices that contradicted itself in the past.*** *With the Order broken, twisted, and in need of repair, such adaptability is more important now than ever.\"*\n\n&gt;*\"****These souls have committed no offence.*** ***They have every right to life****, only, they happened to touch upon a flaw in the Order.\"*\n\n\\- Sorcerer Rogier\n\nAll three of them reached this conclusion: Those Who Live in Death were needlessly persecuted, and no such evil exists within the fundamentals of Order. Our character is able to restore Death within Order, after all. As Pastor Miriel says, **\"All things can be conjoined\".**\n\nHeresy is a contrivance. Miriel, Goldmask, Fia, and Rogier all knew it. Miquella definitely knew it, but he didn't seem to care. He did not welcome Those Who Live in Death into any order - whether Golden or Unalloyed - even while knowing that it was completely possible to include them. He wanted them gone, and with them, the living memory of Godwyn's death which - like him - refuse to truly die.\n\nWhich brings us to St. Trina, who seems far more welcoming to the meek.\n\n# \"I abandon here my love.\"\n\nSt. Trina, associated with sleep, the color purple, reprieve, and love, has a list of things associating her with Those Who Live in Death. We find her in a place crawling with Those Who Live in Death, and her Putrescent Knight is - if not literally one of them - then at least visually representative of their kind in a way no other enemy is.\n\nThe similarities between Trina and death:\n\n&gt;*All tainted flesh eventually becomes putrescence, and this clump of it imbibed St. Trina's nectar, which* ***granted it eternal rest***. *And so it was that putrescence became her knight.*\n\n\\- Putrescent Knight Remembrance\n\n&gt;*A pale purple water lily that is on the verge of wilting. Material used for crafting items.  Exceedingly rare to find.* \n\n&gt;*A symbol of faith in St. Trina.* ***Dulls the senses, preventing agitation.***\n\n\\- Trina's Lily\n\n&gt;*The favor allows one to forget any aches and pains.* ***In Death, there is only peace, for in Death, there can be no sensation.***\n\n\\- Baldachin's Blessing, from Fia, the death**bed** companion.\n\nThe vividly purple waters near Godwyn, the 'fathomless slumber' Rogier describes when succumbing to Death, and Fia's calming presence as a 'deathbed' companion all strike thematic similarities with Trina.\n\nMany have theorized that Trina offered eternal slumber to those who suffered within Marika's order, one where Destined Death was removed. Sleep, then, was an addictive and comforting escape from life, in a world where one could not fully die.\n\n&gt;T*he sweet oblivion of sleep can become quite the habit.*\n\n\\- St. Trina's Arrow\n\nTrina is not likely to be a direct patron of Those Who Live in Death, but her methods of comfort fit perfectly with them; She did not shy away from their kind, even leaving several of her own lilies in places like Summonwater Village (as a fun side-note, because I'm not sure how reliable this is for lore).\n\nMiquella wanted nothing to do with it.\n\n&gt;*\"I abandon here my love\"*\n\nThe love for himself, the love for others, and *the love he refused to acknowledge.*\n\nIt is fair to say, as some have, that the *main* reason he abandoned Trina was to remove the part of himself that could not stand to see Miquella suffer in godhood. This is probably part of it, if not most of it.\n\nBut, if it was *only* to remove the self-love that prevented his ascent to godhood, then why did he *only* hide his abandoned half?\n\nHe did not hide the usage of Mogh's body, or Radahn's soul, despite how controversial it may have been to his followers.\n\nHe did not hide his discarded and precious Empyrean flesh - in fact, he seemingly left individual pieces of it everywhere, on full display. Ranni left her Empyrean flesh atop a tower that most will never climb, but Miquella made it a show at every single golden cross.\n\nIt's as if he was gloating: *\"Here I leave a single follicle of hair, and with it, abandon my rightful inheritance of the Erdtree. Look how much I'm sacrificing, guys.\"*\n\nAs if with bitter irony, however, he abandons Trina in a place filled with coffins and tombs, crawling with Those Who Live in Death, maybe even out of spite for her insistence to care for them. It is the only piece of himself that he hid from others, and he did so out of shame, knowing deep down that he had irreversibly betrayed his promise of compassion for all.\n\n&gt;*Kindly Miquella... I see you've thrown away... Something you should not have. Under any circumstances. How will you salvation offer...to those who cannot be saved? When you could not even save your other self?*\n\nNot far from the Stone Coffin Fissure, he leaves his Doubt and Vacillation. \"Vacillation\" is a wavering indesiciveness. Without context, one would likely accept that this was him merely abandoning his doubts about godhood.\n\nWith context, we can see a much darker meaning; With Trina's abandonment, he also abandons her ability to stir doubt in him, something he intends to strip away from everyone around him.\n\n# Abandoned Albinaurics, the Violent Haligtree, and Forsaken Castle Sol\n\nThere is other evidence to consider that speaks to Miquella's true nature. I'll be a bit more brief on these points, as there is less information to work with.\n\n**Albinaurics**\n\nLoretta was rumored to be an Albinauric, and wished to venture to the Haligtree to give them a safe haven. Why is it, then, that Loretta is the *only* Albinauric in the Haligtree?\n\nSuspiciously, her weapon's glintstone was replaced with Unalloyed Gold, something closely associated with Miquella's ability to charm others - something that adorns all of his knights and soldiers in the form of an Unalloyed Gold circlet.\n\nAll the other Albinaurics meanwhile, are either protecting, or *inside* of, an Evergaol in Ordina. An Evergaol is *literally* a prison, it's right there in the word. Why? It's not as if the evergaol makes the puzzle any harder - you can just walk into it. For gameplay reasons? The puzzle of Ordina is similar to the puzzle of Sellia, and the latter is not in an Evergaol, so this does not explain it. It seems intentional. Regardless of the truth, Loretta remains the only Albinauric in the Haligtree that we know of.\n\nThe Black Knives, who killed Godwyn, are also there. It's possible that Miquella did not like the Albinaurics very much either, and wanted to keep them at an arm's length from the Haligtree, but still found use in having them defend its entrance.\n\nAlbus and Latenna certainly seem to *think* they were welcome there. But they only have one half of the secret medallion, and when we finally grant it to Latenna, she eventually remarks that her destiny is in fact not with the actual Haligtree after all, but with her sister, Phillia, who is alone at the Apostate Derelict.\n\nSuch helpless people deserve the safety of the Haligtree, especially a person who is implied to be the very source of hope for Latenna's people. And yet, Phillia sits in the cold of an abandoned church.\n\n**Fun side-note:** Earlier, I mentioned the placement of Trina's lilies near some places where the undead walked. There are *tons* of Trina's Lilies in both the Albinauric Village and the Apostate Derelict. There is only *one* of Miquella's Lilies in the Albinauric Village. Exactly one. And there is exactly one Albinauric in Elphael.\n\nYou can find most of Miquella's Lillies in Caelid (around half of which are in Sellia... Radahn-bros?), Liurnia, and Leyndell. I'm not sure there's much to extract here, but I think at least some of their placements provide clues to their respective affections.\n\n**The Haligtree, not so much of a sanctuary**\n\n&gt;*Gauntlets worn by soldiers sworn to the Haligtree.*  \n*Rust-worn and stained through* ***unending conflict***.\n\n\\- Haligtree Soldier Gauntlets\n\nUnending conflict with who? The Golden Order never seems to invade, or even acknowledge, the Haligtree. No Demigod in the Shattering appears to ever go there either, except Mogh who came *once* to steal Miquella and never returned. Even if they are now paranoid of intruders, there is no *invasion* happening.\n\nBallistae-armed deathtraps, a fully armored Loretta, patrolling battlemages, and unalloyed armored knights protect the brace of the Haligtree. There is less resistance on the way to the Elden Throne than Miquella's sanctuary.\n\nWhen the Haligtree soldiers, described as seeing 'unending conflict', are weakened, they willingly *explode* as a final and fanatical defense.\n\n&gt;*Spirits of common soldiers who carry the sacred light. When weakened, they explode to deliver a last-ditch attack.*  \n*This was the bitter revelation discovered by the desperate soldiers who awaited the return of their lord to the rotted Haligtree.*\n\n&gt;***May the flash of our deaths guide Miquella's return.***\n\n\\- Haligtree Soldier Ashes\n\nThis effect comes from a crystal tear, which we can find ourselves.\n\n&gt;*A defective crystal tear which possesses* ***absolutely no medicinal qualities***. *A lesson said to be learned the hard way for some;* ***faith can be a volatile matter, after all.***\n\nIt's fitting that Malenia, Blade of Miquella, also *exploded* into Scarlet Rot when Radahn had weakened her - a final and last-ditch attack meant to kill him, all so her beloved brother could claim his soul.\n\n**Castle Sol's Eclipse**\n\nEarlier, I established my belief that Miquella wanted Godwyn to have a 'true death', one the Golden Order could not give.\n\nAnd so, when Miquella abandoned Fundamentalism, he searched for a new solution - one outside of its tradition.\n\n&gt;*... Ohh great sun! Frigid sun of Sol! Surrender yourself to the eclipse! Grant life to the soulless bones!*\n\n\\- 'Eclipse Spirit' at Castle Sol\n\n&gt;*Lord Miquella, forgive me. The sun has not been swallowed.* *Our prayers were lacking. Your comrade remains soulless...* ***I will never set my eyes upon it now. Your divine Haligtree.***\n\n\\- 'Medallion Spirit' at Castle Sol\n\nI know this is a complicated rabbit-hole of a topic that many people have tried giving a crack at, and it distracts from my point. I may, in the future, make a post or video about my own take on the Eclipse.\n\nBecause Miquella's opinions of Those Who Live in Death are an important point in my post, however, I'll briefly touch on this. I believe the 'Eclipse' is, simply put, the fully restored Cursemark of Death. The Eclipse Shotel, which the above 'Eclipse Spirit' is praying to, looks suspiciously similar to the Halfwheel Cursemark on both Godwyn and Ranni's body.\n\n&gt;*Cursemark carved into the discarded flesh of Ranni the Witch.*  \n*Also known as the half-wheel wound of the centipede.*\n\n&gt;*This cursemark was carved at the moment of Death of the first demigod,*  \n*and should have taken the shape of a circle.*\n\nThe fully restored cursemark - something which, in theory, would have given Godwyn a true death - looks suspiciously like an Eclipse. You can look these up for yourself, if you'd like.\n\nMiquella did not fully understand what happened to Godwyn. How could he? We are the first person to uncover the **full** details of Ranni's conspiracy, something only possible by doing Ranni's questline and being granted the key to the inverted Carian Study Hall. This allows us to access Ranni's true body and retrieve the other halfwheel, the key missing ingredient in this puzzle.\n\nPerhaps he somehow approached the truth, a fragmented idea of this 'Eclipse', but could not finish the puzzle. In either case, Castle Sol fails at the strange task Miquella gave them.\n\n&gt;***I will never set my eyes upon it now.*** *Your Divine Haligtree.*\n\nGiving Castle Sol only *half* of the Secret Medallion, Miquella purposefully coaxes them with an incomplete key to his supposed sanctuary, demanding they *do the impossible* to earn the other half.\n\nHe didn't have to give them a useless *half* of a key - it was a carrot on a stick, and a cruel thing to do. Even as their spirits, *to this day,* continue to desperately pray for the Eclipse and beg Miquella for forgiveness, they are left in the cold without answer.\n\nIf a person sees someone cold and alone on the street, gives them half of a bus ticket to a warm shelter, then says they can have the other half *after* they fully calculate every digit of Pi, are they a kind person? No.\n\n# \n\n# Conclusion - Cursed with eternal youth\n\nKindly Miquella is not *truly* kind, and never really was, even if he tried to be. He is a child with pretty ideas, ideas which, like him, never fully mature. Like some children, he shows selfish and manipulative behavior to get what he wants - a tactic that often works. Children don't really do this consciously, and he likely didn't either.\n\nHe likely lived his entire life never actually thinking what he was doing was wrong, and earnestly did do selfless things that showed his desire to be kind. Still, when you have the natural ability to compel peoples' affections, you likely don't ever hear criticism. All you see is others' adoration of you. Of course, when the world begins to crack, he reaches out his hand to help.\n\nThat's what really makes him so terrifying. His inconsistencies, manipulations of others, and the problems with his Age of Compassion are all invisible to him, because his power makes it invisible to others. With just the slightest exposure, you too will be unable to see those flaws, and be willing to die for him, regardless of what evidence lies before you. Regardless of what pain you had before facing him.\n\n&gt;*Miquella the Kind...* ***is a monster.***  \n*Pure and radiant, he wields love to shrive clean the hearts of men.*  \n***There is nothing more terrifying.***\n\n\\- Ansbach\n\n&gt;*My brother will keep his promise. He possesses the wisdom, the allure, of a god –* ***he is the most fearsome Empyrean of all.***\n\n\\- Malenia\n\nEdited:\n\nRephrasing to further clarify that I don't actually think Miquella is some cartoonish, one-dimensional evil. My phrasing is obviously pretty harsh, but this was framed as a response to arguments that say Miquella was only ever kind, had a completely justified goal, and that only his actions on reaching that goal were bad. The Age of Compassion was just as bad as the methods he used to achieve it, and his character in other endeavors showed cracks in that kindness, even if he was not aware of them.\n\nOf course, this is just my theory. You're free to believe in what you want, and I could have missed important things that contradict my arguments. Elden Ring's lore is full of detail and very easy to run wild with. After seeing so many posts and videos ignoring these jarring details of Miquella, though, I felt I had to stir the pot a little...",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:34:14.971693",
    "comments": [
      {
        "body": "\"If you disagreed with me just now, then you've just exercised one of the most fundamental aspects of our lives - the ability to think for yourself. This is what Miquella wished to strip away.\"\n\nDamn this is some next level paradoxal genjutsu right there",
        "score": 39
      },
      {
        "body": "I feel like most of the analysis here is putting the carriage in front of the horse, analyzing something that doesn't paint a clear picture towards a conclusion that Miquella is a cartoonish mustache-twirling evil. \"If something doesn't add up, that must be Miquella was using his genius to manipulate things.\"\n\nFor example, the analysis about the Golden Epitaph. The entire analysis is based on taking the fact that it can't be used to kill Godwyn towards the direction that his aim was to kill Those who Live in Death to honor Godwyn. It's just as possible that Godwyn's state was something they'd never seen before but resembled the regular Those who Live in Death, so Miquella assumed a regular weapon for permanently killing Those who Live in Death would have worked. Or it could actually have worked but he never had the chance, but the quest just doesn't give us the option because the whole point of the Godwyn questline is to turn him into a Mending Rune. I find the \"Miquella must have resented Those who Live in Death\" argument unconvincing. I mean, the lore outright states what Miquella was thinking, not even \"he's said to have XXX\" but his own quotes. I know even item descriptions can't always be taken at face value, but this doesn't seem to be it.\n\nSimilarly, just because we don't personally witness an invasion on the Haligtree or know a faction that's currently out to destroy them, that doesn't mean there hasn't been one. Malenia has been fighting off enemies that reach all the way into where she waits, the deepest place of Elphael. This is a case of outright dismissing what's explicitly stated in the lore and makes the difficulty sensible in order to reach a certain conclusion. The self-detonating soldiers are also overly dramatized: yes, it's obviously a horrific sight, but it's just one case of people of faith going crazy in a state of desperation. It speaks nothing about Miquella, and we can turn the analysis the other way if we wanted, that if Miquella was around such a sacrifice would never have been even allowed.\n\nThis analysis also dismisses the presence of misbegottens and omens in the Haligtree. I think I also remember a video that pointed out that there are Albinaurics in the Haligtree, but in cocoon state.\n\nOverall, while I have no interest in making Miquella out to be more justified than he deserves to be, I think this analysis is mostly taking the vagueness of lore to flatten a character's complexities, depths, layers and imperfections into a simple \"oh he's just evil\" sentence. I'd much prefer analyzing characters in terms of their layers. It makes more sense for him to be a child who doesn't fully understand the implications of his actions and what it means to truly commit to something, than for him to be an evil genius mastermind who's perfect at manipulating everyone.",
        "score": 31
      },
      {
        "body": "Noooooooo, Miquella did not learn Golden Order fundamentalism because he wanted to persecute those who lived in death,  he did so because of the main tenets of the religion. Causality and Regression. Causality states that everything is connected, Regression states that everything yearns to return back to its original source. Think about it, if you were a misbegotten, or an Omen or an Albanauric or one of those thag lived in death, you were persecuted because you were seen as outside the system, Golden order fundamentalism essentially says,  no, despite how disconnected everything is, we are all connected in some way to a similar source and upon death we will all return to that source. It's part of the reason why you see miabegotten warriors revere Radagon. It's why Miriel always says that all things can be conjoined even when you bring him Heretical spells. That's Golden order fundamentalism l.",
        "score": 26
      }
    ]
  },
  {
    "title": "I challenge anyone to provide a better answer to the GEQ than this",
    "url": "https://i.redd.it/07gxwh8wvb4g1.jpeg",
    "score": 680,
    "subreddit": "EldenRingLoreTalk",
    "body": "Submit your theories and reasoning, or feel free to debate why I'm wrong. I consider this to be the most likely answer, simply because I find that it makes the most sense and there is more reasoning and links to this conclusion than any other theory I have read (and I have read a lot). I also believe this is why we didn't really get any GEQ lore in the DLC, because there is plenty of evidence in the base game. I would be very happy to be proven wrong and to hear a better theory. \n\n\n\n**Who is the Gloam Eyed Queen (The Queen in Black)?**  \nMarika, and by extension, Melina, who is an offshoot/daughter/reincarnation of Marika.\n\n**When on the timeline did the \"God Hunt\" occur?**   \nShortly before Marika became \"Marika the Eternal\".\n\n**What God/s was hunted?**  \nThe Fell God, spread across the Trolls. The Trolls were skinned and the Fell God was cut out of the Trolls abdomen and replaced with a tablet, which likely contains magical properties that can ward off the Fell Gods influence. The trolls that are not skinned are those who originally betrayed the Fell God and the Fire Giants, and joined Marika and Godfrey's forces during the war. Now they remain as guards to the Forge of the Giants.\n\n**Why did she do this?**  \nOn top of the fact that they were a huge threat to her in general, it is stated that the Fell God also \"*haunts the sagas of the Hornsent*\". We know that Marika had some kind of alliance with the Hornsent, likely because she needed access to the Gate of Divinity. What better way to gain their trust than defeating an enemy that has haunted them for generations.\n\n**How did she do this?**  \nEven before becoming a God, Marika had already amassed great power and many allies. She was also an Empyrean, meaning she had direct ties to Metyr.\n\n**The elephant in the room, Malekith, and why he would have \"defeated\" her.**  \n*\"Marika's sole need of her shadow was a vessel to lock away Destined Death. Even then, she betrayed him.\".* This explains it all since it's well known that Marika wanted to remove death all together. She planned for Malekith to defeat her and seal away Destined Death once she had finished using it's power. She used him, and that is how she betray him.\n\n\n\n**My reasoning and \"evidence\" (I'll try to organise it):**\n\n* The Godskin weapons are large, and that is even made clear in their item description. This likely means that they were used for skinning large creatures, such as the Trolls.\n* The Godskins have \"assimilated\" inhuman physiology, similar to that of the crucible. Assimilate is an interesting word to have been used, meaning that they took in these traits from somewhere. The Furnace Visage depicts the Fell God surrounded in horns, directly linking it to the crucible.\n* Trolls, which are descended from Giants, all have the front of their abdomens carved out. This is the same location where the Fell God sits on the Fire Giant we face. All the trolls, except for those found in the mountain tops, appear to be flayed. The natural skin colour of the Trolls also appears to be white, matching that of the Godskins attire.\n* The Noble Presence incantation mirrors that of the roar of the Trolls and the eruption attack move during the 2nd phase of the Fire Giant. It's description states: \"*Once a sign of the gods' wrath, this incantation became a trophy of the Nobles' god hunt.*\"\n* The Godskins Noble Robe has 7 faces in a circle with a sigil at the bottom that looks an awful lot like Metyr, and another symbol in the center. This pattern is the same as the Fell Gods Eye, eight circles surrounding a center circle.\n* The Trolls have golden/yellow eyes, the same as the faces on the Godskin Noble Robes. The Trolls face even share a similar all-round tentacle like feature to these faces.\n* The Furnace Visage is said to depict the Fell God, but the Fell God typically has only one eye. This makes sense though if the Furnace Visage is actually depicting the face of a Troll, which is similar in design.\n* The Godslayer's Seal and the sigil for Black Flame Incantations look a lot like Metyrs head.\n* Blackflame Monk Amon is said to have fled from the Giants Flame when he swore fealty to the Black Flame. Why turn to the Black Flame? Why make this connection between the Fell God/Fire Monks and the Black Flame/GEQ?\n* It is specifically stated that the Fell God was said to have been slain by Marika.\n* The cave where we find the Godskin Swaddling Cloth is right near where the Battle against the Giants took place, and the First Church of Marika.\n* It is stated that the Age of the Erdtree began right after the war against the giants when the Trolls betrayed and fire was vanquished. It makes sense that this happened, Marika gained the trust of the Hornsent and got access to the Gate of Divinity, allowing her to become a God, Marika the Eternal.\n* The frenzied trolls in the snowfields are likely Trolls who managed to escape or were set loose because they were afflicted by frenzy due to the trauma they went through.\n* The trolls with Fur in the mountain tops have fur and guard the forge because they are the Trolls that betray the giants and joined with Marika. People say that they have fur \"because it's cold\". I know it's a game, but evolution doesn't just happen like that, and the other trolls are very clearly skinned/flayed and are not just simply missing their fur.\n* There are only 2-3 trolls in the Shadow of the Erdtree, likely because Marika removed them as part of her plan to gain the trust of the Hornsent.\n* How could Marika have gotten away with all this? Marika is already known to have rewritten the history books and hide her own past. People in the Lands Between know these events happened, but her name has just been removed and replaced with the Gloam Eyed Queen.\n* Rykard speaks \"blasphemy\", likely about Marika's past. There are a lot of dead trolls on the Road to Iniquity that have likely been tortured and interrogated for information, but there is a single Frenzied Troll right outside Volcano Manor. I would guess that this Troll was tortured and revealed the truth about Marika to Rykard and his Inquisitors before succumbing to frenzy and going mad.\n\n\n\nHope you enjoyed",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:34:17.335004",
    "comments": [
      {
        "body": "Aside from the various points I made [when you last posted about the Godskins hunting the giants and trolls](https://www.reddit.com/r/EldenRingLoreTalk/comments/1ncj9y0/the_geq_godskins_hunted_the_fell_god_spread/nd9sfs4/), the biggest issue with your theory is that while there's plenty of fairly convincing theorizing as to why/how Marika could be the GEQ, there's equally as much (and equally as convincing) theorizing as to why she *couldn't* be. The one I usually bring up is that Maliketh canonically defeats the GEQ *before* the Rune of Death is sealed, which is linked to the creation of the Golden Order. Which means that, if Marika is the GEQ, *Marika* would have had to have been \"defeated\" for basically her entire reign as Marika the Eternal. Which obviously doesn't make any sense.\n\nAs for \"submitting my own theory\":\n\n&gt;Who is the Gloam Eyed Queen?\n\nAn otherwise unnamed character, who we never learn about or interact with in any context other than her being the GEQ. In other words, she's **her own character**.\n\n&gt;When on the timeline did the \"God Hunt\" occur?\n\nShortly before Marika's ascension in Enir-Ilim.\n\n&gt;What God/s was hunted?\n\nHornsent divine beasts and tutelary deities.",
        "score": 34
      },
      {
        "body": "''The forbidden shadow, plucked from the Golden Order upon its creation''\n\n\"Plucked\" is the optimum verb to describe removing an eye; Marika is missing her left eye (most noticeable during Age of Stars when Ranni holds up Marika's head), while her bestial shadow gifts us a stone eye to hunt death with that both matches Marika's calcified form and the clawed seal over Melina's own left eye.\n\nMelina would also be burned and bodiless if she was removed from her own body, a body that once manipulated the black flame.\n\nThis is how From seed their soil, not with a hard timeline missing chunks but with ambient, compositional clues for the player to occasionally spot and put together.",
        "score": 23
      },
      {
        "body": "I've always thought this.\n\n Marika has a veil that magically disguises her and already has one known alter ego. (She was also inspired in part by Odin, a god famous for his trickery and disguises). \n\nThe GEQ was called \"The Queen in Black\" in early builds of the game. What other Queen do we see wearing black?\n\nShe has motivation to slay any other gods. \n\nThere are clear connections between the Shamans and the festivities in the Windmill Villages.",
        "score": 23
      }
    ]
  },
  {
    "title": "Messmer and Godwyn are twins?",
    "url": "https://www.reddit.com/gallery/1p6vpt5",
    "score": 664,
    "subreddit": "EldenRingLoreTalk",
    "body": "Base Serpent Messmer having a similar look to Goddess of Rot Malenia always bothered me. It felt important yet I couldn't understand how. They could have given him any design yet the chose one that has clear parallels to Malenia? \n\nNow I believe the design choice was to tell us that Messmer is Someone's other half. That someone is Godwyn\n\n\"An affair from which GOLD arose, and so too was SHADOW born\" -story trailer \n\n\"This incantation channels the force of the scadutree, it's GOLD is accompanied by SHADOW \"- Land of Shadow\n\n If All Gold is accompanied by Shadow, then Godwyn the GOLDEN wouldn't be an exception. Right? \n\n Where is his Shadow? If you ask me, It's Messmer. They were both the first born. ",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:19.680660",
    "comments": [
      {
        "body": "2 friends in a hours span is crazy work",
        "score": 70
      },
      {
        "body": "“She was friends with both fathers, only hours apart” lolllllll",
        "score": 64
      },
      {
        "body": "Lmao she was friends with both fathers hours apart",
        "score": 58
      }
    ]
  },
  {
    "title": "Golden Order did an amazing job hiding the atrocities they committed in Land of Shadow.",
    "url": "https://i.redd.it/lse275n0c03g1.jpeg",
    "score": 653,
    "subreddit": "EldenRingLoreTalk",
    "body": "Just think about it. There are like 50 factions in the world after the shattering and not even one of them mentions the fact that Marika is currently running a genocide in Land of Shadow. \n\nOne day a big chunk of world is just veiled, its citizens are genocided and not even one person mentions that. Knowing how insane Marika is, she probably hunted down everyone with the knowledge of her actions, erased the existence of Land of Shadow from every history book and her family who are in the know just keeps quiet about it. \n\nI know its awful but It’s actually lowkey impressive that they were able to erase history to that extent where no one mentions of it. ",
    "category": "History",
    "scraped_at": "2025-12-09T15:34:22.257670",
    "comments": [
      {
        "body": "It wasn’t the Golden Order, but Marika personally. The GO is the religious and political body that governs TLB. What Marika had done in the LOS is entirely secret; only Messmer’s Crusade who committed the genocide knew, and only Miquella knew about Marika’s actions to ascend. He ventured in to ascend on his own accord in an effort to “reset” the method for himself.",
        "score": 47
      },
      {
        "body": "Not really impressive when she was also running a genocide on everyone else so they couldn’t care less about the hornsent.",
        "score": 35
      },
      {
        "body": "It wouldnt have been that hard. Not even including the fact that the Golden Order(which is merely an idealogy) most likely wasnt even really in power since the Erdtree still seems to be the main faith for the crusaders, The Golden Order does not care for the graceless. The Hornsent who's power stems from the crucible would have been reviled.\n\nThis, and that majority of the Erdtree faithfull most likely just stuck to Leyndell and the plaeteu around it, the happenings in the land of the Tower would have been ignored.",
        "score": 23
      }
    ]
  },
  {
    "title": "The Two Fingers Heirloom depicts followers with a braid. The Outer God heirloom depicts followers with a waistband.",
    "url": "https://www.reddit.com/gallery/1pfvr03",
    "score": 602,
    "subreddit": "EldenRingLoreTalk",
    "body": "",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:24.618939",
    "comments": [
      {
        "body": "I think this confirms that the Shamans worshipped the two fingers, not just Marika. Perhaps this strengthens the idea that those lampreys in the Finger Ruins of Dheo were Shamans before.",
        "score": 83
      },
      {
        "body": "everybody is talking about the beings in image one being braids\n\nam I the only person that sees the natural indentations of a spine?",
        "score": 50
      }
    ]
  },
  {
    "title": "Is there a specific lore reason the crucible knights are named after epochs?",
    "url": "https://i.redd.it/fubdwq0v3e2g1.jpeg",
    "score": 592,
    "subreddit": "EldenRingLoreTalk",
    "body": "The three named crucible knights are Devonia, Siluria and Ordovis, which is a clear reference to three of our real world evolutionary epochs (I only just made the connection while watching a doco on sharks). Outside of it being a broad reference to their age and the general vibe the crucible, is there a more specific lore reason?",
    "category": "History",
    "scraped_at": "2025-12-09T15:34:26.992722",
    "comments": [
      {
        "body": "Look what evolves right after the Devonian.\n\nTrees.\n\nThe Crucible is the “Primordial Form of the Erdtree”. \n\nThat’s what the Crucible Knights are looking for. \n\nThey’re the Knights of Godfrey, first Elden Lord. Godfrey, as first lord and chief amongst the Tarnished, likely established Round Table Hold.\n\nAnd these Knights of the Round table are on a quest to find the crucible (which is, in the context of smithing, basically a cup), because this holy cup was the thing that gave birth to the present religious order. It’s the most sacred artifact known to man. \n\nSo they’re an allusion to Arthurian legend, meant to show how the generally pagan religious traditions that preceded the Catholic Church were subsumed and subsequently displaced, uprooted, and dislodged from their true historical and cultural context. (In the same sense that Arthurian legend is likely a synchretization of local British folkloric traditions into a narrative framework that is compatible with Christian tradition). \n\nThey are looking for their place in a world that has grown past them. \n\nThey’re searching for the holy grail. \n\nBut it does not exist because the object of their worship was, in essence, the seed of the Erdtree.",
        "score": 52
      },
      {
        "body": "The first plants that we would define as trees originated in the Carboniferous period, in the era that comes immediately after the three periods after which these knights are named.\n\nThey're crucible knights. The crucible was the original form of the Erdtree, or rather, it existed before it.\n\n&gt;Outside of it being a broad reference to their age \n\nDo you assume they're from the same period as the crucible? They are not, or at least there is no indication in the game that would suggest this.\n\nThe descriptions in the game tell us that they were an **order of knights dedicated to** the Crucible and served under Godfrey.   \nThey're more like real-life orders of knights who devote themselves to certain teachings, ideals and purposes. I would rather compare them to the Knights Templar, the Order of St. John, etc., or, to bring it back to Elden Ring rhetorically, to the Knights of the Round Table, for example.",
        "score": 35
      },
      {
        "body": "They're most likely just named after the same thing the epochs are named after: Roman-era British tribes. The Crucible Knights were led by Godfrey/Hoarah Loux, and Godfrey has a ton of King Arthur references.",
        "score": 27
      }
    ]
  },
  {
    "title": "Promise Me You'll Be My Consort",
    "url": "https://i.redd.it/vqsemrbqqs4g1.png",
    "score": 579,
    "subreddit": "EldenRingLoreTalk",
    "body": "Revisiting this cutscene.  Let's start from the (challengable) position that From put it in there for a specific reason. On the surface, it's pointless because it is re-delivering information already given to us in multiple other places.\n\n**Miquella is asking his brother to make a promise** in person. Not that Radahn took the initiative to make a promise. This is a very important distinction when the one doing the asking demonstrably compels affection/obedience in every single other example we have of him interacting with people directly.\n\nMaybe a bit bold of a theory, but I don't think this is much of a debate.  Miquella asks Radahn for something and Radahn has to do it.  I actually find this to be extremely straightforward even though \"Was Radahn charmed?\" and the nature of Miquella's charming ability have been hotly argued as topics.\n\nTHAT BEING SAID, there are still questions:\n\n* Leda and Dane don't need the charm to be loyal to Miquella, but are affected regardless to make them accepting of the others in the party.  Miquella compelling the vow does not necessarily mean it was entirely against Radahn's wishes.\n* Does Miquella have total control over his ability to compel affection such that it is always a purposeful act, or can it happen inadvertently?\n* **Miquella compelled a promise for an act, not the act itself, which opens the door to all sorts of possibilities, including Radahn trying things to circumvent it.**\n\nRandom related questions:\n\n* Radahn and Jerren made oaths to each other for honorable deaths.  Why was that needed if he already had one with Miquella/Malenia?\n* If Radahn expected to become Miquella's Lord, why did he siege Leyndell and challenge Morgott as part of the Shattering War, something only an aspiring Lord of Marika would need to do?\n* If Radahn is satisfied by his honorable end, why is he ok with being dragged back?\n* Why would Radahn, a man obsessed with war and honorable combat, be interested in lording over an Age of Compassion?\n\nAnsbach is so convinced by the idea that Radahn wouldn't want to return that he assumes it would convince Freyja to side with him in stopping the ritual. But she is too obsessed with Radahn's warlike persona to understand the true implications and is only excited that Radahn can return and keep fighting. Totally oblivious to the fact that the Age he is returning for is to be one lacking merit-based stature and lessened/no conflict. Ansbach only laughs at how stupid Freyja is.\n\nEDIT: Our boy Ansbach would never call someone stupid, and pedantic people have taken issue with my wording.  He's saying he thought she would act a certain way based on provided information and then did the opposite, which is both amusing to him but also sort of expected.  Which some might concisely call 'being stupid'.\n\ntl;dr There are major inconsistencies to this story and what we know about Radahn, I believe it is reasonable to conclude that the vow was against his wishes.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:29.348249",
    "comments": [
      {
        "body": "My belief is that Radahn wanted nothing more than become Elden Lord as he is a big fanboy of Godfrey and his Dad, the 2 Elden Lords.\n\nAnd he made the promise with Miquella, as a way to achieve the Title of Lord.\n\nOnce he got his Great Rune and all the power that came with it, he felt that he no longer needed Miquella to become a Lord. He could do it himself.\n\nWith this Miquella sent Malenia to remind Radahn that he had a promise to keep.",
        "score": 35
      },
      {
        "body": "I think it's telling that we never once see/hear Radahn agree to.any of this. He appears to have no agency at all. On the other hand we know Miquella has the ability to compel affection and obedience and that Malenia had to remind Radahn of the vow at a critical juncture.",
        "score": 28
      },
      {
        "body": "Yeah, we really have to think about what that promise meant in the context of the events prior to the game, especially with The Shattering.\n\nRanni, Malenia, and Miquella were Empyreans. Explicitly, they were the only known beings in TLB to be capable of succeeding Marika, THE God. What an insane honor and it seems like everyone already knew it was going to be Miquella. Ranni sure wasn’t interested (putting that lightly) and Malenia only wanted to serve Miquella.\n\nPrior to the world falling apart, I’m positive being asked to be the consort of the next God of your plane of existence is absurdly flattering, to say the least. Considering Radahn’s inspirations and aspirations in the context of peak-era TLB, it’s interesting to consider what his response would be, including and excluding Miquella’s charm ability.\n\nThen the Shattering happened.\n\nNow the Two Fingers kicked off the Demigod Royal Rumble to be the Third Elden Lord and Radahn got a Great Rune, baby. Now Miquella went from future meal ticket to potential competitor to potential irrelevant failson depending on the next Lord. \n\nUnfortunately for Miquella, Radahn’s here to win and The Shattering destroyed all guarantees of Miquella’s succession. \n\nThen Miquella sent Malenia to remind him what’s up. She performed her role wonderfully. Then SOTE happens, blah blah blah.\n\nThat single cutscene reveals a ton, it’s pretty cool. There’s aspects of it I didn’t even touch on (Like what is the “our vow” about, huh???)",
        "score": 20
      }
    ]
  },
  {
    "title": "I find it very amusing how much the DLC is like a reimagination of the base game.",
    "url": "https://i.redd.it/xh5bztptgc3g1.jpeg",
    "score": 572,
    "subreddit": "EldenRingLoreTalk",
    "body": "*Awfully long list* (Amendments welcome)\n\n-Start in graveyard land (Limgrave/Gravesite)\n\n-Npc at the start of the game trying to recruit you for the bad guys (Varré/Leda)\n\n-Enemy you’re definitely not ready for (Tree Sentinel/Furnace Golem)\n\n-Storm themed area for first legacy dungeon (Stormveil/Belurat)\n\n-Horned bastard pretending to be someone else (Margit pretending to be Morgott/Dancing Lion pretending to be a divine beast) in the storm themed area\n\n-Magic castle (Academy/Castle Ensis)\n\n-Carian princess (husband absent) in a puddle (Renalla/Relanna)\n\n-Mounted Gravity Magician With No Legs who is general of an army (Radahn/Gaius) (Bonus points for having learned Magic together)\n\n-Gatekeeper to the big castle on Altus (Draconic Sentinel/Hippo)\n\n-Child of Marika who is cursed and lives in a big castle in Altus (Morgott/Messmer)\n\n-Tree that you burn down to get to the final area (Erdtree/Sealing Tree)\n\n-Final area is storm themed and is spinning in nature (Farum Azula/Enir Ilim)\n\n-The final storm themed area has similar enemies to the first storm themed area (Horned Warriors get upgraded to Divine Beast and Bird Warriors/Banished Knights are in both Stormveil and Farum Azula) and the boss is someone who is really not supposed to be there (Maliketh/Radahn)\n\n-If you find a secret entrance in the big castle in Altus there’s a secret area if you find the hidden wall in the secret area you get another secret area and then you go insane (Hidden wall in Shadow Keep eventually leads to Midra/Leyndell Sewers eventually leads to Three Fingers)\n\n-You have to defeat the horned bastard or else you can’t go insane (Mohg Illusion/Jori)\n\n-Story heavy NPC betrayal at the end of the game (Gideon/Leda &amp; Friends)\n\n(These Next ones are a bit of a stretch)\n\n-Dragon area with Dragon super boss that is gravely injured and also is quite out of the way (Farum Azula &amp; Placidusax/Jagged Peak and Bayle)\n\n-Start an NPC quest in a church and then go to two quest related areas and then you can fight the optional superboss (Meet Millicent at Church of the plague, leads you to two medallions, fight Malenia/Meet Ymir at Cathedral of Manus Metyr, leads you to two hanging bells, fight Metyr)\n\n-You follow a river down to a huge underground section where there is a lot of undead related stuff (Cerulean Coast—&gt;Stone Coffin Fissure&gt;Putrescent Knight/Siofra river—&gt;Deeproot—&gt;Godwyn)",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:31.679243",
    "comments": [
      {
        "body": "Earth is 4.4billions old and we were lucky enough to live in the same age as elden ring.",
        "score": 24
      },
      {
        "body": "I guess you could say it really is the shadow of the base game",
        "score": 28
      },
      {
        "body": "Hmm, interesting point.\n\nYou could almost call it... a reflection of the main game, but darker in tone and nature.  Kind of like... a shadow of the Erdtree, even.",
        "score": 30
      }
    ]
  },
  {
    "title": "Godwyn's Death Was A Botched Ritual",
    "url": "https://i.redd.it/ka47tyarm84g1.jpeg",
    "score": 557,
    "subreddit": "EldenRingLoreTalk",
    "body": "Although I have little in the way of proof, I believe that the Nox attempted to make Godwyn their Lord of Night, a plan that Ranni ultimately sabotaged. This would account for the Black Knife Assassins targeting Ranni.\n\nI believe that Ranni was initially a conspirator but double-crossed the others. The Night of Black Knives was designed not merely to kill the scions of the golden lineage, but to resurrect them as Lords for a new Age of Night, with Godwyn as the crucial element.\n\nI believe the Night of Black Knives was a failed three-way ritual. Godwyn's aim was to become a god, specifically a Dragon Lord. According to the 'sacred scroll rites,' this transformation requires the prospective god to die and then be reborn into a new vessel. Godwyn was likely attempting to be reborn in the vessel of a dragon to achieve this Lordship.\n\nThe Nox, using their silver tear experiments, were attempting to create a Lord by crafting flexible vessels capable of absorbing stray souls, one of which might become strong enough for the role. (There’s a controversial theory that suggests Godwyn is a mimic; I disagree, but I do believe some mimic tears were created to potentially house Godwyn's soul.)\n\nGodwyn, I believe, intended to die regardless, pursuing his own agenda. This was separate from the Nox's goals and Ranni's goals. The Nox thwarted Godwyn's plans, only to have their own plans subsequently foiled by Ranni, who was likely allied with the Nox before she acted against them.\n\nThis plot may have involved most of the Carians, including Radagon, as eliminating much of the Golden Lineage would have significantly elevated the status of the Carian children and, by extension, Radagon himself.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:34.032801",
    "comments": [
      {
        "body": "&gt;I believe the Night of Black Knives was a failed three-way ritual. Godwyn's aim was to become a god, specifically a Dragon Lord. According to the 'sacred scroll rites,' this transformation requires the prospective god to die and then be reborn into a new vessel. Godwyn was likely attempting to be reborn in the vessel of a dragon to achieve this Lordship.\n\nI've no idea where this whole \"Dragon Lord\" thing is coming from nor is it the prospective god that dies, it's the prospective *Lord* that dies.\n\nBut yes, that Godwyn had been killed to be reborn as Miquella's Lord was one of the most common theories about what would happen in the DLC. Then they revealed that it was actually Radahn, despite the idea that the Lord needed to be reborn was somehow still correct.",
        "score": 46
      },
      {
        "body": "This whole theory is premised on mixing up the roles of the lord and god as set forth by the secret rite scroll. \n\nYou use lord and god interchangeably, but they're very distinct roles in the lore. *Especially* regarding the secret rite scroll.\n\nThe prospective god isn't the one who needs to die and be reborn into a new vessel: the prospective lord is. At least per the scroll. \n\nIt kind of makes the whole theory collapse in on itself. If Godwyn wants to be reborn into a dragon vessel, it explicitly has to be as a *Lord* not a *God*. Could that have been his plan, with Ranni - a confirmed Empyrean - as his God? Sure.",
        "score": 23
      },
      {
        "body": "It was a ritual that went exactly to plan, for Ranni.\nAs for the rest, I don't think so",
        "score": 18
      }
    ]
  },
  {
    "title": "The demihuman sword masters seem to be blind.",
    "url": "https://www.reddit.com/gallery/1parm3b",
    "score": 520,
    "subreddit": "EldenRingLoreTalk",
    "body": "The rest of the demihuman have normal eyes while the sword-master's eyer are milky.\nWhat could be the implications? Blindness and ayes seem to be a great deal in the ER universe.\n\nStar-lined sword: Sword encrusted with a line of stars fashioned from small pieces of crude glintstone. Weapon of the demi-human swordsmen. When bestowed with this weapon by their queen, the swordsmen swear to find the truth that lies at the end of the procession of stars.\n\nDemi human swordsman Yosh ashes: Onze, a master swordsman who devoted himself to the Star-Lined Sword, realized that only ruin awaited at the end of the procession of stars, and imprisoned himself in order to forestall it.\nHowever, Yosh, an apprentice who absorbed his technique, stubbornly refused to heed his master's words, and spent his entire life at his side, in defiance of his self-imposed seclusion\n\nMaybe their blindness is what makes them able to find the truth at the end of the procession of stars? And what does that even mean?",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:36.420951",
    "comments": [
      {
        "body": "I have two related theories:\n\n1. They saw something they shouldn’t have in the great beyond and were blinded as a result. Kind of like Sellen’s ballification.  \n2. They blinded themselves as a precaution against the former happening.",
        "score": 37
      },
      {
        "body": "Wear blue...\n\n\n\n\n\n\n\n\n\n\n\nDance around twirlin' &amp; using multistrike...\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhite hairs on they head..........\n\n\n\n\n\n\n\n\n\n\n\n**SHORT**.........\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMakes me wonder about that \"Faerie\" who done taught up Malenia how to sword so good like... 🤔",
        "score": 30
      },
      {
        "body": "The procession of stars is another name for the primeval current, which can be translated as \"the headwaters of the universe\" directly from the Japanese. Those who have seen it have had their heads turned to glintstone.",
        "score": 29
      }
    ]
  },
  {
    "title": "Perhaps the scene in FA depicts a 'to be' sacrificed maiden.",
    "url": "https://www.reddit.com/gallery/1pd8laq",
    "score": 403,
    "subreddit": "EldenRingLoreTalk",
    "body": "",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:38.778747",
    "comments": [
      {
        "body": "This is a fun one to discuss since we just have no idea and most ideas are fair game.  \n\nThe wolves here look less like 'normal' wolves in the game and more like proto-Beastmen.  To me, the young woman is using the old Elden Ring to grant them intelligence, which would be an act cherished and memorialized by Beast Clergy and why it's in the room with Beast Clergyman.\n\nSimilarly, Miquella on Radahn visually mimics this old Elden Ring during the act, as he intends to proliferate a type of neurological rewiring to 'uplift' people like was done with the Beasts.",
        "score": 26
      },
      {
        "body": "At this point I think this is an unnamed character. It's generic enough to fit many others.\n\nI've seen Marika, Radagon, Glomed Eyed Queen and Miquella all proposed with fair arguments. \n\nI've even argued this is St.Trina, due to her name meaning trinity and that a symbol relating to her can fit in this elden ring. \n\nThough, I do like the Radagon argument. The flowers that can be found on this statue can be found on Radagon's Icon. Very compelling stuff.",
        "score": 29
      },
      {
        "body": "It's an Empyrean with Shadowbound beasts because it's in the room where we fight an unflinchingly loyal Shadowbound Beast who got screwed over by his Empyrean.\n\nTo answer your question: some Empyreans are sacrifices, while others become gods.",
        "score": 24
      }
    ]
  },
  {
    "title": "Metyr’s connection to the Elden Ring",
    "url": "https://www.reddit.com/gallery/1p2d6yw",
    "score": 379,
    "subreddit": "EldenRingLoreTalk",
    "body": "1 – Metyr bares a striking resemblance to the first Elden Ring (Arc where bounty pools, fingers as the roots, and her head as the point at which divinity meets earth)\n\n2 – As demonstrated in her signature attack\n\n3, 4, 5 – And the Great Runes are located inside of her (or \"come from\" her), as she is the mother of all two fingers; the entities which appear to give birth to the Great Runes \n\n6 – Making her the ‘Grandmother’ of the Elden Ring. \n\n7 – The first shooting star; baring a beast, that would one day become the Elden Ring. (It’s serving juiced up orphan of kos)\n\n8 – I have 14 other entres if you’re interested, here:\nhttps://www.youtube.com/watch?v=xxasOm0h1Xs&amp;t=1s\n",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:41.436978",
    "comments": [
      {
        "body": "https://preview.redd.it/ueyo41r42h2g1.jpeg?width=1537&amp;format=pjpg&amp;auto=webp&amp;s=bb26a43a256e8d8dcad9da5c3c9ca642c7513773\n\nMiyazaki looking at this post like this lol, keep the mind breaking insights coming!",
        "score": 14
      },
      {
        "body": "I have some bad news about the beasts flanking the center at 6:09 in your video. These were not created by fromsoft, so I think any connections you are drawing with them are red herrings.\n\nthis design is copied in nearly its entirety (including those beasts) from the baptistery at Cividale.\n\nhttps://preview.redd.it/yagtkxwqjj2g1.jpeg?width=1091&amp;format=pjpg&amp;auto=webp&amp;s=e8cbbec7345275a8faf92db2bfefcc8bf22698e3\n\nThis depicts the Assyrian Tree of Life. Tree of Life iconography often featured two animals facing each other (called the confronting animal motif), so it’s not surprising it is also common in elden ring, which uses many IRL tree of life depictions.\n\nThe designers did change 2 elements of this in their implementation, they replaced the gryphons with lions, and the central pillar (which represents the tree of life) has been given some odd shrub like protrusions similar to the statue of the man surrounded by sprouts.\n\nI think if there is anything to analyze in that motif it is those components, as they were clearly intentional changes!",
        "score": 12
      },
      {
        "body": "You can shove a bunch of symbols together to make the Ancient Elden Ring. Kinda like how the modern one can be broken down into great runes. Does it mean anything? Maybe. Metyr does look similar, but not one to one.\n\nI like your thinking!\n\nhttps://preview.redd.it/xibrnxs3ah2g1.png?width=799&amp;format=png&amp;auto=webp&amp;s=c4d09836b012214b4325d40f21dcf1e719553912",
        "score": 10
      }
    ]
  },
  {
    "title": "I tried to illustrate a little visual narrative using my knowledge of SotE. This sub has helped me with the lore many times! Thank you all for the great discussions",
    "url": "https://i.redd.it/hl9490qzun1g1.jpeg",
    "score": 357,
    "subreddit": "EldenRingLoreTalk",
    "body": "I h",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:34:43.803573",
    "comments": [
      {
        "body": "Very nicely done! It’s giving BERSERK for sure. Was this a pen and ink drawing or a digital drawing? And if it’s digital, what software do you use?",
        "score": 10
      },
      {
        "body": "Absolutely incomprehensible, absolutely lore accurate. Black and white really adds to the Berserk aesthetic but I bet this would look sick with some coloring too!",
        "score": 9
      },
      {
        "body": "Feels like a Skull Knight Scene from Berserk",
        "score": 7
      }
    ]
  },
  {
    "title": "The Moons Are Trying to Become Outer Gods!",
    "url": "https://i.redd.it/2jxgmfzl6u1g1.jpeg",
    "score": 331,
    "subreddit": "EldenRingLoreTalk",
    "body": "I accidentally deleted this post yesterday because Reddit trolled me by making it appear that it double posted. I deleted the duplicate post, and then they both deleted -.- So here it is once again:\n\nWhether the Moons are true Outer Gods or not, has long been up for debate. There’s good evidence to suggest that they could be, and good evidence to suggest they aren’t! But perhaps there is a secret third option; The Moons are attempting to become Outer Gods!\n\nFirst and foremost, I believe that the people of TLB are communicating with the moons through scrying. They have figured out a way to talk to moons, and that is by using a form of water divination. These are what the moon gazing grounds are for. \n\nScrying is essentially staring into a reflective surface to receive divine messages or visions. If you look at the moon gazing grounds, this becomes evident: https://imgur.com/a/jhcdpBJ\n\nThere are multiple item descriptions that mention people “meeting” moons. I don’t believe that there were moons flying around TLB that only 1 person sees. I think it’s much more likely that their civilization discovered some kind of magic formula for finding and communicating with moon entities. \n\nThere are 4 named moons in Elden Ring. There’s not really a whole lot of information about the moons individually, but when we add all the information together, we start to uncover a cosmic conspiracy! \n\nBlack Moon: It is the lost Moon of the Nox, and it guided many stars. It also possessed extremely powerful magic which essentially was the reason that the Nox worshipped it. I believe that the Black Moon could be the same as the next moon on this list. \n\nDark Moon: This is Rannis moon, It’s described as cold and dark. Another description we get, is it being veiled in occult mystery. The Dark Moon was something to be feared, according to Rannis teacher. Despite her teachers fear of the Dark Moon, Ranni would refuse her teachers warnings, being the rebel she is. Interestingly enough, there are instances where Ranni makes her followers swear their loyalty not to her, but to the Dark Moon itself. \n\nTime and time again, Ranni proclaims that she is following the guidance of the dark moon, and professes it one last time in her Age of Stars cutscene. In this cutscene, we witness a black moon sit just beyond the light, not revealing itself to us until Ranni presents the Elden Ring to it. As the Elden Ring dissipates, we see the moon come into the light, and suck it into its mouth, and it’s also sucking in what appears to be stars, even galaxies! https://imgur.com/a/AevUd1o\n\nThe reason I believe this is the missing moon of the Nox, is because the Nox notoriously failed to ever have a lord and get the Elden Ring. In Rannis ending, we see a black moon sitting just beyond the light, but once Ranni presents the Elden Ring, it shows itself and its worm hole mouth that guides the stars. Just as the Black Moon of the Nox guided the stars. \n\nRennalas Full Moon: There is 1 reference to this in the entire game. And that is the item description for the spell: “Queen Rennala encountered this enchanting moon at a young age, and it would later bewitch the academy.”\n\nIt may not be much to go on, but it does give us some very important insight. The Full Moon literally cast a spell over the people of the academy. This isn’t a small detail, this has implications. \n\nThe final named moon is actually 2 moons, Rellanas Twin Moons. Again not a lot of information outside of the item description: “In her childhood, she and her older sister Rennala met these moons. Overlapping, as if they were nestled against each other.” \n\nNot much to take away from the item description, but the name of the item does tell us something interesting. Twin Moon. \n\nWhat about the moon that we can actually see in the sky? And the identical one that only appears when you visit the moonlight altar? The Twin Moons are the moons we see in the sky. But the moon in the sky, is also Rannis moon, and didn’t I theorize earlier that Rannis moon is actually the Black moon? \n\nIf Rellanas moon bewitched the academy, how deep does that rabbit hole really go? What if the twin moons, the full moon, the dark moon, and the black moon, are just these 2 moons. They are literally twin moons after all. 4 different moons that are named, each moon has at least 2 distinct sides. \n\nThere’s 1 more instance of the moons having the ability to bewitch people. The Eclipse of Sol. \n\nEclipse Shotel: “In Sol, the sight of an eclipse inspires a dreadful awe, preventing an onlooker from averting his gaze.\"\n\nSo we know these moons are going around TLB bewitching people, but why? My theory is that they are assimilating with Great Runes, to become an Outer God. \n\nWe see people ascend to Gods, and we see people ascend to celestial bodies. But there’s a higher level to ascend to yet. If you’re a celestial body with godlike powers, maybe the thing that makes you ascend to the level of an Outer God is assimilating with enough Great Runes. \n\nIm not certain if they are literally ascending to a higher plane of existence. But in theory, if you were a celestial god and assimilated with enough great runes, you would have Outer God level powers. \n\nWe do see what seems to be Great Runes inscribed on the Twin Moons already. And Great Runes can hold incredible powers. Individually the Great Runes have the power to shape reality. But when we bring them together and create the Elden Ring, they have the power to create and destroy worlds. \n\nWe see what Marika is capable of when she gets her hands on the Elden Ring, imagine if a hyper intelligent magical moon god got it. Imagine if they went from world to world taking the Elden Rings and got multiple of them! \n\nWas Ranni bewitched? Was she being manipulated? I believe that she was. Just going off of the track record for the rest of the Outer Gods, they’re all manipulating the people of TLB for their own gain. All for the same thing, they’re all after the Elden Ring. \n\nRanni wanted to get rid of order after being forced into it. She saw the evil that Marika brought to the world, and decided that order was the problem, and that life would be better without it. The Moon promised to do that, by taking the Elden Ring away from TLB. \n\nRanni is just a character, she doesn’t have the meta knowledge about the universe that we have. These moons were deeply ingrained in her culture at this point, and they offered her a solution to get rid of order. But the implications of this are far greater than you think. \n\nThink about it. If the Elden Ring could exist in space and still control TLB, why would the Greater Will have to send it to the planet at all? \n\nI don’t think the Greater Will is the all powerful being we make it out to be. Don’t get me wrong; it’s still essentially the creator god of the universe, but it can only create order with the One Greats universal DNA. This being has its limits, it can’t even directly communicate with the people of TLB. \n\nIf the Elden Ring could exist in space, and it could still be controlled by the people of TLB, it would be. It would be somewhere safe, out of harms way. \n\nThere’s one small and seemingly unimportant story that Fromsoft added to the DLC for absolutely no reason. But there was a reason, the story of Onze brings this theory full circle.\n\nStar-Lined Sword: “Sword encrusted with a line of stars fashioned from small pieces of crude glintstone. Weapon of the demi-human swordsmen. When bestowed with this weapon by their queen, the swordsmen swear to find the truth that lies at the end of the procession of the stars.”\n\nThe term “Procession of the stars” is a fittingly vague way for Fromsoft to let us know that we are talking about the age of stars ending. First let’s look at the definition of Procession. \n\nProcession means: To move forward in an orderly fashion. \n\nSwordmaster Onze: “Onze, a master swordsman who devoted himself to the Star-Lined Sword, realized that only ruin awaited at the end of the procession of stars, and imprisoned himself in order to forestall it.”\n\nRuin awaits at the end of the procession of stars. \nI don’t know about you, but I certainly don’t think Miyazaki was trying to tell us not to do a conga line with the stars. What “order” means in this context, is the Elden Ring. \n\nWhat this item description is really saying is “Sending the Elden Ring to the stars will leave TLB in ruin.” Which is, the Age of Stars ending. \n\nSo yeah, the Moons are pretty fucked.",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:34:46.163221",
    "comments": [
      {
        "body": "In my opinion any aspect of life rejected by the erdtree is considered an outer god. \n\nI don't see outer gods as lovecraftian entities but literal manifestations of natural aspects suppressed by the golden order. The tree stole the place of the sun as the only source of warmth, suppressed the night, stole death from the twin bird, eliminated the role of decay in the world to make stagnation not result in rot and death, stole fate from the moon and stars and eliminated chaos and madness even though they come from the same roots and follow the same principles of causality and regression.\n\nTo add to it, in Japanese they're literally called soto no kami, meaning outside gods, gods of outside or outer gods.",
        "score": 11
      },
      {
        "body": "&gt; Ruin awaits at the end of the procession of stars. I don’t know about you, but I certainly don’t think Miyazaki was trying to tell us not to do a conga line with the stars. What “order” means in this context, is the Elden Ring.\n\n“… in order to” in that context just means doing something to get a particular outcome.\n\n&gt; Onze, a master swordsman who devoted himself to the Star-Lined Sword, realized that only ruin awaited at the end of the procession of stars, and imprisoned himself in order to forestall it.\n\nOnze realised the truth, so to stop that from happening he imprisoned himself. It has nothing to do with the Elden Ring.\n\nBut that aside, I don’t disagree that the Moon’s are trying to ascend to a state of being beyond their current one.",
        "score": 11
      },
      {
        "body": "I think they already are Outer Gods",
        "score": 10
      }
    ]
  },
  {
    "title": "Is it possible Radagon's cleansing with celestial dew allowed for Godwyn to be born uncursed?",
    "url": "https://www.reddit.com/gallery/1otfrhs",
    "score": 328,
    "subreddit": "EldenRingLoreTalk",
    "body": "",
    "category": "History",
    "scraped_at": "2025-12-09T15:34:48.898556",
    "comments": [
      {
        "body": "Godwyn is not a son of Radagon, they were already split at that point and besides, Morgott and Mohg are not cursed either, they were born Omens which is different - you could say they were \"politically cursed\" if you will. The Carian kids aren't cursed either, except for all 3 being absolute maniacs in their own ways. The only one's cursed where the offspring of Marika AND Radagon, a.k.a The Prodigy Twins.",
        "score": 82
      },
      {
        "body": "Happened after Godwyn was born, also not Radagon’s son.",
        "score": 67
      },
      {
        "body": "Why would he be \"cursed\" in the first place?\n\nHe's born before the Crusade, he isnt a cursed Omen so nothing would curse Marika offspring with Godfrey\n\nThere was an entire clan of children and their descendants that had no problem whatsover outside of being lazy bozos",
        "score": 24
      }
    ]
  },
  {
    "title": "Miquella's affliction, ascension &amp; fate was always going to happen exactly the way that it did",
    "url": "https://i.redd.it/iyq32iwasi0g1.jpeg",
    "score": 325,
    "subreddit": "EldenRingLoreTalk",
    "body": "Miquella's story is not what you think. \n\nThere's a reason the Miquella you met atop the spiral tower felt \"empty\" of the Miquella you though you would. There's a reason that his story never came to fruition the way you felt like it should have. There's a reason that despite never engaging us directly, Miquella dies with Radahn. \n\nShadow of the Erdtree is the story of Miquella succumbing to a pre-determined fate - to be ripe with potential, like a bud, but never truly blossom, to wilt. \n\nThe age of compassion was never going to come into existence, and Miquella was always going to die at the Gate of Divinity. It was simply in his nature. \n\nMiquella's affliction, the inseparable fate he shares with Malenia, is the explanation for all of this. A fate he had from the very start that he was not actually freed from upon his ascension, but rather succumbed to. \n\nThe nuance of this affliction of abundance and decay meant that for his entire life, Miquella was eternally \"just on the precipise\" of becoming something greater - almost touching, but never quite. Ripe an abundance of hope and potential, but fated to crumble away. \n\nIf you're interested in more, I think you'll like my video: \n\nhttps://youtu.be/I4j03Av3ieQ?si=LnTik90s0Cc1GxLU\n",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:51.256648",
    "comments": [
      {
        "body": "While I don't really agree with his fate in the DLC, I can't help but wonder what would he have done if he succeeded in becoming what he wished :\n\nGodwyn - what would he have done for him, considering his state and the fact that it turns out it was his fate to become the Prince of Death.\n\nMalenia - depending on the player character's course of  actions, she could still be alive, waiting for her brother.\n\nMarika - would he take any sort of actions towards his Mother. Same with Trina.\n\nMelina - while not officially proven, they are most likely step siblings and are connected by the fact that they were both Torrent's former master. I like to believe Miquella would try to help her restore her true body.",
        "score": 23
      },
      {
        "body": "Yeah! I felt like his whole backstory heavily implied this curse of “nascent” being more than just a god cursed with eternal youth. His safe-haven tree worked for a while but rotted in the end. His plan to cure Malenia worked for a while but backfired; in the end she embraced the rot. His feats seem brilliant in the starting stages before they eventually fall flat. They never advanced into the further stages, just like he never advanced into his further stages as an empyrean/god. I feel like the DLC seals this; if this were not his fate, then there would’ve been an actual ending for Miquella where he succeeds.\n\nAnd you could say that maybe his alternate form as the sleepy god was a part of him that attempted to stagnate the stages where it is most abundant, right before the downfall happens.\n can’t stop fate? Just hibernate with all the good stuff for a long time in hopes that you can hold off fate just a little longer",
        "score": 23
      },
      {
        "body": "I disagree. He set out to become a god. He did so by casting out everything. He did what he set out to do. He succeeded in that endeavour. There was no predetermined fate. There are many tarnished which means marika extended grace to many warrior to increase her chances of victory against the golden order. The tarnished was just stronger than radahn in the end.",
        "score": 14
      }
    ]
  },
  {
    "title": "The temple where we fight Maliketh would have been completely dark inside",
    "url": "https://www.reddit.com/gallery/1p92w7i",
    "score": 283,
    "subreddit": "EldenRingLoreTalk",
    "body": "If you look at the damage done to the temple, it becomes clear that the arena in which you fight Maliketh is only illuminated due to the gaping hole in the wall. No windows, no skylight. This seems obvious, but the implication might be important. \n\nCandlelight and the Elden Ring motif obviously provided some visibility, but this was otherwise an intentionally dark place - despite the civilization being very sun-coded. Why was this holy place kept in the dark?\n\nThis room has always been a mystery to me. Why did Guranq/Maliketh choose to stay here specifically? What is the Elden Ring motif meant to impart on us? Who does the statue represent? Why is there a gap between the platform and walls, mimicking the stone platform we fight Radagon on?\n\n I feel like little details can help us get closer, and just wanted to share this one.",
    "category": "History",
    "scraped_at": "2025-12-09T15:34:53.630625",
    "comments": [
      {
        "body": "I can speculate that it would have been sealed off and dark because it's a mausoleum.",
        "score": 27
      },
      {
        "body": "I know it's a boring answer, but as time has passed, I've come to lean towards it being Marika. It would fit in with similar examples, like Radagon's statue in Rennala's boss room, Marika's statue in Messmer's boss room, and even the Miquella-esque roots in Malenia's boss area (although cut content reveals that might have had a different significance that were dropped in rewrites)\n\n\nAnd I'm not sure exactly how literal of a statement it is, but we're told that Marika's sole need of Maliketh was sealing away Destined Death. That could imply that their relationship, although close, became distant not long after her ascension, especially if he went off to Caelid or Farum Azula to do that. If that's the case, most of his fond memories of Marika would likely be from her younger years, assuming he was given to her in her youth like Blaidd was for Ranni\n\n\nIt's a boring answer, and I can't be 100% certain of it, but it also seems like the simplest answer. The most commonly presented alternative is that it's Placidusax's fled god, or an important figure in Beast culture. But I feel that if that were the case, there'd be more examples than just this lone statue",
        "score": 17
      },
      {
        "body": "I really wonder who the statue of a girl sitting under an older representation of the Elden Ring in the biggest temple of the royal capital of the ancient Elden Lord is \n\nSurely Maliketh, an high priest of Farum Azula society as Gurranq before becoming the Shadow for Marika had many possible reasons for being in that place \n\nBro that used to be his work place 😭",
        "score": 15
      }
    ]
  },
  {
    "title": "Nightreign DLC + Updates on Everdark Boss Writings",
    "url": "https://www.reddit.com/gallery/1ov3t4t",
    "score": 280,
    "subreddit": "EldenRingLoreTalk",
    "body": "Hello, this isn’t going to be very informative, but I would like to let everyone here (that may not) know that the trailer for Nightreign’s DLC has dropped. \n\nI have no real constructive thoughts on this since it blindsided me, but I would like to baselessly talk about the Dreglord and an update in the comments. \n\nShadow of the Erdtree Foes emerge, new locations appear (one of which appears to be a poison fort, like a mini Marais Manor), including a vast Shifting Earth which appeared to host Nox architecture atop itself (as well as below itself like the hanging structures in Nokron). There was also a Trina Lily-ridden cave, a Divine Tower which hosted a Dancing Lion, and a sunken titan body (also a floating ?trunk? full of darkness. \n\nOne of our narrators speaks of the aftermath of the Night. I don’t know what this aftermath is, but I suppose that after all the fighting over the past months there is some sort of reaction, thus resulting in the new characters, settings, and bosses. \n\nOur two new “Night” Lords are an assembly of seeming angels and the Dreglord. The “angels” are seen when fate is mentioned, making me wonder if there is some connection. The texture of their “flesh” reminds me of Malenia’s rot and partly metallic body making me wonder if they’re a recycle of earlier mechanics regarding Malenia (apparently she was supposed to summon her blossom copies as long standing enemies according to the Japanese content creator Chaos Silver Moon in a comment; haven’t seen anyone else mention it). They may be Death’s Envoys, or something to do with the Greater Will given their heavenly appearance. I expect they may be called Valkyries. \n\nMalenia was called a Valkyrie in reference to her wings (which could be seen; figuratively?; even before her revival as a goddess), or perhaps it was in reference for her skill in delivering death? Valkyries carry warriors to the afterlife and the Night has been delivering death for some time. \n\nAlso, the ultimate ends of one’s fate is death, so perhaps that line is relevant? \n\nThe Dreglord is my curiosity. He is filthy, vibrant, and we only get a glance from afar. Whatever he is, I want to see. Dregs are remnants, waste, somewhat referenced in Dark Souls 3 when the world is coming to an end. Not that there’s an immediate connection, but his power looks like the summoning of waste. The Night has misconstrued time and place, like what happens at the end of Dark Souls 3. Dreg can also refer to sediment at the bottom of something, fitting into a theme of unwellness as the Japanese culture has a conception of something called kegare, spiritual filth, which is often associated with stagnant water as it doesn’t flow, thus never filtering out, filling with dregs. In Dark Souls time has “stopped” (not convoluted) and the darkness and consequences of timelessness built up. I wonder, if anything, what may’ve built up to create a Dreglord? Time, darkness, death?",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:34:56.335751",
    "comments": [
      {
        "body": "https://preview.redd.it/s6h4x4fyvt0g1.jpeg?width=2281&amp;format=pjpg&amp;auto=webp&amp;s=107e856ad0aa5dd6fee741c5642b271b513b28a3\n\nDetails on the new Shifting Earth",
        "score": 20
      },
      {
        "body": "Winged Scythe\n\n&gt;Sacred scythe resembling a pair of white wings. Deals holy damage.\n\n&gt;According to pagan belief, white-winged maidens are said to be Death's gentle envoys.\n\nYurp, seems about right.",
        "score": 16
      },
      {
        "body": "Mass Production Evangelion vibes in this first photo",
        "score": 14
      }
    ]
  },
  {
    "title": "Was Putrescent Knight created from the corpses of Radahn and Leonard?",
    "url": "https://i.redd.it/49u12rnpd93g1.jpeg",
    "score": 263,
    "subreddit": "EldenRingLoreTalk",
    "body": "We know Miquella used Mohg body to make Radahn his consort. Is it possible that Miquella used Radahn and Leonard's rotting body to made Putrescent Knight to protect St. Trina?",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:34:58.669579",
    "comments": [
      {
        "body": "It's an interesting theory, but I don't think it's possible, because we actually know what happened to Radahn's body.\n\nIt's heavily implied that **Alexander** used Radahn's body as the base for his new innards after the boss fight.  He's seen scavenging the battlefield immediately after, and at the end of his questline the trinket he drops has red hair in it.",
        "score": 55
      },
      {
        "body": "solaire is the carthus sandworm",
        "score": 47
      },
      {
        "body": "This is an amalgamation of different human parts aside from the horse. It might be intentionally resembling radahn and Leonard from a writers perspective but I don’t think it’s the ACTUAL body or that it has anything to do with radahn at all",
        "score": 37
      }
    ]
  },
  {
    "title": "Lore in the wild",
    "url": "https://www.reddit.com/gallery/1ow6fxb",
    "score": 256,
    "subreddit": "EldenRingLoreTalk",
    "body": "Currently on holiday in North Cornwall, exploring the coastal landscapes. Came across these and and had to share.",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:35:01.028902",
    "comments": [
      {
        "body": "I believe that's called a labyrinth fyi",
        "score": 8
      },
      {
        "body": "WOW cool stuff :0 very curious about the history behind this, any thoughts or pointers where I can learn more?",
        "score": 6
      }
    ]
  },
  {
    "title": "Extremely literal imagery of the the Erdtree replacing the Sun (also flower lore)",
    "url": "https://www.reddit.com/gallery/1ovs43i",
    "score": 249,
    "subreddit": "EldenRingLoreTalk",
    "body": "I'm definitely going to post a larger sun realm rant here some time soon but for now I wanted to share this.\n\nThoughts?",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:03.436497",
    "comments": [
      {
        "body": "I've also been obsessed with this symbol lately, it's all over the highway connecting the Academy, the two Lifts, and Leyndell, not to mention Farum Azula and the Bestial Sanctum. aside from FA, I think the oldest version of this is a similar symbol that's all over Belurat/Enir Ilim, with the central flower surrounded by an alternating spiral of gold, red, and black... which I think is giving us a very big hint about the timeline here",
        "score": 19
      },
      {
        "body": "Squares very nicely with my personal interpretation of the sun as both the Fell God and the God of Death. Not only did the Erdtree Triumph over the Fell God during the war in the giants, it would go on to overtake it's role with the rune of death being sealed away by Marika and the practice of Erdtree burial taking over the older, fire based methods of burial we see with ghostflame and the Messmer castle boats.\n\nThe Erdtree well and truly replaced the sun in every way possible, not just outshining it.",
        "score": 16
      },
      {
        "body": "Sun Realm soldiers are in Wyndham for a super special reason ... the same for why there was a Giant buried there ... and a stormhawk feather ... and a catacomb with lightning traps and dragon cult followers",
        "score": 14
      }
    ]
  },
  {
    "title": "The Black Knife Assassins are Silver/Mimic Tears of Marika (and so is Melina)",
    "url": "https://i.redd.it/ivhtgca5cv4g1.jpeg",
    "score": 229,
    "subreddit": "EldenRingLoreTalk",
    "body": "These are the three topics I wish to talk about:\n\n* The Albinaurics were a 3-generational attempt by Marika to clone herself, amongst other things.\n* How Alecto/Tiche mirror Marika/Melina.\n* Melina was birthed the same way as a Silver Tear, and has the same relationship to Marika as Millicent has to Melania. She is Marika, but she is still Marika's daughter and a sister to Messmer, the same way Millicent is a daughter to Malenia and has multiple siblings.\n\n\n\n**The Albinaurics**\n\nThe Black Knife assassins \"*were all women, and rumored to be Numen who had close ties with Marika herself*\". They appear to have long blonde hair when exposed. They fight the exact same way as Melina, and wield very similar weapons. Their actions and placement in the Lands Between suggest that they work for and are loyal to Marika. I believe Marika worked with or used the Nox to create artificial life and clone herself.\n\nGeneration 1: The first attempt, they succeeded in creating artificial life, but their legs didn't work and they couldn't reproduce. Interestingly, the women are all blonde and resemble Marika, and their connection to wolves can possibly be linked to the shrine in Malekiths arena.\n\nGeneration 2: The second attempt, which failed because they all turned out as frog-like abominations.\n\nGeneration 3: The third attempt, which succeeded. Silver Tears were born. They could take any form and they could reproduce (as seen from the Silver Tears \"dripping\" from the Silver Tear Ball in Nokstella.\n\nBonus: Both generation 1 and 2 Albinaurics can be found imprisoned, tortured and being interrogated at Mt Gelmir. Why would Rykard have any interest in interrogating, and likely studying, so many Albinaurics?\n\n\n\n**Melina, and how Alecto/Tiche + Malenia/Millicent are hints to the truth**\n\nMelina fights identically to a Black Knife Assassin, and carries a weapon that looks like it could be the Black Knife before it was embedded with Destined Death. She can recall Marika's echoes at Sites of Grace. She knows Marika's secret tree incantation. No one else in the game, other than Torrent, seems to know she exists. She also questions what it means to be born of a mother... why?\n\nAlecto was the ringleader of the Black Knife Assassins. We receive Tiche when she is defeated, who is her daughter that is a spirit (hint hint). Millicent and her siblings are offshoots of Malenia. Daughters, but also just reincarnations of Malenia herself (hint hint).\n\nIt may not be a simple explanation, but Melina being birthed/created in a similar fashion to a Silver Tear explains pretty much everything about her.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:05.759966",
    "comments": [
      {
        "body": "Yo. \n\n\\- The Silver Tears internal name in the game files is \"MarikaLineageSlime\"   \n\\- The Giant Silver ball that drops the silver tears is called \"MotherSlime\"\n\nJust as the Nox are given \"MarikaLineage\" in the beginnings of their file names. \n\nThere's something to gleam from that, and doing some looking around more at those ties to your overarching hypothesis would be a nice second pass.\n\nAs someone pointed out before under your post, ER lore Youtuber by the name; 'Scum Mage Infa'   \nrecently made a video making pm this exact point -- albeit it was a bit more in-depth on certain things, while not exactly being the same hypothesis -- but that's where I originally heard this connection and saw these  \ndata-mined details that support it. \n\nI don't agree that Melina &amp; The Black Knife Assassins are 'Silver Tears' of Marika -- And I don't necessarily agree with the Hypothesis Infa posits either.\n\nBut I do like the concept, and It could very well be the answer. \n\nMy question, would then be: why? \n\nAs in, why would Marika care to do that. \n\nFor me, I always thought as though there wasn't enough reason to do stuff like this for her character.   \n  \n\\[ not that I'm the arbiter of what should &amp; should not be reason enough LOL \\] \n\nIt made sense for the Nox to make the silver tears -- They were actively trying to supplant or supersede The Greater Will --  but Marika was the poster child for the Greater Will.   \nThe bearer of the Elden Ring.  \n   \nSo, what purpose would Marika have in making silver tears of herself?\n\nIt was always my intuition to assume that the thing that doomed the Nox , or more specifically the thing that courted the Ire of the Greater Will  WAS the plan to supersede it -- by creating a Lord of Night to be their savior- NOT an Empyrean.\n\nAs in, to create a Lord/ Leader that is NOT within the Empyrean Hierarchy/ that is not controlled by The Greater Will. \n\nIf that makes sense.   \n  \n\\[Side Note: At one point in the timeline of the creation of ER, The Nox were called \"Empyrean's' Lineage\" Not specifically Marika's'\\]\n\nRegardless, we have hindsight to know with in-game lore, that they *did* at one point NOT betray the Greater Will.   \nThere was a time before they were forced underground.   \nSo I guess what I mean is, there was a \"pre-betrayal\" Nox people. \n\n\\[ by proxy, a pre-silver tear Nox people who did not yet betray Marika/ The Greater Will \\]\n\nA Noklateo-esk scenario perhaps.\n\nI know there's been plenty of Video essays and Hypothesis trying to explain what exactly happened with all of that, so I won't try to do a whole thing -   \nI won't waste anymore of your time LOL\n\nI can yap forever. \n\ncool and interesting post. \n\nMuch Love.",
        "score": 19
      },
      {
        "body": "I've made posts delving into the importance of silver tear life previously and how there are multiple sources of life in TLB.\n\n[https://www.reddit.com/r/EldenRingLoreTalk/comments/1mure0a/silver\\_and\\_gold\\_conflicting\\_origins\\_of\\_life\\_and/](https://www.reddit.com/r/EldenRingLoreTalk/comments/1mure0a/silver_and_gold_conflicting_origins_of_life_and/)\n\n[https://www.reddit.com/r/EldenRingLoreTalk/comments/1o1ksaz/proliferating\\_life\\_from\\_stone\\_a\\_bit\\_insane/](https://www.reddit.com/r/EldenRingLoreTalk/comments/1o1ksaz/proliferating_life_from_stone_a_bit_insane/)\n\nBut basically, the Stone Coffins have no known origin and seemed to have phased into TLB (\"washed up\") .  They were full of blue-ish silvery goop that we see reform into skeletons and the Knight.  The Knight doesn't have working legs.  Putrescence is rotting silver tear life.  The goop in the Coffins reformed (somehow) and became the Ancient Dynasty, which has a lot of similarities to the Eternal Cities, etc, etc, etc, follow the chain.",
        "score": 19
      },
      {
        "body": "I like where you're going with this a lot, but here's a thing that bugs me about it.\n\nWe see Melina is scarred. Even as a spirit, she is scarred from burns. This seems to imply that the Melina we see is her true form when she had a corporeal body. It doesn't have to be, but that's the implication I see. Also silver tears when in a humanoid form have silver skin. Melina is pale skinned.\n\nI do agree Melina had a peculiar birth, but I'm not convinced she's a silver tear. I don't outright dispute this either.\n\nI'm not sure BKA matter enough for me to care about their origin. Marika clones doesn't seem totally outrageous to me. I'm not sure they all remain loyal to Marika, but I think it's possible to likely they were before Marika shattered the Elden Ring.",
        "score": 15
      }
    ]
  },
  {
    "title": "Where does the loyalty of each of the Carian children lie, and what are their end goals?",
    "url": "https://i.redd.it/k19pqqub8o4g1.jpeg",
    "score": 219,
    "subreddit": "EldenRingLoreTalk",
    "body": "Ranni protects her mother, Rykard and Ranni plotted together on the Night of the Black Knives, Radahn is supposedly loyal to the Golden Order, yet we see him fighting with Morgott for some unknown reason, there is an abductor virgin at Caria Manor, Radahn stopped the stars... why?\n\nI've always had this fun little headcanon idea that Rykard was always planning to betray Ranni after the Night of the Black Knives, and that Seluvis secretly worked for Rykard. Had Seluvis succeeded in turning Ranni into a puppet, he would have sent her off to Volcano Manor using the hidden Abductor Virgin in Caria Manor.\n\nSo my question is, who are each of the Carian children loyal to and what are their ambitions?",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:08.086561",
    "comments": [
      {
        "body": "&gt;Radahn is supposedly loyal to the Golden Order\n\nI don't think the game claims that he was loyal to the Golden Order itself.  \nHe admired and respect Godfrey as a warrior and Radagon as a champion but he didn't seem to share his father interest in scholarship or in studying the Order.  \nWe can also find his portrait proudly displayed at the Volcano Manor so it doesn't seem he was perceived as someone loyal to the GO.\n\nRadahn is following Godfrey's example and Marika's advice, fight for power or die to someone who will.  \nMorgott may be the rightful heir of the Golden Lineage, and maybe even of Leyndell, but Radahn doesn't care about that, just like Godfrey didn't care if the Storm King was the rightful ruler of Stormveil.\n\n&gt;there is an abductor virgin at Caria Manor\n\nWe can find Abductor virgins at a lot of weird locations so it's a bit hard to establish a strong connection between the two.  \nMaybe Rykard sold/gifted them to other groups as weapons of war or as mechanical inquisitors.\n\n&gt;Radahn stopped the stars... why?\n\nTo protect Sellia and I think because it was a worthy feat to prove his mastery over gravity magic.",
        "score": 22
      },
      {
        "body": "Rykard - Back to the past\n\nRadahn - Upholding the Status Quo / Present\n\nRanni - Future\n\nRykard is going back to the roots with his blasphemous act of snake revival/rebirth.. Also reverting back to an age of survival of the strongest\n\nRadahn is just stagnating.. not going anywhere in time nor in philopsophy\n\nRanni is planning for the future and a new age / laying down her past and fate",
        "score": 23
      },
      {
        "body": "Ranni was always interested in the Age of Stars. Her mom and her aunt Rellana were astrologers who discovered the moons together. And Ranni was probably more interested in carrying on their legacy instead of being bound to being an Empyrean, which is why she discarded her flesh. \n\nRadahn idolized Godfrey, and was close to Messmer and Gaius, not just anyone in the Golden Order. Morgott didn’t really like Radahn and saw him as one of the traitors. \n\nRadahn stopped the stars so that Sellia didn’t get destroyed. He stalled them long enough for them to fall on that empty area in Limgrave instead when he got defeated. (If anyone has a better answer as to why they fell to Limgrave instead you can reply)\n\nI think it was clear that Rykard respected his family. He had a portrait of Radahn up in his castle, and he sent off some Virgins to his mom’s academy to help protect its courtyard. He just seemed creepy because he was part of his little cult. He committed blasphemy, which means he did not like the Golden Order at all. \n\nIn conclusion, I think the three children prioritized their mother and their people over everyone else. The Carians are a very tight knit family.",
        "score": 19
      }
    ]
  },
  {
    "title": "Marika Ascent ≠ Elden Ring",
    "url": "https://i.redd.it/kff7mzmdt85g1.jpeg",
    "score": 216,
    "subreddit": "EldenRingLoreTalk",
    "body": "Just because Marika Ascended to Godhood doesn’t mean she immediately got the Elden Ring \n\n(I mean Miquella technically became a God but he did automatically get the ER) \n\nI mean it seems to have existed since the Age of the Ancient Dragons. \n\nWhen do you think Marika Acquired the Elden Ring? ",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:10.428526",
    "comments": [
      {
        "body": "I actually do think that Marika got the Elden Ring as shown in the image. I think she preformed Divine Invocation because you can see the Elden Beast’s realm in the Divine Gate, you hear its theme playing, and its roar. Not to mention Divine Invocation is used to call beastial/animal gods to use some of their powers and the Elden Beast is well a beast.",
        "score": 24
      },
      {
        "body": "Great question. Marika's spoken echo at her first church says 'Put the giants to the sword and confine the flame atop the mount. Let a new epoch begin. An epoch glistening with life. Brandish the elden ring for the age of the erdtree.' The term 'brandish' has a specific significance in this game. You can see it in the item description for mending runes. All three, in their second line, state 'Used to restore the fractured elden ring when brandished by the elden lord.' At the end of the game, when you get access to the elden ring, you brandish it, you hold it up and potentially have the ability to change it. In Marika's spoken echo, she's telling godfrey and his men to do certain things before brandishing the elden ring. This implies they don't have access to the elden ring yet. If marika already had the ring, they could brandish it then and there. Defeating the giants and gaining access to the forge could have enabled godfrey to use the same warp gate to farum azula that the player uses in-game. I think when godfrey defeated placidusax he brought the elden ring back to marika and she ate it.",
        "score": 15
      },
      {
        "body": "Truly we are all just Gold Mask, pointing at the Erdtree, trying to figure it all out through finger movements",
        "score": 14
      }
    ]
  },
  {
    "title": "The Seduction &amp; The Betrayal Of The Fingers",
    "url": "https://i.redd.it/zyj3s4xo2e1g1.jpeg",
    "score": 211,
    "subreddit": "EldenRingLoreTalk",
    "body": "The title basically states it. This theory of mine is addressing what the Seduction and Betrayal that was spoken in the DLC Story Trailer is.\n\n# What We Know\n\n*“Miquella the Kind spoke of the beginning. The seduction. And the betrayal. An affair from which Gold arose. And so too was Shadow born. What followed was a war unseen. One that could never be put to song. A purge without Grace or honour. The tyranny of Messmer's flame. And so Kindly Miquella would abandon everything. His golden flesh, his blinding strength. Even his fate.”*\n\nThe seduction and the betrayal are mentioned only once here. Just like almost everything involving what happened during Marika's ascension is never mentioned in the actual game. However there is enough to make a theory based on it.\n\nNow we know that the seduction and the betrayal most likely occurred during Marika's ascension or was involved with it as this event predates the creation of gold. Lets for now ignore the seduction and focus on the betrayal bit.\n\n# The Betrayal Of The Crusade\n\nNow we do know that Marika did betray the Hornsent at some point in the form of Messmer's crusade.\n\n*“The Erdtree is my peoples' enemy—By Marika long betray'd, set aflame.”*\n\n*\"Take vengeance upon Messmer and his lot. They who betrayed us, aye, they who burned us... Let them face in thy wrath their just deserts.”*\n\nHowever this presents a problem, from everything we know the crusade happened long after Marika became a god as Messmer and Gaius are considered to be elder brothers to Radahn(Which means that Radahn at the minimum knew Messmer during his time at Sellia).\n\nThere is nothing in the game, concrete anyways, that references any other betrayal by Marika. From all that we can tell, the Erdtree and the Hornsent were on friendly terms. The only thing that would make sense is if Marika deceived the Hornsent to become a god, however this has no evidence. Not even the Hornsent Grandam ever accuses Marika of such. Not once is there a piece of lore that ever references(besides a vague statue that could mean anything) any betrayal on Marika’s behalf during the ascension. No, the only betrayal to the Hornsent by Marika was the crusade.\n\n# Miquella's Atonement\n\nGoing off of Leda's words, Miquella's abandonment of everything is due to the aforementioned events. Thankfully, we do know quite a bit about Miquella's whole abandonment thing:\n\n*\"Miquella set off for the tower enshrouded by shadow, abandoning everything—his golden flesh, his blinding strength, even his fate. All in an effort to bury the original sin. To embrace the whole of it, and be reborn as a new god.\"*\n\n*\"Ever-young Miquella saw things for what they were. He knew that his bloodline was tainted. His roots mired in madness. A tragedy if ever there was one. That he would feel compelled to renounce everything. When the blame... lay squarely with the mother.\"*\n\n*\"You must kill Miquella... Grant him forgiveness.\"*\n\n*\"Well, I am much obliged. I can hardly believe it, he's divested himself of his very eye… Tender Miquella's eye is no mere morsel of flesh. It is a vessel of soaring grace. Proof of his Empyrean lineage. I wonder, does Miquella the Kind intend to sever his very birthright? His fate as a child of the Erdtree?\"*\n\n\n\nMiquella wanted to renounce his very flesh as a form of atonement for the sin created by his mother. Only then could he embrace the whole of it and be reborn as a new god, free of the grace of gold.\n\nNow the Original Sin is something that is quite interesting. Its important to note that the japanese for this is better translated as ‘Causality’ unlike the mention of the original sin in Messmer’s remembrance. However I do believe that they are both talking of the same sin as the creation of causality was the sin created long ago.\n\n# The Causality of Gold &amp; Shadow\n\nThe affair that happened at the beginning created Gold. However, Shadow was created too. Gold in this case is the gold of Order, the Scadutree is the opposite. The chaotic crucible that thrives outside of Order.\n\n*\"The Scadutree is the shadow of the Erdtree.*  \n*Born of dark notions that bear no sense of Order, that twist and bend its stock, rendering it brittle.\"*\n\nThe Scadutree(The main part of the tree) exists because the lands of the tower still are influenced by the crucible(Most likely because the Crucible originated from this land as Devonia’s items suggest). The Land of Shadow falls outside of the Erdtrees golden light. For the crucible has long lost its strength under the golden light of the Erdtree.\n\n*\"The Crucible has a particularly strong influence on the beasts of the realm of shadow, causing many to grow horns despite the characteristics of their species(DLC)\"*\n\n*\"This horn began to sprout on a beast that typically bears no horn. Perhaps it's a vestige of the primordial crucible(BASE GAME).\"*\n\nThere is also another interesting parallel with the Sword of light and the Sword of Darkness. The Sword of Lights' light is unswerving(meaning not changing) and the Sword of Darkness is made of wandering coils of darkness that creates vortices and eddies.\n\nThis division in the natural order of the world is the Original Sin, the causality created by Marika at the beginning. This division is why Miquella seeks to abandon everything(His blinding strength, his golden flesh, and the fate of a child of the Erdtree). For in order to embrace everything, he must no longer be a part of the causality. He refuses to be a god with the same causality affecting him, so it must go before he becomes a god.\n\n\n\n# SEDUCTION AND BETRAYAL\n\nNow we finally get to the main part of this. I propose that the seduction and the betrayal is not an act that Marika did, but an act done towards Marika by the fingers.\n\n\"*I fear that you have borne witness to the whole of it. The conceits – the hypocrisy – of the world built upon the Erdtree. The follies of men. Their bitter suffering. Is there no hope for redemption? The answer, sadly, is clear. There never was any hope. They were each of them defective. Unhinged, from the start. Marika herself. And the fingers that guided her. And this is what troubles me. No matter our efforts, if the roots are rotten, …then we have little recourse.\"*\n\nWhile Ymir is a bit biased, the important part of this is that the fingers are what guided her. This makes sense as there is a finger ruin near the shaman village. The fingers are what lead her to godhood, a godhood that Marika came to regret.\n\n\n\n“*Secret incantation of Queen Marika.*  \n*Only the kindness of gold, without Order.*\n\n*Creates a small, illusory Erdtree that continuously restores the HP of nearby allies.*\n\n*Marika bathed the village of her home in gold,*  \n*knowing full well that there was no one to heal.”*\n\n*“A braid of golden hair, cut loose. Queen Marika's offering to the Grandmother.*\n\n*Boosts holy damage negation by the utmost.*\n\n*What was her prayer? Her wish, her confession? There is no one left to answer, and Marika never returned home again.”*\n\n\n\nThe kindness of gold, without Order. An incantation that Marika made in secret and is in the form of the Erdtree(Which does imply that Marika came here after the Erdtree began). It is here that Marika cut off a braid of hair and gave her wish, her confession, her prayer to the Grandmother and left her home to never return. The reason for this: She realized she had been tricked and deceived right from the start.\n\n“*I declare mine intent,*\n\n*to search the depths of the Golden Order.*\n\n*Through understanding of the proper way,*\n\n*our faith, our grace, is increased.*\n\n*Those blissful early days of blind belief are long past.*\n\n*My comrades;*\n\n*why must ye falter?\"*\n\n\n\n*\"Then, after thy death,*\n\n*I will give back what I once claimed.*\n\n*Return to the Lands Between,  wage war,*\n\n*and brandish the Elden Ring.\"*\n\n\n\n*\"O Radagon, leal hound of the Golden Order.\"*\n\n\n\n*\"Your divinity, have mercy, and grant me forgiveness. The road is yet long. A God is not easily felled. But one day, without fail, you will have your wish. So please, grant me forgiveness, Queen Marika...\"*\n\n\n\n*\"Are you having second thoughts? Might I have a word, then?*  \n*Your kind are meant to challenge them. To slay them.*  \n*The demigods. And their god.*  \n*If you remain loyal to your calling, then no matter what you do, no matter what happens to me,*  \n*I will never cease to smith your weapons. Until you have one to slay a god.\"*\n\n\n\nMarika eventually came to conspire against the Golden Order, even disdaining it as she insults Radagon for his unyielding loyalty. She forsook her first lord and his men, chained a misbegotten to the Roundtable Hold, and shattered the very source of her godhood. All of it done to kill the very incarnation of Order.\n\nFor Marika finally realized the truth, that divinity was a cage and she has walked into a cage even worse. For she is no true god. She is merely a puppet held on the strings of a beast that has always been in charge for it is the very Elden Ring itself. This was why she ordered her lord and his men to brandish the Elden Ring once they returned. For in slaying the Elden Beast, Order can only be defined by the wielder. No more can the vassal of the Greater Will define Order.\n\nThis is the seduction and the betrayal. Marika was seduced by the fingers with the offering of divinity. A divinity that can bless all with a golden kindness. No more is divinity defined by something one is birthed with. Now divinity would be certain, observable. A giant golden tree that spills forth blessings for all, forever. That is the promise of Marika the Eternal. An eternal age of golden kindness.  \n  \nHowever, this wasn't to last. For the Erdtree ran dry and blessing no longer spilled forth and the blessed grace of gold became restrained by Order. Those not accepted by Order were forsaken, including three of her own children. I wonder if Order itself was what caused the Age of Plenty to end. After all, the Scadutree that isn't affected by Order still has golden sap.  \n\nThe betrayal in the end was that everything was for naught. Her children having to be hidden away from the world, her people that were assumingly killed for divine tower(Tree people at Enir-illim and that shaman flesh melds harmoniously well), and her age filled with stagnancy. That age of kindness was desecrated all in the name of Order.\n\nSo Marika, her faith broken, stand before the Grandmother and offers a braid of Golden Hair. For she, like her son, offers a part of her golden self as atonement. For everything she has sacrificed for, was for nothing in the end. And from that moment onward, all she desired was to right the world, to atone the only way she could. To create the end that should not be.\n\nI wonder if Miquella knew of all of this, for that might be why he forsook his other half and his doubts. So that he would not become like his mother, and realize the truth that St. Trina knew: \"*Godhood would be Miquella's prison. A caged divinity... is beyond saving.\"*\n\nTLDR:  \nThe Seduction and the Betrayal was the Fingers tricking Marika into becoming a god for her age of kindness, only for her to be nothing more than a vessel for the Elden Beast’s Order.\n\n",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:12.795963",
    "comments": [
      {
        "body": "I agree with most of what you said except for your conclusion about the EB\n\nThere's literally nothing the EB could have done to be the great mastermind behind it all\n\nThe EB doesn't strike me as someone very interested in politics, if you understand me\n\n Everything the Golden Order did was either something Marika, Radagon, or the Fingers wanted\n\nWe don't have any insinuation that the EB is forcing a specific form of order when it lets Marika simply remove the Death Rune from the Ring\n\n The genocide of the Hornsent, the creation of the Fundamentalists, the oppression of the crucible, and all the wars of expansion are just what Marika, Radagon, and the Fingers wanted without any influence from the EB\n\n\n The only time we even see the EB take action is in self-defense when Marika decides to destroy the Ring, which honestly I find totally justifiable on the part of the EB considering that it literally is the Elden Ring\n\nThe god Marika wanted to slay was herself to escape her cage",
        "score": 13
      },
      {
        "body": "Dude you gave me a huge realization.\n\nAnsbach asks you to create an order for men, not gods. I found this curuous given the base game's roster of endings.\n\nBut you're right -- killing the Elden Beast means all endings are, in some way, an order if mankind. The base Elden Lord endings (fia, dung, perfect, fractured) all are ruled only by an Elden Lord, marika's corpse itself just a vessel with no influence. No longer are there gods, now there is just YOU! \n\nWow. Great post. I agree with all of it. Marika is seduced by the Two Fingers, who betray both Metyr (cherishing fingers implies such) and Marika (in all the ways you mention + by picking Empyreans to replace her).",
        "score": 9
      },
      {
        "body": "This theory does make sense from the angle of how Miquella understands the “seduction and the betrayal”. I could see him believing that Marika’s ideal of “*the kindness of gold, without order*” was betrayed by trying to enforce it using the “*living incarnation of the concept of Order*”. In the eyes of the “Unalloyed” one, such comprise could doom the entire project of the Golden Order from the very beginning.\n\n\nHe explains this to Leda in order to justify why he’s going around and shedding his flesh and fate. Miquella may believe that by becoming a god in his own right, equal in status to the Elden Beast, he can be the one to create a world of “gentle gold”, shaped solely by his own unalloyed will.",
        "score": 8
      }
    ]
  },
  {
    "title": "The Hornsent are Descendants of the Ancestral Followers",
    "url": "https://i.redd.it/1a6g6jwgo83g1.jpeg",
    "score": 209,
    "subreddit": "EldenRingLoreTalk",
    "body": "Entangled somewhere deep within the convoluted web of maniacal genius that is Elden Ring lore, is a story of evolution and devolution. But this post isn’t about that, however the concept at its most basic core is important for understanding this theory. \n\nYou only need to understand 1 thing. Ancient things were big and strong, but generally speaking they got smaller and weaker over time.\n\nUnderstanding the link between the Hornsent and the Ancestral followers will also explain some of the mysterious similarities between the Nox and the Hornsent, and it may explain the biggest secret of them all, Elden John. \n\nLet’s kick this off with the most obvious connection between the Hornsent and the Ancestral Followers, physical features: https://imgur.com/a/t733Ovi\n\nI theorize that Ancestral Followers are to Hornsent, what Neandrathals are to Humans. The species that we most evolved from and eventually took over. \n\nBoth the Hornsent and the Ancestral Followers have white hair, they wear it with and without braids. They’re both pale skinned, and most importantly they both have a fascination with horns. \n\nWhile the Ancestral Followers do not have real horns anymore, their gods do: https://imgur.com/a/aYJepZu \n\nYou can see that on the Ancestral Spirit the horns are becoming smaller compared to the Hornsents Divine Beast. This, plus the missing horns on the Ancestral Followers heads, tells us that either this society is dying, or that they weren’t as deep into Crucible worship as the Hornsent would go on to be. I think the answer is both.\n\nWe do have some evidence to suggest that their society is failing. We actually find them in the over world, found guarding a minor Erdtree. Pushed to desperation they came above ground to look for solace in the thing that forced them underground to begin with.\n\nI believe their desperation is because Marika turned the Crucible into the Erdtree, and removed destined death. As a result of Marikas actions, all things crucible and death related got either completely destroyed or severely weakened.\n\nWe can also see that they do have some crucible imagery in their society but nothing like the Hornsent do: https://imgur.com/a/aOw3F7z \n\nThe hair, the golden spiral headband, and the horns all suggest that they were aware on some level of the Crucible; But the lack of it in their architecture and artwork tells us that they were not as fixated on the same aspects of it as the Hornsent are, or more likely; They weren’t as knowledgeable about it. \n\nAs we all know, the Crucible became the Erdtree. The old world became the modern world. In that way, Ancestral Followers could be compared to Amish people, but in a more extreme way. \n\nAs the Amish folk do not live with electricity, the Ancestral Followers did not believe in using letters, or using metal. They rejected the new and chose to live secluded underground, still clinging on to the old ways. “The ancestral followers keep their distance from the Erdtree, awaiting new buds. They are certain to sprout from their very flesh, and indeed, their souls.”\n\nThere is clearly a physical connection between the Hornsent and the Ancestral Followers, but the connection goes beyond the physical realm.\n\nGhostflame was a huge deal during the early days of the Hornsents age of the Crucible. It was one of many accepted forms of death, and it’s the only one important for this theory. \n\nGhostflame is exactly what it sounds likes, a magic/spirit fire. It’s also referred to as “spirit flame” and does magic damage instead of fire.\n\nThe Ancestral Followers also use magic/spirit fire that they call “spirit vapor.” Using the skull of a young ancestral spirit, they spew forth a blue vapor that deals magic damage, but exists in the physical form of fire. \n\nGiven all of the evidence, I believe that the Ancestral Followers are the progenitor species of  the Rauh, and therefore the Hornsent. And I believe Elden John may be the gap between the Ancestral Followers and the Rauh civilization. If you’ve seen Elden John in his full glory, you would see that he’s not quite a human. https://imgur.com/a/gg54W29\n\nElden John is clearly part tree, and I think that’s what made him so important. I believe he may have been an ancient Empyrean. \"Verdigris is said to be the gift of an outer god.” What this tells us, is that the Rauh civilization was at a turning point, and the Outer Gods were helping them make that turn. \n\nThey refused to use metal work and advanced language, but needed to use them to get to the next level of technology, consciousness, and magical ability. Essentially their own beliefs were holding them back from the next step in their cultural evolution. “A spirit of the horned folk who eschew letters and metalworking.” \n\nWe know Outer Gods use Empyreans to create Gods, to spread their message and influence. People certainly aren’t out here making hundreds of giant stone statues of somebody that isn’t a god, and given how massive the civilization became, I’d say they were successful. \n\nWhat Elden John represents is the evolution of Mysticism into Paganism. Elden John is kinda being compared to Moses with his stone tablet, marking the beginning of a new age of spirituality. \n\nThe Ancestral Followers are the people of the Rauh civilization that rejected change. Like I said, they are an extreme example of the Amish. They chose the old world. They kept their brutish forms, and their indigenous lifestyle, because the new world went against their spiritual beliefs.\n\nThere isn’t much to show us that these Ancestral Followers are directly connected to the Rauh civilization, but there is enough. First is the most obvious, you really only find them in Rauh ruins. \n\nThe second, and real reason, is that interacting with the architecture is an important part of their religious rituals. The fires of each pillar must be lit in order to awaken the Ancestral Spirit. These pillars exist in all Rauh like ruins, so this isn’t new construction the ancestral followers added in: https://imgur.com/a/c92Yb42\n\nNow that that’s out of the way, we can get to the good part.\n\nYou’ve seen the connection between the Hornsent and Ancestral Followers, but what if I told you that this connection leads to the answers of a much deeper mystery? It answers the question of why the Nox and the Hornsent are connected. \n\nAt some point during the Ancestral Followers time in isolation, they were greeted by unexpected refugees from the surface. The Nox. \n\nI imagine the first meeting went something like this: \n\n“So you guys just like, chose to live down here this whole time huh? Not really my first choice, but beggars can’t be choosers am I right ahahaha” The Noxman looked back at his fellow peoples who were also engaged in snide laughter, and went for a few fist bumps. \n\nThe Ancestral Follower looked around at the ruined civilization, and remembered a day when they were once a great people. It’s said that this Ancestral Follower would later go on to lead a march out of the underground. \n\nOk enough with my nonsense let’s get back to real lore. \n\nI think it’s pretty obvious that the Nox and the Ancestral Followers were in contact. It’s impossible to get to certain Nox cities without going through Ancestral territory. And we even see the Nox using Rauh gravestones: https://imgur.com/a/UsBwWhp\n\nSo with that said, the similarities between Nox civilization and Hornsent civilization is incredibly striking. Let’s explore some of those similarities. \n\nFirst the architecture: https://imgur.com/a/LIdW2WL\n\nUnderground Nox cities and Enir-Ilim are the only places that have this style. There’s nowhere else above ground besides Enir-Ilim that are built this way.\n\nSecond, the symbols they use in their artwork, while unique to their own civilizations, is ultimately extremely similar: https://imgur.com/a/LBZIsYZ\n\nWhile it is a stretch to say these civilizations have the same artwork, there is still clearly some huge similarities here. \n\nThird, they both have similarly sized giant people: https://imgur.com/a/UrFBXlW\n\nThere’s no other civilizations that have these random giant people, outside of literal giants. Just the Nox and the Hornsent.\n\nFourth, both civilizations turned massive amounts of people into stone: https://imgur.com/a/WwGwUeo\n\nThis one kinda speaks for itself. The only other place like you find bodies like this is Rykards arena, mixed in with the bodies of snakes. \n\nLast but not least, the fifth similarity between the two civilizations is their obsession with creating artificial life to reach divinity. \n\nThe Nox have had many experiments with trying to create divinity. The silver tears, albinaurics, dragon kin etc.\n\nThe Hornsents ancestors in Rauh were more into the whole artificial life thing than they were, but the Hornsent would do some experimenting of their own with the creation of the living jars. \n\nDespite all of these similarities between the Nox and the Hornsent, their religions and cultures were totally different from one another.\n\nWhile the Nox wanted to bring about the age of stars, the Hornsent were more than content with maintaining their own status quo. \n\nDespite all of these similarities, the only link we have between these 2 civilizations that could explain the strange connection, is the Ancestral Followers presence. \n\nPerhaps there were truths within that ancient mysticism that could only be understood by a more advanced society. Truths that the Hornsent would discover through many generations of an evolving religion, and the highly intelligent Nox would discover through their exposure to this strange people. \n\nSo what do you think? Did the Hornsent really descend from the Ancestral Followers, or is it all just a coincidence?",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:15.127530",
    "comments": [
      {
        "body": "Anatomically Modern Humans did not evolve FROM Neanderthals.\n\nNeanderthals were another branch of homonid that had already diverged from a common ancestor quite some time before we all made contact.\n\nTheres still a lot of debate about whether or not Humans actually even \"overtook\" Neanderthals. They say there was interbreeding, implying the DNA was similar enough for such a thing to happen and also produce viable offspring (offspring capable of reproducing). Some are skeptical about this considering that Bonobos (not Chimps as previously thought, also up for debate I think last I checked)  are Humans closest living relative share like 99% of DNA but cannot even produce hybrid offspring (which usually cant even reproduce.) \n\nSorry, I know its like something one could just easily gloss over. But the old commonly held belief about Anatomicaly Modern Humans having come FROM a straight line of other homonids fails to account for the rich tapestry of lore that is humanity and its many forms, variations and history.\n\n*Ahem* \n\nI'll see myself out now.",
        "score": 18
      },
      {
        "body": "So I think the Ancestral Followers, like some others have said, are like the leftovers of the Hornsent, Shaman, and Uhl Dynasty...they saw the destruction of things, wars, lies, etc. and probably decided to stay away from 'language and metalworking' ---- this I think is also referencing the \"divine act of smithing' from the Rauh/Giants culture, and also the 'light language' of Metyr/two fingers. \n\nI think we see a similarity between the Nox (mimics) and Hornsent, because the Hornsent are connected to the Uhl Dynasty in various ways, and the Nox were mimicing other civilizations imo. Hornsent and Uhl are connected by a few things - Lake of Rot Gate and Belurat Gate, Suppressing Pillar, both cultures in proximity to outer god stuff (Rot and Formless Mother). \n\nJust my two cents.",
        "score": 19
      },
      {
        "body": "They're fixated on the past (their choice to eschew letters and metal, their headbands in imitation of crucible horns) and unknowingly following in the footsteps of the Hornsent and various older forms of crucible worship, hence the name. The architecture found in Siofra, Ainsel, Uhl, etc. isn't theirs, it belongs to the old dynasty mentioned in the description of the bubble sorceries. \n\nThey're likely a relatively recent form of worship in the Lands Between LARPing as the Hornsent in the ruins of an entirely different culture.",
        "score": 11
      }
    ]
  },
  {
    "title": "Question about Ranni and the guidance of Grace",
    "url": "https://i.redd.it/ugtoh4dd2q3g1.jpeg",
    "score": 204,
    "subreddit": "EldenRingLoreTalk",
    "body": "Ok who ever is in charge of the guidance of Grace  whether it be Marika, the Elden Beast or the Greater Will itself, views the Age of Stars as a viable option. This grace appears right after Ranni  gets the finger slayer blade and directs us to Ranni to aid in the slaying of her bayful shadow and allowing her to kill her two fingers. \n\nSo I was wondering who do you think is guiding us to the Age of Stars and why you think they are doing it?\n\nPersonally I think its the greater will do it. For the greater will seems to be about the \"will to live\" and what better expression of the that is a age where everyone gets to decide their own fate without the meddling of God's. This is why their is no grace leading down to the sewers of Lendyll and towards the frenzy flame and why the grace guides us to defeat Miquella. Both  ages are antithetical to the \"will to live\" and make your own  choices where as Rannis age brings that in abundance. ",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:17.457591",
    "comments": [
      {
        "body": "I think it’s Marika. She’s guiding you to everything you need to get into the Erdtree and kill Radagon/her. She even points you to Castle Morne, which has no shardbearers, to get stronger before fighting her powerful children. I don’t think she cares if you choose Ranni’s ending or kill her, as long as you get rid of Radagon, who’s a hardcore fundamentalist who can’t see how bad the Golden Order has become and getting dangerously close to becoming the dominant personality in Marika’s body.\n\nThere are some places her guidance can’t reach, like deep underground or Farum Azula, the place out of time.",
        "score": 32
      },
      {
        "body": "I think that Marika has been crucified for so long she's down for absolutely anything that changes the status quo. Even the frenzied flame. Whatever 4D chess plans had has since been abandoned",
        "score": 22
      },
      {
        "body": "Correct, the quarrel with Ranni is exclusively based on the dispute with the fingers. The greater wills themselves have no problem with her or the suggestion that she take on the mantel of Empyrean. As is evidenced by the grace leading you too her.\n\nGodwyns death was a static predestined event. As is apparent from the nature of “destined” death and the dialogue provided by his wet nurse. While Ranni’s actions in stealing half of his death for herself are labeled as a perversion of the natural order by the fingers, this is the **judgement** of the fingers alone. \n\nMuch of this crisis stems from the fingers role as a didactic for matters of fate which it only interprets. The fingers could determine that Godwin would die, yet it didn’t correctly ordain the nuance of how, an nonetheless its rulings became a revered prophesy. So when Godwin died a half death (which paradoxically was thereafter always the correct corse of history, despite the fingers ruling), it’s possible it became a crisis of legitimacy for the fingers. \n\n**If Godwins fate was destined, then it’s by rule of paradox impossible that what occurred  subverted destiny.** \n\nThe root of the issue is, as we learn later, the fingers being a has-been fortune teller. Unable to do anything but reiterate the future they witnessed long ago before Metyr was maimed a their link to the universe severed. \n\nPart of the issue is also Ranni’s pedigree as a star-gazer, an oracle in her own right. The suggestion that Ranni could be an empyrean capable of ordaining fate **independently** of the fingers; a suggestion seemingly endorsed by her foresight into the players actions an the possibility that they would chose to be her consort, is likely an existential threat to the aging fingers. \n\nBasically, the feud is about job security. If Ranni has the Elden Ring, the fingers are going to need to find a new employer. (This isn’t even mentioning how the fingers are only pretending to still see the future)",
        "score": 19
      }
    ]
  },
  {
    "title": "Stips of White Flesh might explain the Godslayer Hunt",
    "url": "https://i.redd.it/58d6r6w69n5g1.png",
    "score": 208,
    "subreddit": "EldenRingLoreTalk",
    "body": "Still a tentative theory but I've come to believe that the victims of the Godslayer Hunt may not have been the Children of Marika at all. (Or at least of this generation.)\n\nOne of the most notable traits of the Godslayers is their stark white robes which are made out of the skinned hides of their victims.\n\n\"Robe made by sewing together patches of smooth skin.\"\n~ Godskin Apostle Robe\n\n\"Robe made by sewing together patches of smooth skin.\nSubcutaneous fat makes it plump and soft.\nWorn by Godskin Nobles, known for their seven-face aprons.\"\n~ Godskin Noble Robe\n\n\"Sacred cloth of the Godskin Apostles, made from supple skin sewn together.\"\n~ Godskin Swaddling Cloth\n\nBut whose skin exactly? Who were these Gods and what can we learn about them? \n\nOf all the dialogue concerning Gods in game there is one group who stands out specifically. The Oracle Envoys.\n\n\"Spirits of a monstrous band of musicians who employ sacred arts. It is said that when Oracle Envoys appear, playing their pipes, they do so to herald the arrival of a new god, or age.\"\n~ Oracle Envoy Ashes\n\nThey're specifically mentioned as heralds of new Gods, their ages and presumably their orders. If that is the case that means that they've been around for a LOOOOOOOOONG time, and if so that means that they no doubt would have some at least extant connections to the Godskins.\n\nLo and behold there exists an item which might explain the nature of the Gods in question.\n\n\"Thin strips of flesh taken from a bloodless creature.\"\n~ Strips of White Flesh\n\nThis item specifically is dropped by the Oracle Envoys who themselves seem to have a quite ivory palor. \n\nSo essentially what does that tell us? A couple things actually. The best item of reference to compare it would be its counterpart the Sliver of Meat item.\n\n\"A slice of thinly carved beast flesh.\"\n~ Sliver of Meat\n\nIf we go based off my theory this would establish the Gods in question as:\n\n- White Skinned\n- Bloodless\n- And non-beast\n\nThe last part I assume based not only off of the description but the types of enemies that drop the Strips of White Flesh item.\n\nIf you look at the wiki collectively the common vein amongst most of its carriers are aquatic creatures such as crabs and lobsters. To me this indicates that these Gods may have had origins that lay in the water.\n\nAnother vein of thought that supports this is the mention of an alternative evolutionary process mentioned in the Godskin gear:\n\n\"Nobles are the most ancient apostles\nwho are said to have assimilated inhuman physiology.\"\n~ Godskin Noble Robe\n\nThe assimilation of inhuman physiology is what grabs me here. It might even imply that the Gods they hunted evolved based off an alternative to the Crucible, and the Crucibles creation may have been a more recent occurrence. This is also supported considering that the Godskins were known for borrowing other things from the Gods they hunted as well:\n\n\"Once a sign of the gods' wrath, this incantation became a trophy of the Nobles' god hunt.\"\n~ Noble Presence\n\nIt's quite possible that the Godskins white skin itself came about as a result of their hunt.\n\nI'd love to know everyone's thoughts! Happy Lore Hunting!!!",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:19.806408",
    "comments": [
      {
        "body": "There was a great lore video that touched in this topic. I can’t remember which creator made it, but they drew a clear connection between the trolls and the Godskins as you did. In one example, the Noble’s Presence aow is compared to Troll’s Roar, demonstrating a strong connection between them!",
        "score": 20
      },
      {
        "body": "I'm pretty convinced by the giants-being-hunted theory - some good posts on this sub with compelling visual links, with the front-faces of the robe similar to trolls (see golden eyes of the northern, non flayed trolls) and the other faces on the robe are of a larger variety (back of apostle robe/hood straight up looks like a giant to me).  \n\nI think the paleness and white flesh is more indicative of them being \"artificial\" in terms of their relationship to primordial life (blood/gold). Albinarics are another example, seen as unnaturally born. Similar to the octos feeding off \"natural\" life (primordial) to birth things outside that natural life goop.",
        "score": 19
      },
      {
        "body": "I assumed the oracles were albinaurics of some kind because of their skin color, lack of red blood, and seeming lack of legs",
        "score": 13
      }
    ]
  },
  {
    "title": "The Crucible became the Ancient Elden Ring",
    "url": "https://i.redd.it/3l3tubt4xb2g1.jpeg",
    "score": 202,
    "subreddit": "EldenRingLoreTalk",
    "body": "The Greater Will, and the Elden Ring didn’t exist in opposition of the Crucible. They existed together in a harmony that Marika disrupted. \n\nWe see it in the Elden Ring itself: https://imgur.com/a/R1ubmCB\n\nYou can see clear as day that the Ancient Elden Ring has the Crucible inside of it.\n\nPastor Miriel: “Oh, what have we here? Very well, let us both learn together. Heresy is not native to the world; it is but a contrivance. All things can be conjoined.\"",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:22.154850",
    "comments": [
      {
        "body": "This is something that is overlooked so much and something I think provides a lot of insight. My last post ( [https://www.reddit.com/r/EldenRingLoreTalk/s/GuZZ3X1Tbk](https://www.reddit.com/r/EldenRingLoreTalk/s/GuZZ3X1Tbk) ) touched on this, and someone brought up the Perfumer Shield;\n\nhttps://preview.redd.it/ee9s3mm0ed2g1.jpeg?width=200&amp;format=pjpg&amp;auto=webp&amp;s=958df4e4fcca64a66e29b4a0da829f4b7a7b092c\n\nA spiral within a stylised tree trunk with other spirals surrounding it and what I assume to be Metyr at the top. We see the same symbol at the top here on the Blue Festive Garb from Dominula, too.\n\nNot only does the primordial Elden Ring host a spiral rune, but it seems as if some people knew full well what this spiral was used for and that Metyr was the catalyst for this event.\n\nI do sometimes question whether using the Crucible energies in the creation of the Erdtree did some kind of damage to the Greater Will that stopped it communicating, but I do keep coming back to the idea that GW got what it wanted with the Erdtree and left.\n\nWhatever happened, it appears Marika sullied the Crucible energies and locked them away within / behind the tree.",
        "score": 12
      },
      {
        "body": "Wasn't this already common knowledge?",
        "score": 13
      },
      {
        "body": "The crucible is the primal vital energy of the world. It, like the Greater Will that created life, is golden. The Elden Ring is most likely constucted from the gold that is found in life. The Elden Ring is basically powered by these vital energies and the earliest form of the Elden Ring shows this.\n\nHowever, the Elden Ring now lacks the spiral. This tracks as the crucible and its primal energies are rejected on a fundamental level by Order.",
        "score": 11
      }
    ]
  },
  {
    "title": "There appears to be parasites in the liquid draining from Godwyn's eye.",
    "url": "https://i.redd.it/7qj1erewv73g1.png",
    "score": 191,
    "subreddit": "EldenRingLoreTalk",
    "body": "",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:35:24.506943",
    "comments": [
      {
        "body": "If you look at the deathblight brambles, they aren't actually like branches or vines, theyre made of maggots and the thorns are fly wings. Zullie has a video showing it off.\n\nThe overwhelming association with death in Elden Ring is funnily enough, life. You get pumped full of death juice and what kills you is an explosive burst of life. Death and the crucible are undeniably intertwined, life and death. The double helix of the spira.\n\nThe crucible of life in the real world is the ocean. Death has a strong nautical theme from Godwin to the Mariners to the Spirit Jellyfish. The spirit Jellyfish go to visit the stars. Metyr's arena is a weird infinite sea thing, same with Rennala. The stars themselves are heavily associated with life. Solid chance the crucible was once a star like most other primordial beings.\n\nIt's a really cool little intertwining knot of vibesy association I think works on an intuitive level even if you can't totally resolve it into a hard narrative.",
        "score": 72
      },
      {
        "body": "Not just his eye. The movement actually starts on his back, near his spine and the wound. I'm really glad you pointed this out though cause I had totally forgotten about it.\n\nI keep thinking they had to carve the cursemark that way to kill or remove something attached to his spine, like how his mother has the Elden Ring and various characters in Sekiro have the serpent/centipede. An endogenous finger-serpent maybe? But it doesn't die, it evolves into deathroot, like a planarian worm multiplying by being cut into pieces.",
        "score": 27
      },
      {
        "body": "Its either the first case of death root or if its actually is a worm it could be what eventually leads to the creation of those worm head things that use death blight.",
        "score": 27
      }
    ]
  },
  {
    "title": "Fia as a representation of Marika's Shaman roots and attempt at love. (Why Marika shattered the ring part 1)",
    "url": "https://www.reddit.com/gallery/1p80cj2",
    "score": 190,
    "subreddit": "EldenRingLoreTalk",
    "body": "Elden ring is a very dense game when it comes to lore, requiring knowledge several unrelated fields to make sense of what the hell is happening. The communtiy contains botanists, historians, even people carbon dating textures and datamining for gold.\n\nElden ring remains special among souls games because in older games like DS1 you had the basic gist of things if you watched a few cutscenes, listened to frampt and kaathe and read a few item descriptions. In elden ring we can't even agree what characters want or even who they are, and one of the biggest culprits of that is Marika and the shattering. But after the revelations of the DLC and multiple runs and time to reflect and analyse i believe i reached a conclusion.\n\nI personally believe that elden ring is a story about Marika's introspection post grief, done through the lens of extention of grace to tarnished that echo aspects of her and her history. Letting them compete to find the best solution forward in shadow of the failure of the golden order.\n\nAgreeing on motive :\n\nThe trailer for the game's story narrated by Ranni paints a simple and pretty clear picture of the events leading to the shattering. There is a sea of theories about wether Marika was in on the plan, wasn't, wanted to kill Godwyn to ready him for godhood but ranni fiddled with the black knives, some even stipulate Godwyn was cursed even before his death... Quite frankly none of it matters in the context of this discussion, as Ranni herself, the self proclaimed architect of the death of Godwyn, with her magical fingerprints all over the blade as confirmed by Rogier, says in that trailer that the death of Godwyn, and his incomplete state drove Marika to the brink which led to the shattering and later on the extention of grace to the tarnished.\n\nThe shattering and the summoning of the mending rune tarnished can be therefore understood as an attempt from Marika to see the world from an external perspective, retrace her path and relearn the world, herself and the order post grief seeing that every tarnished introduced in the cutscene has aspects of her and her history within them, and hopefully find a path forward.\n\nHorah loux is her first husband and ruler of the age of plenty, Fia is a reviled witch that engages in life giving and a deep desire for motherhood, Goldmask as an introspective sage seeking the depths of the order, dung eater as a walking talking manifestation of the terror inflicted upon her by the hornsent and inflicted by her upon them and Gideon as a knowledge seeker from without, not within.\n\nBeginning with Fia, as she represents the earliest stage of life of Marika as a shaman girl, reviled and hunted down by the dominant culture, and the idea of the divine feminine. Both Marika and Fia have deep ties to the concept of motherhood, absorbing life to give life, sending heroes to do their bidding and having their headquarters be bedchambers with stacks of books next to them. \n\nMesopotamia and the divine feminin : \n\nElden ring takes inspiration from world history and mythology but nowhere is it clearer than with the hornsent, godfrey and Marika.\n\nEnir illim clearly is inspired by bab illim or Babylon in English. Midra's wife Nanaya is named after a fertility godess and speculated aspect of Ishtar/Inanna. Godfrey's history even has many similarities to the story of Gilgamesh, an ancient warrior king always depicted with a lion as his greatest friend. But it appears the roles were flipped as the regal king is Serosh and the barbarian beast is Horah loux, in the story of Gilgamesh Enkidu lives as one with the beasts naked similar to Horah loux, the highlanders and the badlanders and shunning exess adornment to hunt bears and beasts to be filled with the extacy of the wild.\n\nIn that story, Enkidu terrorises the hunters and the animals until a priestess of Ishtar names Shamhat literally, and without any exaggeration screws him into submission for seven days and seven nights straight. In many ancient cultures masculinity is seen as explosive, wild, tumultuous and destructive. But with the introduction of feminity and the transformative capabilities of it, through sexual intercourse that negative energy is not only removed but transformed into life and a gateway for civilization through the stifling of beastly urges clearing the mind. These prostitutes even engaged in ritualistic intercourse to bless harvests. Of course Enkidu later hears about Gilgamesh and fights him to the near death and from that is born the first bromance in recorded history. Add to that Gilgamesh was fond of axes as weapons, being his and Enkidu's weapon of choice against the divine beast humbaba that lived in a forest of ancient trees.\n\nThis act fits the depiction of the hornsent grandam of Marika as a wanton strumpet and the first sin as a seduction and then a betrayal through the banishment of Godfrey.\n\nFia herself is very coded as a ritualistic prostitute and divine mother gathering life from champions to give a noble a second life, done through flesh and please don't tell me i'm the only one that sees this, there was a thousand ways Miyazaki could depict a baldachin but he chose the one with a clit and curtains.\n\nThe tarnished can be seen here a second Godfrey serving the role of being the father of Godwyn's second life. Like Godfrey was to his first life. \n\nMarika, through the guidance of grace offered to Fia and offered to the tarnished leading towards Fia accepts death, those who live in death and Godwyn within her as the symbolic pillar of the principle of life within death in the golden order and a renewed love for motherhood. Fia even declares the tarnished her greatest champion giving him her radiant blessing and that being a deathbed companion was her greatest joy.\n\nThis is a repost and a light revision to a removed post, the second is Goldmask and the third will be the dung eater. Gonna be morbid as hell and possibly longer, oof.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:26.915150",
    "comments": [
      {
        "body": "\"elden ring is a story about Marika's introspection post grief\"\n\nMay i introduce you to The Centered Tarnished on YT",
        "score": 10
      },
      {
        "body": "Ranni says Marika was driven to the brink and then says this:\n\nhttps://preview.redd.it/6okwf5jsjt3g1.png?width=1838&amp;format=png&amp;auto=webp&amp;s=fa0b75324afe1b724217fe3c2af974f388e0f14d\n\nSo I don't really know how seriously I should take your post.\n\nEdit: Not that I disagree about Fia. I just disagree about your writeup on motive.",
        "score": 8
      },
      {
        "body": "Yeah, Fia is prostitute coded and it's meant to suggest Marika may have been one also. u/goodhunter465 made a thread a while back about how the characters in the round table hold all mirror Marika's story\n\nI'll paraphrase what I wrote in their thread:\n\nFia mirrors Marika - on the surface they are both women who wear very similar black dresses and hang out in a bedchamber with baldachin imagery (+ golden hair if you remove her hood). Fia is clearly some kind of \"sex worker\" (\"do you think it shameful\") which may imply Marika was too.\n\nThere’s a lot of other clues hinting at this - strong similarities between Marikas dress and the “dark undergarments” of the Dancer of Ranah, who danced with “burning passion”; Repeated references to Marika as a “strumpet” by the Grandam; Marika’s snake bracelet which appears to be modeled after the [Moregine bracelet](https://en.m.wikipedia.org/wiki/Moregine_bracelet); the *seduction* and the betrayal. I think it's possible Marika was some kind of hornsent concubine/slave, which would be very GRRM and reminisicent of both Melisandre and Danaerys.",
        "score": 8
      }
    ]
  },
  {
    "title": "Is the Balancers expedition boss of Nightreign's DLC based on the Winged Scythe description?",
    "url": "https://i.redd.it/qnhd6nqztu5g1.png",
    "score": 184,
    "subreddit": "EldenRingLoreTalk",
    "body": "The weapon's description reads:\n\n\"Sacred scythe resembling a pair of white wings. Deals holy damage.\n\nAccording to pagan belief, white-winged maidens are said to be Death's gentle envoys.*\"*\n\n  \nThe weakness of this boss is sleep, which has fairly strong associations with death in Elden Ring. Some of their attacks appear to do holy damage as well, although I'm not certain of that.\n\nThe expedition description reads:\n\n\"Seven valkyries clad in white armor. These servants of the heavens restore the balance of the world by wielding heroic weapons that purify chaos.\n\nBut even heroines must one day sleep, so why not retire early to the annals of history?\"\n\n  \nThe use of weapons, of course, typically involves death, even when it's for a noble cause. I know that \"of the heavens\" could set them apart from the concept of \"death's gentle envoys\", but I would like to point out that Maliketh's Black Blade (the weapon and the incantation), and the Black Knife weapons do holy damage, and things related to Black Flame scale on Faith.\n\nAnd the description in the relic received for defeating them reads:\n\n&gt;!A tiny farming village was besieged by bandits, who proceeded to ravage both its plots and people.!&lt;\n\n&gt;!A young village girl, seeking help, dashed into the forest, where she prayed to the statue of a protective deity that held a weapon raised overhead.!&lt;\n\n&gt;!By the end the village was steeped in red and settled in silence. The village girl, drenched in blood, stood with a vacant stare and a heroic weapon in her grip.!&lt;\n\nThe mention of &gt;!\"a protective deity that held a weapon raised overhead\"!&lt; doesn't sound like any statues we've seen of Marika, and could potentially fall under the category of \"pagan beliefs\" in the Lands Between. Radagon does strike a pose like this in the intro to his boss fight, but not in his statues.\n\n  \nI understand that the nature of Nightreign's canon is shaky, but the Winged Scythe's description has always felt like a bit of an odd inclusion in Elden Ring, and this kind of lore expansion seems like a perfect fit for Nightreign. The game's director has more or less said directly that it's designed to exist in Elden Ring's world without unraveling its central plot and mysteries. I'm curious what others think though.",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:29.245357",
    "comments": [
      {
        "body": "I think it's them, yeah.\n\nA Cleanrot Knight is the one we find guarding the chest containing the scythe in Marais, if I recall correctly. Cleanrot Knights possess at least two techniques that pay direct homage to these women( specifically, the ones where they spring holy spears from the ground). Malenia herself, and her \" children\", have the term \" scarlet valkyrie\" applied to them, and Malenia's own getup(specifically  her helm) seems to point to the intent of wanting to appear as one of those maidens, or at least follow their example.\n\nIt's not that complicated. Valkyries are frequently winged women in Norse mythology who serve and fight with Odin appear to guide warriors unto a glorious afterlife(Valhalla) as their reward. \"Death's gentle envoys\" are valkyries based on their description. Both the Balancers and Malenia fit( or in the latter case, attempt to fit) the category.\n\nEdit: I stand corrected. The chest in Marais holds an arm for Milicent; not the Winged Scythe. \n\n\nMy real question in all this is what God they actually serve.",
        "score": 23
      },
      {
        "body": "Malenia frequently has fetishes of her holding a sword aloft. If I had to put my money the statue being of anyone, it would be the her being worshipped as the Goddess of Rot, or perhaps of being the one holding back the Outer God of Rot within herself ala Blue Dancer. I would go further to say that the girl likely performed a sort of divine invocation to become the idea of Malenia, in a similar way to how Malenia may be practicing an invocation of the Blue Dancer.\n\nThat being said, I also don’t think you’re wrong for connecting the Balancers to the gentle envoys of death. The Cleanrot Knights have white wings on their helm, and Miquella and Malenia have many ties to ancient death culture. I think the most illuminating tie comes from the Death Ritual Spear and the Spectral Rings of Light. The Spectral Rings of Light of course look like a prototype of Miquella’s light with their age being quite apparently older than Miquella’s Unalloyed. The Death Ritual Spear’s ash of war creates numerous spears, like the Cleanrot Spear’s Sacred Phalanx. It’s also looks incredibly similar to the spell Miquella’s Light. The cherry on top to all of this is that the spear and Helphen’s Steeple are right outside of Castle Sol where Miquella was doing his death research into the Eclipse.\n\nWhat all this means to me at the moment is still up in the air, though I’ll likely have some possible answers I’ll make in a post soon.",
        "score": 10
      },
      {
        "body": "I think it is definitely based on that description.\n\n Saw some comments about Malenia but shit like \"purifying chaos\" seems to be along Melinas lines of wording and/or threats for the destined death ending.\n\nThem having Messmers moveset and ash of war throws me off a bit too",
        "score": 10
      }
    ]
  },
  {
    "title": "Who was the Briar Maiden and what can she tell us?",
    "url": "https://i.redd.it/6qojfsxhll4g1.png",
    "score": 164,
    "subreddit": "EldenRingLoreTalk",
    "body": "The Maiden featured on the Shield of the Guilty seems to reveal a bit about the nature of the Lands Between and it's existence as a possible Penal Colony.\n\nThe shield description reads...\n\n\"Shield made to venerate a maiden whose eyes were crushed by Briars of Sin before being reborn in these lands.\n\nVenerating the repose of the soul, this shield boosts focus. The briars can be used to attack foes.\"\n\nRight away we are given several subjects...\n\n- The Briars of Sin\n- Rebirth\n- Repose of the Soul\n\nWhat does this tell us? Well essentially it seems that the Briar Maiden was guilty of something as Briars of Sin reveals:\n\n\"The guilty, their eyes gouged by thorns, lived in eternal darkness. There, they discovered the blood star.\"\n\nThis tells us right away that the Briar Maiden was guilty of something. For this she had her eyes crushed by deadly briars and was forced to walk in Eternal Darkness for her punishment. \n\nThe presence of Briars also possibly implies a strong connection to the Blood Star, and by possible extension the Mother of Truth.\n\nAside from her these thorns are featured on the Fire Guardian Hags likely signifying some connection between these two parties. In essence it begs the question of what are these hags guilty of if they are in-service to the Erdtree. A service that would ensure the trees longevity at that.\n\nAnother possessor of Briars is Elemer, another foreigner who himself was set to be Executed if it weren't for the downfall of House Marais. His gear reads:\n\n\"Battered iron armor from a foreign land. Worn by Elemer of the Briar. \n\nThe winding, rusted iron briars are a mark of the guilty and typically indicate a sentence of death.\n\nElemer murdered numerous instructors and merchants, and was known as the Bell Bearing Hunter.\"\n\n~ Briar Armor\n\nAgain we are given the subjects of Guilt and foreign nature. Elemer originates from Eochaid and for whatever reason he was sent ALL THE WAY to TLB to be killed. Why? \n\nThat brings us to our next subjects: Rebirth and Repose of the Soul.\n\nWhy The Lands Between, ignoring differences between real world and fictional economies, wouldn't it cost less to just kill them where they were? Perhaps but what if I told you that they were only meant to die to be reborn. If we take another look at the Shield of the Guilty it mentions:\n\n\"Shield made to venerate a maiden whose eyes were crushed by Briars of Sin before being reborn in these lands.\"\n\nTo be reborn requires that one must have died, even in the metaphorical sense, something must be given up to gain new shape. And it's not like this isn't something that happens regularly in TLB anyways:\n\n\"Amber egg clutched by Rennala, Queen of the Full Moon.\nGreat Rune of unborn demigods.\n\nPerfects those who have been born anew.\n\nChildren born anew by Rennala are all frail and short-lived. Imperfect beings, each and all.\"\n\nIn fact we see a myriad of enemies in game that have seemingly been reborn into new shapes, and each of them drops a Larval Tear. In order for this rebirth to be reversed the creatures new form in question must be destroyed to revert. This loosely connects Death with transformation (though then again it could just be a gameplay mech who knows?)\n\nBut lastly to tie this together are the Lulling Branch and the Slumbering Egg:\n\n\"In the midst of drowsiness, there is the will to awaken.\nFeelings that rise from the depths of one's heart.\"\n\n\"Owl eggs that will never hatch.\nMaterial used for crafting items.\n\nPrized as a symbol of the most sublime slumber.\"\n\nIn previous posts I detail how Sleep the domain of St. Trina has intrinsic connections to Death which is countered by Miquella's connection to \"waking,\" birth or what we collectively reference as Nascency.\n\nBoth operate as vital parts of the cycle of rebirth one bringing rest to that which whithers, while the other rouses new life into birth.\n\nThe line mentioned on the shield:\n\n\"Venerating the repose of the soul\"\n\nSeems to be referencing directly the subject mentioned prior in the same item: the concept of being reborn.\n\nIn conclusion:\n\nI have come to believe that The Lands Between are indeed a Penal Colony, and that Death only washes ashore to be reborn in some way into a more suitable acceptable form. This would even seem to explain the Zealotry of the Hornsent who Jar the Maidens.\n\nIf indeed there was some history here wherein the Shaman would, \"Make Saints of Criminals\" who came there, we can kinda see how it could turn for the worst if perhaps a previous order had been deposed.\n\nTo put it concisely: The Shaman were likely Wardens of a Penal Colony, and could have suffered a disaster which tilted the scales out of their favor making the prison (rehabilitation center?) they once held into cage for themselves. \n\nTo back this up I'll even bring up the Winged Scythe:\n\n\"According to pagan belief, white-winged maidens are said to be Death's gentle envoys.\"\n\nThe Deathbirds were no doubt Matriarchal given that their only progenitor given was a Mother in the Form of the Twinbirds. And here we are again given the concept of femininity in connection with Death. The Deathbed companions, Trina, Melina, Ranni and even Malenia and her Valkyries. \n\nThis paints a picture of a Matriarchal Land of Death and if one has Death, it must be tempered and defined by Life. The line connecting these two? Rebirth. \n\nBonus bit:\n\nThis got me to thinking also about the Biblical Story of Cain and Abel. To keep it short, after Cain kills his Brother he is sent to \"The Land of Nod,\" and if one where to look up the meaning of the word Numen/Numina:\n\n\"Etymologically, the word means \"a nod of the head\", here referring to a deity as it were \"nodding\", or making its will or its presence known.\"\n\nJust some food for thought. I hope you enjoyed my ramblings, please lmk what you think! And as always HAPPY LORE HUNTING!!!",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:31.586928",
    "comments": [
      {
        "body": "The Guilty and Exile Soldiers—both enwreathed in thorns—drop Smoldering Butterflies, Melina's item.\n\nExile Soldiers guard the Godslayer's Seal, and there is a cut Blackflame Guilty variant that made it into Nightreign.",
        "score": 21
      },
      {
        "body": "Low key, what if this was Marika?",
        "score": 15
      },
      {
        "body": "Omg the lands between is australia",
        "score": 11
      }
    ]
  },
  {
    "title": "Where is Godwyns’ throne?",
    "url": "https://i.redd.it/c7mchn9nxw4g1.jpeg",
    "score": 158,
    "subreddit": "EldenRingLoreTalk",
    "body": "Hi everyone! I just thought about this today and don’t remember hearing any discussions about it, so I thought I’d bring it up. Sorry if I’m being dense and forgot if there’s an actual lore reason to why he doesn’t have one. Anyways!\nIn Morgott’s cutscene, he lists the names for the thrones before the erdtree. Godrick, Miquella, Malenia, Radahn, Rykard, and Ranni. Why doesn’t Godwyn have one? I can’t think of a reason to why he wouldn’t be a part of the meetings/discussions. So either he was never apart of the meetings, or they continued to have meetings without him post his death/the shattering, which would be quite surprising imo given that I thought war broke out pretty much immediately after those events. Anyways, I’d like to hear everyone’s thoughts on it if you’d like to share",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:33.930563",
    "comments": [
      {
        "body": "After Godwyn's death the war didn't break out immediately. \n\n\nHe received Erdtree burial, deathroot spread through the roots, Those Who Live In Death started showing up, a whole organization that hunts them was created, walking mausoleums were built, the mausoleum knights were established, Miquella's eclipse plan was put in motion and failed, Godwyn's knights became deathknights and began searching for his weird squid growths, all before the Shattering. They had plenty of time to remove his chair. Or let Godrick sit on it.",
        "score": 68
      },
      {
        "body": "The Sovereign Alliance was the group of demigods formed after Marika shattered the Elden Ring and just before the Shattering War. Godwyn was already “dead” by that point.\n\nTheir lust for power as the ring shards corrupted them caused them to backstab one another, eventually culminating with Goderick fleeing the Imperial city with a Great Rune and triggering the War.",
        "score": 43
      },
      {
        "body": "The Sovereign Alliance was formed after the Shattering of the Elden Ring, and thus, after the death of Godwyn. It was established upon Marika and Radagon's disappearance, leaving the continent effectively without leadership or divine direction right after the apocalypse of the shattering of Order. \n\n\nGodrick is a distant descendant of Godwyn, so his place at the table was handed down to him as the last (public) descendant of the Golden Lineage and the blood of Godfrey.\n\n\nNotice that the seats are positioned in relation to their different houses: Godrick for the house of Godfrey stands alone, the empyrean prodigies of the second Elden Lord are together, and the children of Caria are by themselves on the other corner. \n\n\nThis alliance either preceded the Shattering War entirely, or was meant to guard the Erdtree against the armies of the minor demigods (we know from Vike that there were other demigods)\n\n\nI love that Ranni's throne is noticeably smaller lol",
        "score": 38
      }
    ]
  },
  {
    "title": "God-Devouring and Abyssal Serpent Related?",
    "url": "https://i.redd.it/afnhdjusxh5g1.jpeg",
    "score": 150,
    "subreddit": "EldenRingLoreTalk",
    "body": "We all know Rykard fed himself to the God, devouring serpent, but after playing through the DLC and seeing more serpents with divine aspects, it definitely made me speculate on this image and question why the eggs are never mentioned? Do you believe that there is a possibility that these snakes are of the same clutch?",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:35:36.308564",
    "comments": [
      {
        "body": "I think it's more that Messmer is something of an aspect of the God Devouring Serpent, which I believe is just one half of the Twinbird. Melina would be the other half representing the bird side, which is why they have their empyrean eyes on opposite sides of each other - in essence being two halves of the same coin. \n\nhttps://www.reddit.com/r/EldenRingLoreTalk/comments/1c8s4ja/comment/l0h1jt1/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\n\nI go more in depth on that in this comment.\n\nAs for the eggs, those are most likely the eggs used to born the man serpents, though you do see the same tendency for motherhood from the snake form as the Twinbird (who is referred to as the mother of the deathbirds).",
        "score": 13
      },
      {
        "body": "The mirrored serpent statues in the Shadow Keep keep me up at night, there's something to them: leathery wings in the Keep, feathered wings in the Volcano; the serpent in the Keep devours the Sun, the Serpent in the Volcano devours the world.",
        "score": 12
      },
      {
        "body": "One thing I don't see addressed is the fact the God Devouring Serpent... is named the GOD DEVOURING serpent. This has to imply that at some point in the past the serpent actually consumed a god. Messmer's special move has a serpent with a ball of fire in his mouth.\n\nI believe that this was when the serpent devoured the sun or the flame of the Fell God or perhaps the Fell God itself. If not that God, the only other god I can think of would be Marika. Which.... would make sense too.   \n  \nThe O mother gesture is found on a headless corpse beside a serpent skin after all. The serpent seems to meld with those it eats. Perhaps that is a trait it got from eating Numen. Marika as a spirit caller may have been able to pull her spirit into a new body or even take over the serpent itself, shedding it at the Divine gate. This would make the DLC trailer make sense as well. Though this is a bit under baked.",
        "score": 12
      }
    ]
  },
  {
    "title": "Shabriri wasn't lying",
    "url": "https://www.reddit.com/r/EldenRingLoreTalk/comments/1oy446x/shabriri_wasnt_lying/",
    "score": 152,
    "subreddit": "EldenRingLoreTalk",
    "body": "It's said that Shabriri committed the crime of slander and as punishment had his eyes gouged out. Most people just accept that at face value, believing that Shabriri is, as he himself claims to be, chaos incarnate and using that as an excuse to not have to explain any of the things he does or says because \"he's chaotic\" but this line of thinking has never sat right with me. For one thing villains never start out as villains, certainly not in these games. There is no character in any one of these games that is pure evil, so it's crazy to me that everyone would just accept the idea that Shabriri is and has always been pure evil simply because he's supposed to be chaotic, or that he's always been the same person that he is when we meet him in-game even before he had his eyes gouged out.\n\nThe most common theory I've heard is that Shabriri slandered the wandering merchants, claiming that they worshipped the three fingers and flame of frenzy (this is the theory in Vaati's frenzy vid)\n\nbut 1. this couldn't be the case if the frenzy's presence in the Lands Between started with Shabriri. It's specifically stated that \"the sickness of the flame of frenzy began with Shabriri\" (Howl of Shabriri).\n\nand 2. the wandering merchants WERE imprisoned for this very crime, so if Shabriri's lie was proven to be false, then why were the merchants imprisoned anyway? Why would he be punished for slander if the golden order believed him and imprisoned the merchants, and if you wanna say that it was proven to be false after they had already been imprisoned then why weren't they released? it just doesn't make sense.\n\nIt's just never made sense to me that Shabriri told a damaging lie, was punished for it, and that was the event that caused the flame of frenzy, the outer god embodying the very concept of madness and chaos, to dwell within him. Why would the maddening flame of frenzy have originated from that of all things? If Shabriri had told a horrible lie and was punished for it, that's not maddening, that's just. Sure, the punishment probably doesn't fit the crime but still, he did something bad and was punished for it. It's always been my belief that the real reason it would have driven Shabriri to madness is because it wasn't a lie. For once he was telling the truth and nobody believed him. That's enough to drive anyone mad.\n\nI've always read it as a boy who cried wolf kind of scenario. Shabriri was a liar and reviled by all in his community for it, but one day he discovered some horrible truth about some well-respected figure, someone with power and influence, maybe in the world or just in his community. He tried to expose this person, but of course, Shabriri was already reviled by this point. He was known by all to be a liar and so, nobody believed him even though this time he really was telling the truth. As to who he accused, we can never really know, but it had to have been someone with a lot of influence for Shabriri's eyes to have been gouged out. If you're familiar with One Piece, you could compare his story to Usopp's story in Syrup Village. Every day Usopp would run through town claiming pirates were coming to raid the town, so the one day pirates did actually show up, and the one leading them was a respected figure of that town's community, nobody believed him.\n\nIdk if anyone else shares this line of thinking, I've only seen the more popular theories which all hinge on the fact that he was indeed telling a lie. i'd like to hear what other people think",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:35:38.649100",
    "comments": [
      {
        "body": "I had always assumed it was a case of \"madmans logic\". That is to say, he wasn't wrong, but the way events turned out was twisted.\n\nMy understanding of the order of events was: Shabriri accused the merchants whom were imprisoned underground. At this time there were rumours of the frenzied flame but nobody knew quite what it was, though it was considered bad because any flame is a threat to the erdtree.\n\nThen there was a realisation that Shabriri lied, and no flame lingered in the merchants, and so he was punished and blinded; which allowed him to glimpse the flame in his blindness. Perhaps even erupting into howling laughter immediately after his blinding.\n\nFinally, when they went to free the wandering merchants, they discovered that the conditions of their imprisonment had driven the merchants into the blazing, nihilistic embrace of the frenzied flame. Their actions in imprisoning them brought about the exact end they were attempting to forestall, and the merchants were not released.",
        "score": 45
      },
      {
        "body": "I think Shabriri was of the same people as the wandering merchants, and whatever he actually did to piss off Marika led to them being banished underground with only a few left to endlessly wander as merchants.\n\nThe frenzied flame manifests when there is deep suffering. The state of the merchant people couldn't be much worse, and the three fingers are located right below where the merchants are. Kale tells you himself that his people are \"deeply unforgiving\".\n\nIt's not rock solid, but I think Shabriri was one of them and his actions caused their current state and him becoming an agent of chaos",
        "score": 26
      },
      {
        "body": "I don't think it was the event itself, but rather the being blinded that drove him mad (simply because blind) and that allowed the Flame to take root, at which point he was under its influence and acting to further its emergence.",
        "score": 19
      }
    ]
  },
  {
    "title": "Goldmask's golden order is not Marika's and Radagon's. (Why Marika shattered the ring part 2)",
    "url": "https://www.reddit.com/gallery/1p7ct4t",
    "score": 144,
    "subreddit": "EldenRingLoreTalk",
    "body": "In a previous post I discussed in depth that in my opinion, the shattering done by Marika was an act of trying to figure out the future of the world and deal with the grief of Godwyn's death and the failure of the order. \n\nI explained how extending grace to the mending rune bearing tarnished, gideon and Godfrey are an attempt from Marika to explore the order through an external perspective as they all share multiple aspects of her and call back to multiple parts of her life. Fia as a reviled opressed life giver and mother, Goldmask as the seeker of knowledge and exploration of the depths of the order, The dung eater as a walking talking manifestation of the karmic dept, curses, trauma and hatred inflicted upon her by the hornsent and inflicted onto the hornsent in vengeance.\n\nThis post will focus on Goldmask, Metyr, Midra, Gideon and Radagon as a lot of people believe Goldmask's ending and mending rune to either be the best option or simply an eternal, unmodifiable return to the status quo, or believe everything he achieves in the game is nothing but nonsense ever since the reveals that the fingers that guided Marika were not communicating with the greater will but with the unhinged Metyr.\n\nMetyr and failure at motherhood : \n\nIf Hyetta and Ymir are to be believed, and I find no reason why they shouldn't in this case as they use different methods of communing with an outer god and study of the stars to reach the same conclusion, the world itself was born of the rapture of the one great, something Hyetta calls a mistake as it allowed for the creation of every life, every sin and every curse without hope for change. As in the elden ring world the two principles of the golden order observed through exploration of the depths of the ring are causality and regression. The principle of causality dictates every action has a reaction, meaning it is literally impossible to make an action not based on precedent reactions and for the future not to be affected by the actions of the present, this principle echoes the concept of original sin in Christianity and Karma in Buddhism. In that sense, the karmic dept of the world can become so severe that despair and frenzy become the only options. The greater will ruptures, abandons Metyr, who abandons her fingers, who abandon Marika, who abandons her children, who abandon the realm. The twin bird abandons the death birds. The dragon god abandons the ancient dragons. Rennala abandons Caria and her children... Existence in elden ring in this case is fundamentally incomplete and eternally looking at the mother for blame, curses and validation. No only that, but in their foolishness they yearn for motherhood in hope of being the mother they never had and giving birth to complete creatures. This is best told by the game through Ymir and Yuri and Ymir takes every tragedy and sin in the world and puts the blame wholly on the mother, bragging and hoping he is capable of replacing Metyr and birthing Yuri whole as a way to cope with the trauma of losing his child, but all he makes is more finger creepers, incomplete. His use of motherhood as a coping mechanism is also exemplified through his abuse of the sisters of night, as he wishes to be the only star, the only mother, the only beloved and the only source of love even if this involves locking away all evidence of one sister being turned into a puppet from the other and grooming them from childhood to be his swordhands raised in perpetual darkness that only he can illuminate.\n\nRadagon, is characterised by the game as constantly seeking completeness, meaning he is incomplete himself. His search for completeness  is shown in the game primarily through cultivation of knowledge and faith through his two unions and alchemically he serves as the symbolic king of the sun, the masculine half of the rebis. (This is medieval spiritual alchemy so we're about to get sexist but not really.) The king of the sun embodies masculinity as a spiritual concept inherently recognised, cultivated and curated by both the action and reactions of men and women. Defining what a man is, should be, shouldn't be, will do but shouldn't, won't do but should at all stages of life, this isn't one state of dos and don't for example a barbarian, a well manner gentleman and a sage are considered masculine in different ways and a woman embodiying these things does not stop them from being masculine... Order, gold, fire, sun, virile, lion, wise... Are all described in the great work as aspects of Masculinity that are to be integrated with the feminine to become complete. Yet, even during his age, Radagon is not the archetype of the masculine in the lands between, it's Godfrey. Ever since antiquity in the lands between it was Horah loux or Godfrey that defined the soul of what a man is, despite his banishment, the ruin of his lineage and his replacement by a much recent lord, the lands between ooses his influence and very print after centuries. The hornsent built their armor modeling naked form and wear lions as helms, the beast regent of farum azula is on his shoulders, the corpses of giants litter the mountaintops, the kaiden still roam limgrave upholding strength based fighting and subjugation of beasts through horse riding, the crucible knights he led still roam the lands, sword monuments stand to his defeated enemies, the colosseums still stand, the tarnished warriors of his are the last hope the lands between and even the fighting techniques he uses are used not only by badland warriors but also rank and file messmer soldiers, crucible knights and horned warriors. Even Radagon's own children have to look past his fundamentalism to grow and flourish as people, Rykard defies the order itself through the serpent embodying a perversion of Godfrey's will in the code of the recusants \"the strong take\", Radahn idolises Godfrey and his red hair (the part he hated about himself) and revived the traditions of martial might and colosseum lion fighting through the redmanes. Ranni follows the path shown by her mother and her mentor, Miquella gives up on fundamentalism as it failed his sister, Malenia finds guidance through the warrior that followed the old ways and taught her to mimic a bird dancing on water to fight the rot and when defeated echoes Godfrey's spirit in accepting defeat and admitting that your strength warrants the crown of a true lord, Melina explores the world and the order and concludes death is necessary and messmer locks himself in a room forever in grief if his abandonment by Marika without even paying him attention. Radagon spends his life gathering knowledge from Rennala and leaves her the instant he thinks he learned enough, even descrating the symbol of their union as a show of vanity. And when his order breaks he desperately tries to keep it together and locks himself and Marika away.\n\nThe spirit of Radagon lives thus through one man alone, Gideon Ofnir. A hunched over old man that spent his life gathering knowledge without wisdom, has no moral standing, lets others do his bidding and when he is faced with a dillema is immediately paralyzed in fear and gives up on his life goal, incapable of dealing with the state of aporia his revelations granted him. Not willing to intellectually wrestle and fight for his wanted position as elden lord and reaching a state of euporia. Nepheli, his adopted daughter's salvation even lies in abandoning him for a reaffirming of her identity as blood of Godfrey and seeking guidance from the stormhawk king as per the old ways and becoming lord of Limgrave as her ancestor did, her only other path is servitude as the puppet of a deviant. His counterpart in the DLC, sir Ansbach is ten thousand times more deserving of his monicker but his humility will never allow him to wear it, carries himself as a respected warrior honored and feared even by his enemies and accepts your lordship attained by defeating Mohg in an honorable duel as dictated by Godfrey.\n\nRadagon is thus ideologically obsolete and his seed is rotten, when viewed through this lens he is a failure at every level, never achieved completeness despite his godhood.\n\nGoldmask the complete : \n\nGoldmask represents intellectual completeness in elden ring through his form and existence, he communicates through movements of his fingers yet he is not seeking the guidance of a mother, brother Corhyn even affirms what he is doing is self reflection and calculus, symbolically meaning he is more complete than any two fingers. His DLC counterpart, sage Midra, is a dark reflection of him that after rigorous torture came to embrace the enlightenment of chaos given by the frame of frenzy, the opposite force to the golden order. While Midra carries that enlightenment as a ball of yellow fire on his shoulders, Goldmask carries it through his mask, symbol of his mastery over the secrets of Order itself. Their weakness is their physical feeblness, denying them the title of lord.\n\nGoldmask unlike what a lot of people think, stands in opposition to the golden order at it is. Going through rigorous questionning of the order, fighting through the aporia in order to reach the totality of the golden order. Goldmask is against the death hunters as he sees that a perfect order does not contain an evil for the good and the great to contend with, during his reflection on the order, when faced with the idea that Radagon is Marika he does not collapse or give up but simply keeps going, in the mountaintops he even commits to recognising the burning of the tree and the reintroduction of destined death into the golden order is absolutely necessary much to the confusion and fear of brother Corhyn. And it's not a coincidence that the rune he discovers is found on his corpse that still holds the pose of golden order totality, meaning an acceptance of death as part of the golden order. The rune was already there, he just found it through reflection and calculus, showing his level of deep wisdom surpassing Radagon and Gideon who give up the instant they are challenged by reality. \n\nAs the conclusion of Goldmask is that the golden order is possible and achieveable through removing the fickleness of the gods, the reintroduced destined death and the rejection of absolute evil and the affirmation of the game as his status of sage severing the dependance on a mother and finding completeness through embodying a finger that doesn't seek answers from outside. The golden order perfected by Goldmask is literally impossible to be the same thing as Radagon's as not only does it come from a more reflective perspective but it very clearly embraces aspects shunned by the order.\n\nNext is the dung eater, guilt, curses, cycles of violence and the karmic debt of Marika and the hornsent.\n\nOof this is long as hell.\n",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:41.008151",
    "comments": [
      {
        "body": "That was really well out together and logical, wonderful analysis man, keep it up",
        "score": 6
      }
    ]
  },
  {
    "title": "The real erdtree in my interpretation",
    "url": "https://www.reddit.com/gallery/1oszwkr",
    "score": 146,
    "subreddit": "EldenRingLoreTalk",
    "body": "For a while I didn't realise, but now the little golden tree reminds me of the first flame of Dark souls 3.\n\nI'm certain that this small tree is THE Erdtree, not the gigantic golden tree from the base game. I know this sounds a bit stupid, but we should let go misconceptions like \"big=powerfull\". The golden tree is a decoy. Just like how the first flame is just a small little flame that could barely ignite the ashen one. \n\nMy reason/proof:\n\nThe flowers.\n\nAltus plateau, a \"blessed land at tbe foot of the grand healing erdtree\" is quite literally bleached by it. Its mono chromatic golden yellow. Where some flowers bloom they are some sickly shade of pink or yellow, more desecrated than blessed.\n\nThat light is blinding, nauseating,cold and distant.\n\nShaman village is full of life. Flowers bloom in all colors, trees are green and healthy, except the hollow tree where the Grandmother and Marika's braid can be found. She couldn't heal her. \n\nThe light of the small tree is warm and gentle, it made flowers grow all around the hinterlands, according to the painting in Midra's manse even the abyssal woods flourished before the frenzy took root. \n\nNot saying the golden tree has no real power, but its a mere mockery of what the original tree is meant to represent. Unlike the first flame that had to extinguish one day, I get the feeling this tree is meant to stay. Maybe it will grow.",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:43.354708",
    "comments": [
      {
        "body": "Alternatively, it could be precisely a metaphor for the failure of the Golden Order. \n\nRemoving death creates a nice world for a while, but overlong it becomes bleached and stale.\n\nGood analysis though.",
        "score": 26
      },
      {
        "body": "The first flame is small in ds3 because it's been going for so long and hasn't been linked in ages. \n\nWhen you link the flame on ds1 the fire fills the whole kiln boss area",
        "score": 19
      },
      {
        "body": "I kinda like the concept but I think the little tree is just an Erdtree sapling like the others.",
        "score": 15
      }
    ]
  },
  {
    "title": "The primordial form of the Erdtree and how it changed to its current state.",
    "url": "https://www.reddit.com/gallery/1p3qr2z",
    "score": 146,
    "subreddit": "EldenRingLoreTalk",
    "body": "\"Siluria's Tree, weapon of one of the two honored as foremost among the Crucible Knights.\nThe primordial form of the Erdtree is close in nature to life itself, and this spear, modeled on its crucible, is imbued with ancient holy essence.\"\n\nThis weapon makes us think that the original form of the Erdtree was a bunch of trunks in a circular pattern and we can find the same form in some of the statues and in the Aeonia flower/tree. Both, the flower/tree and the statues depict surrounding trunks bearing flowers with a central trunk reaching up. In the case of the of the flower/tree, the central trunk is composed of two spiraling trunks while in the statue, a burned figure is helping a single trunk to be the central one, this trunk bearing a central golden flower. \n\nTheory time:\nAs some reliefs on Enir Illim and the Scadutree can indicate, the original form of the divine tree should have been a spiral. We know that this didn't come to pass, Marika ensured that light(gold) and darkess(shadow) remained separated in a physical and metaphysical way (even the lands of gold and the shadow realm are separated). But if the natural way is a spiral, how did Marika managed this? The burned statue holding the golden flower is the answer: the first burning of the Erdtree. As everyone knows, Leyndel is covered in ash, pointing to this happening in the past. But why? Well, why do we burn the Erdtree? To usher a new age. All the game endings need the Erdtree to be burnt for us to usher a new age, with the Erdtree changing in the process. That's why the burned figure is depicted helping the golden flower rise amongst the crucible, this statue is depicting the kindling maiden that ended the age of the crucible and enabled the age of the Erdtree. And yes, I think that the statue is depicting Melina before she was burned and bodiless. The godhunt could have been a way to purge Marika's lineage from her less than desirable descendants and Melina could have been playing her role, just as her older brother, Messmer. Messmer burned the hornsent following her mothers orders but other descriptions say that he escaped from the capital. Messmer was used as a cover up for Marikas true intentions and I think that Melina suffered the same fate. The tree had to be burned and  some demigods had to die but Marika couldn't be related to this so, as Messmer did, Melina was asked to take the fall.  ",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:45.723852",
    "comments": [
      {
        "body": "I have a *very* juicy little tidbit for you on this topic. In that item description, where the English says “this spear, modelled on its crucible” the Japanese says modelled on that ‘crucible-like state’. The kanji used for state is 樣, and when I researched that kanji, turns out that in Chinese, while the main meaning is still form/state/appearance, it’s also in some historical Chinese dictionaries as an alternative glyph for 橡, which means Oak or acorn. So there are two readings, crucible-like state and crucible-like oak. Obviously Siluria’s tree looks like… a tree, and the roots we see around the deeproot depths, the ones which are pale and clearly distinguishable from the Erdtree roots (which are a different colour and size) are most likely Oak tree roots based on their appearance. Siluria is even standing by one of these Oak roots. So there was an Oak tree which was super important to these Crucible knights. Was it the crucible itself, or just a related thing?\n\nAnother interesting link this creates is that the Haligtree sheds red Oak leaves, and the Scadutree chalice contains the same red Oak leaves. Elphael and the Shadow Keep have similar architecture too. I have my own ideas on what this all implies, but I’ll just leave it here for you to incorporate into your own.",
        "score": 15
      },
      {
        "body": "Anyone see Way-of-colors recently? I keep trying to guess if it's their post from the title and graphics and it's been a while, did I miss a post?",
        "score": 7
      }
    ]
  },
  {
    "title": "I’ve solved the mystery of Melina",
    "url": "https://www.reddit.com/r/EldenRingLoreTalk/comments/1ph39tz/ive_solved_the_mystery_of_melina/",
    "score": 143,
    "subreddit": "EldenRingLoreTalk",
    "body": "I’ve recently been thinking on the mystery of Melina and who she is exactly\n\nAnd I think I have it all figured out.\n\nMelina is the second born daughter of Queen Marika \n\n(As evidenced by the item description of Messmers Kindling)\n\nShe is the first Empryean who was chosen by the two fingers as a potential candidate to succeed Marika\n\nThis led to a conflict between her and Marika and she waged war against her mother as the Gloam Eyed Queen. She wielded the power of flame (like her brother messmer) and infused it with the power of destined death to create her weapon she could use to defeat her mother. The Godslaying Black Flame. (This also tracks with how each of the Demigods claimed a great rune from the Elden Ring. The “Great Rune” of the Gloam Eyed Queen was the Rune of Death) \n\nUltimately Melina met her end as the Gloam Eyed Queen when she was defeated by Maliketh of the Black Blade, Marikas shadow. (This also would give further cause for why the Demigods all feared Maliketh) \n\nHowever, even though Maliketh killed her she did not die, because upon her defeat her mother Queen Marika removed the rune of death from the Elden Ring. And Maliketh then sealed the rune inside his blade. Thus her body died but yet she lives burned and bodiless. ( My own theory is that at this time she remained dormant in the form of a rememberance)\n\nFast forward to the shattering. Marika is now held captive inside the Erdtree by the Greater Will as punishment for shattering the Elden Ring.\n\nMarika knows that only “ones who envision Flame” have the power to burn the erdtree and thus gain access to where she is. (As confirmed by Finger Reader Enia)\n\nFrom inside the Erdtree she uses the remembrance of the Gloam Eyed Queen her daughter, to resurrect her as Melina. And tasks her with the role of serving as the Kindling Maiden and aiding the tarnished who would be Lord. \n\n(I think it also might be possible to say she is a special type of spirit ash summon that Marika created from the Gloam Eyed Queen remains)\n\nFast forward to Frenzied Flame ending. Now that the Rune of death has been unsealed by the Tarnished. Her power she wielded as the Gloam Eyed Queen has now also been unsealed as well. \nAnd we see her transformed.\n\nThe reason Melina eye was always closed before was because it held a remnant of the power of destined death. The mark over her eye I believe represented a shard of the Rune of Death. \n\nNow the rune of death is unleashed and the power of Destined death that was sealed in her eye (or perhaps the ability to control Destined Death) has been unleashed with it.\n\nThus the Gloam Eyed Queen is reborn. \n\n\n\n",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:48.065138",
    "comments": [
      {
        "body": "Marika's children did not claim great runes until the shattering.",
        "score": 20
      },
      {
        "body": "&gt;I’ve solved the mystery of Melina\n\nYou are a few years late, but good job\n\nOverall not the worst theory out there.\n\nTho, it does not explain why she is burned.\n\nAlso, her only remaining as rememberance is contradicted by this dialogue:\n\n*I have long observed the Lands Between. This world is in dire need of repair and Death...indiscriminate.*",
        "score": 15
      },
      {
        "body": "And how does it work thematically that someone whose goal and purpose is restoring balance and prosperity out of love for the world by sacrificing herself is, absent of any written implication, connected to someone whose goal is slaying gods to steal their power and flesh, or in other words, enriching herself?\n\nThere's not a hint of anything resembling what we know of the GEQ in Melina besides what is likely Maliketh's other missing eye being supposedly gloam, though the internally named, 'Gloam-Eyed Knight' has blue eyes.",
        "score": 14
      }
    ]
  },
  {
    "title": "Pattern Worn by Frenzy Flame Trolls &amp; Rennala",
    "url": "https://www.reddit.com/gallery/1oyumjy",
    "score": 141,
    "subreddit": "EldenRingLoreTalk",
    "body": "The Queen's Robe worn by Rennala and the hooded mantle used on Frenzied Flame Trolls share the same underlying embroidery design when reduced to form. Both feature a central node encircled by eight evenly spaced orbs (i.e., the mark of outer divinity like Fell God), supported by five radial \"petals,\" with concentric interior linework. In each design, this motif sits directly below a repeating spiral border.\n\nInterestingly, \"Troll_Woman\" is the internal name for Frenzied Flame Trolls.\n\n**Given the context provided by the sources listed below, Rennala and Trolls sharing this particular design likely correlates with an ancient Astrologer-Giant pact.**\n\n**Troll Knight's Sword**:\n&gt; *\"Greatsword embedded with a blue glintstone. Weapon of the trolls in service to the royal family of Caria. Called into service when the Queen invoked an oath they swore, the trolls are treated as true knights of Caria, and fight arm in arm with their human comrades.\"*\n\n**Greatblade Phalanx**:\n&gt; *\"One of the sorceries of the Carian royal family. Creates a defensive arch of larger magic glintblades overhead, which automatically attack nearby foes. Used by the enchanted troll knights. They were the comrades of the young Rennala, bound by oath.\"*\n\n**Sword of Night and Flame**:\n&gt; *\"Storied sword and treasure of Caria Manor. One of the legendary armaments. Astrologers, who preceded the sorcerers, established themselves in mountaintops that nearly touched the sky, and considered the Fire Giants their neighbors.\"*\n\n**Unique Skill: Night-and-Flame Stance**:\n&gt; *\"Hold the sword level and prepare to cast a sorcery. Follow up with a normal attack to cast the Night Comet sorcery, or a strong attack to sweep forward with a burst of flames.\"*\n\n**Giant's Red Braid**:\n&gt; *\"Hefty whip woven from the flame-red hair of a Fire Giant. Every giant is red of hair, and Radagon was said to have despised his own red locks. Perhaps that was a curse of their kind.\"*\n\n**Rellana's Helm**:\n&gt; *\"Rennala, head of the royal family of Caria, was said to have given her younger sister, who renounced her lineage to chase after Messmer, a gift of lustrous black hair.\"*\n\n**Remembrance of the Twin Moon Knight**:\n&gt; *\"Once a Carian princess, Rellana disavowed her birthright and chose to stand at Messmer's side instead, knowing full well that not even the brilliance of the moon could grant him succor. Before long, she became known as the Sword of Messmer.\"*\n\n**Rellana's Twin Blades**:\n&gt; *\"Carian light greatsword embedded with blue glintstone. Weapon of Rellana, the Twin Moon Knight. Two swords as a single armament. When two-handing, a straight sword engraved with golden flame will be carried in the left hand. Here, and here alone, were moon and fire ever together.\"*",
    "category": "Outer Gods",
    "scraped_at": "2025-12-09T15:35:50.463085",
    "comments": [
      {
        "body": "Ah, this ties into one of my oldest ideas/theories. The largest number of frenzy trolls appears at the Yelough Anix ruins. I think that’s a cheeky spelling of Yellow Anise ruins. It refers to the Star Anise plant, which has a fruit that resembles a star. The biggest stumbling block in my theory is that the fruit usually has 6 follicles, not 5 like what’s depicted here. But I still believe that could be a deliberate change to make a fantasy version of the plant which better fits the cosmology of the setting. Anyway, the most well known Star Anise is the Chinese star anise, which is a popular spice. But theres also a very similar species, the Japanese star anise, which is extremely toxic. There have been known mix ups where Japanese star anise has gotten into a batch of Chinese star anise and caused very severe food poisoning cases.\n\nThe Latin names of the two plants are “Illicium verum” (which means seduce and genuine) for the Chinese one, and “Illicium anisatum” (which means seduce and anise-scented) for the Japanese one. Although it’s toxic for consumption, the Japanese star anise does still get used as an incense in certain Buddhist rituals as it’s apparently good at warding away spirits, who don’t like it.\n\nSo taking this all together, my theory was that this is symbolic of the relationship between Gold and Frenzy. Gold is the genuine article, and is nourishing and healthy. Frenzy has a similar appearance, and is even described as seductive, but is a fake, with multiple examples of items that imitate helpful gold based ones but are actually harmful. Also, burning the frenzy plant creates an effect which harms spirits.\n\nAs Rennalla also has the pattern, the star anise links into the worship of the stars. The stars could be a heavenly equivalent of the anise plants, with the meteors/fallingstars being the seeds. Thus, the yellow meteor at the bottom of the tunnel may contain Frenzy, and was mistakenly mined by those thinking it would contain golden amber like other meteors that have been mined. The presence of an Astel hints that this is a very very old site, as it would have grown as a fallingstar beast and gone through its entire growth cycle.\n\nI think there’s potentially even bigger implications that draw out from this, but it involves getting into other stuff which isn’t related here and is also a bit crackpot, so I’ll leave this to stand on its own.",
        "score": 28
      },
      {
        "body": "I've noticed this before and it feeds into a theory that the old regime before Marika was actually Nox/Carian.",
        "score": 16
      },
      {
        "body": "Trolls are usually associated with the Carians. There’s Iji, and a few magic user trolls you encounter in Liurnia, Caelid, the DLC etc. The frenzied ones are infected by the Frenzy. Perhaps that’s why Iji’s wearing a helmet. To prevent outer influence ",
        "score": 12
      }
    ]
  },
  {
    "title": "The Night Ring is a partial solar eclipse, which represents death, and Nightreign is about our characters' journeys through Death and the Eclipse rebirth ritual",
    "url": "https://www.reddit.com/gallery/1pcfiwg",
    "score": 133,
    "subreddit": "EldenRingLoreTalk",
    "body": "\nA few days before the new Nightreign DLC, I want to explain what the Night Ring represents. It's actually a partial solar eclipse, which represents death. Nightreign is about our characters' journey through the Eclipse rebirth ritual, a ritual about returning memory after death, because in Elden Ring's world (and George R.R. Martin's) life == memory. \n\n1. The Nightring looks like a partial solar eclipse, the stage of the solar eclipse with the \"diamond ring\" effect\n2. The Eclipse is a symbol of rebirth \n3. The Eclipse rebirth ritual is about returning memories, and in Elden Ring memory = life\n4. Our Nightfarers are on a journey of regaining memories --&gt; this world is within the eclipse\n5. The Nightlord = Night King from Game of Thrones (in NR night erodes memory, NK wants to kill Three-Eyed Raven, the \"memory of the world\")\n6. The PARTIAL solar eclipse is a symbol for DEATH, and death is also symbolized by a black hole\n7. Many people in the Lands Between are performing the Eclipse rebirth ritual using \"soul hard drives\" to remember the dead to rebirth them\n8. Death, Night, Shadow, and the Abyss are all different versions of the \"dark\" \n9. Everything \"dark\" has been labeled \"sin\" and \"sealed away\" \n10. The sealing away of the dark might be the \"sin of the Erdtree\" because dark is a natural part of the world and order and getting rid of half of nature is a big no no\n11. I identify the \"root\" pattern, seen in DeathROOT, the Erdtree Roots, the Dark Souls bonfires, Great Site of Grace, the Grandmother tree,  the Swords of Light &amp; Darkness, and the stone monument on the Erdtree\n12. Marika may have discovered the natural light/dark duality of the root and changed her mind about the dark\n\nThis video is my explanation for Nightreisn's world, the eclipse, death, rebirth, the Dark, and what the son of the Erdtree is. \n\nLink: https://www.youtube.com/watch?v=tw3XAuPupks\n\nLet me know your thoughts!! ",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:52.866282",
    "comments": [
      {
        "body": "In the video, you mention that the nightfarers are suffering for the sins of their ancestors.  That was the impression that I got from the game as well - but everything you mentioned prior to that made me wonder... does it explicitly call them ancestors?  I don't have Nightreign's text organized well enough to check.\n\n\nAnd whether or not they are called ancestors or not, is the meaning of that relationship potentially different than we would typically believe?\n\n\nTo a degree, it seems foolish for those who laid the \"foundation\" of this Roundtable Hold to pin all their hopes on their future progeny who may not be up to challenge.  The idea seems to be that later generations must work off the original sin in place of their forebearers - and to do so because the original group could not do so.  That's definitely possible... but doesn't feel like it fits in a world of immortality.\n\n\nOn the other hand, Nightreign seems to be intentionally bridging the gap between Dark Souls and Elden Ring in a way that wasn't previously as explicit. A recurring concept in Dark Souls is the idea that souls are passed down and that they change.  The strongest example is how we see the Lord Souls get passed down and evolve between DS 1 and 3.\n\n\nTypically, sins are something that we think of as attaching to the soul of the sinner.  If runes are memories, and memories are souls, and souls can be transferred, then perhaps the \"foundation\" is not deferring responsibility to their progeny. Perhaps the nightfarers are simply the most recent recipients of the remnants of the souls of those who were part of the foundation.",
        "score": 11
      }
    ]
  },
  {
    "title": "My rough interpretation of the Crucible.",
    "url": "https://i.redd.it/00gwft1ndu1g1.png",
    "score": 131,
    "subreddit": "EldenRingLoreTalk",
    "body": "Basically, it's a vat of gore, thick and boiling, with different body parts of different animals floating in it, forming and deforming. Disembodied claws grasping and tails lashing. Horns forming like bubbles in lava. Maybe it pours or flows from somewhere.\n\nMaybe it's more likely a hole in the ground instead. But I can't draw that in paint (or irl for that matter). Used a lot of google images, cut and paste.",
    "category": "History",
    "scraped_at": "2025-12-09T15:35:55.204499",
    "comments": [
      {
        "body": "I always have similarly thought primordial soup.  Though not physical soup, but an energy source from another dimension that can breach the boundaries between planes (symbolized by spiral) and 'touch' you with what is essentially the mutation element of evolution.",
        "score": 10
      },
      {
        "body": "https://preview.redd.it/4mczslu4cv1g1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=0a1ac31701a9efa205251d1924ce007337b4ebb2\n\nMy theory is that the crucible should have looked kind of like what’s at the back of the picture.",
        "score": 9
      }
    ]
  },
  {
    "title": "Protective deity or something more sinister?",
    "url": "https://i.redd.it/umb3clqkmx5g1.jpeg",
    "score": 116,
    "subreddit": "EldenRingLoreTalk",
    "body": "Their relic tells a short story about a girl whose village was raided and prayed for help. They answered her prayer, but if it came at the cost of her becoming a valkyrie or they simply granted her a weapon so she can fend for herself and others.\n\nI can't shake off the feeling that there might be a sinister side to them, I watched enough magical girl shows to not trust the entity(the rose in the sky?) responsible for their creation",
    "category": "General Lore",
    "scraped_at": "2025-12-09T15:35:57.522801",
    "comments": [
      {
        "body": "*By the end, the village was steeped in red and settled in silence. The village girl, drenched in blood, stood with a vacant stare and a heroic weapon in her grip.*\n\nWhatever gave you the idea about anything sinister going on here?",
        "score": 15
      },
      {
        "body": "The backstory reminds me of Shaman Village a lot, with the protective deity being in the forest. Clearly not the same place, cause the Grandmother there doesn't have a weapon, but another Shaman village maybe",
        "score": 14
      },
      {
        "body": "A little of both, maybe? They're called heroines directly, their relic naming convention is different, they keep the Dreglord somewhat in check, and there is undoubtedly references to purity... but the relic also paints a more complicated picture, and From doesn't do pure good, just as it doesn't do pure evil.\n\nI'm trying to put into words my exact thoughts without huffing my own farts too much. Something about the cost that defending anything worthwhile will exact, an inflexible and uncompromising good, the toll it takes, the violence enacted either way.",
        "score": 14
      }
    ]
  },
  {
    "title": "Cool Parallel I thought of: Marika and Shamhat",
    "url": "https://www.reddit.com/gallery/1ou1c3n",
    "score": 115,
    "subreddit": "EldenRingLoreTalk",
    "body": "In Elden Ring, Marika, the religious leader of the Land's Between marries and tames (idk the order) Horah Loux. She turns him from a beast man to a Lord and they bone at least three times\n\nIn the Epic of Gilgamesh, Shamhat, a pristess/sacred prostitute, tames the impossibly strong wildman Enkidu. Over the span of a week she taught him to speak, wear clothes, and the political state of Gilgamesh's tyrannical rule. They also boned a lot\n\n\nDefinitely could be a coincidence but I think the similarity is pretty cool. Also art by Overly Sarcastic Productions\n ",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:35:59.865409",
    "comments": [
      {
        "body": "I LOVE Overly Sarcastic Productions.\n\nAlso yes yes yes the amount of parallels between Elden Ring and Mesopotamian mythos is absolutely staggering. I’ve always seen Ekidnu as a parallel for Serosh, the Beast advisor of Gilgamesh.",
        "score": 22
      }
    ]
  },
  {
    "title": "Elleh is the name of the Gloam-Eyed Queen",
    "url": "https://www.reddit.com/r/EldenRingLoreTalk/comments/1pgxxy5/elleh_is_the_name_of_the_gloameyed_queen/",
    "score": 112,
    "subreddit": "EldenRingLoreTalk",
    "body": "As in the Church of Elleh. This is built on top of the theory that the Gloam Eyed-Queen is another persona of Marika. Given the fire relationship, this name follows the E-naming scheme for the serpents: Eiglay and Eveligne (Rykard’s God Devouring Serpent). The name Elleh being the name of the first church we found is more than just a coincidence or a mere triviality. In truth, this explains the supposed sins of all the crucified people around that church. They are the faithful of the Gloam-Eyed Queen Elleh.",
    "category": "History",
    "scraped_at": "2025-12-09T15:36:02.223044",
    "comments": [
      {
        "body": "“Elleh is the Gloom Eyed Queen’s name because it starts with an E” Is probably the most logically sound an evidenced based assertion that the “GEQ is Marika” thing has produced.\n\nThe majority of posts like this would have done something like pull the texture sheet for Malenia’s panties and circled a mirrored texture-seam asserting it was actually a secret third eye.",
        "score": 60
      },
      {
        "body": "The one thing that puts me off the \"aspect of Marika\" theory is that GEQ was an Empyrean in her own right.\n\nMarika is an Empyrean, and Radagon was her dual aspect. However, Radagon is never said to have been an Empyrean himself. In fact, he wasn't even a demigod until he married Marika (depite Messmer is seemingly his son), nor was he a god until the two merged into one in more recent history.\n\nLikewise, Miquella is an Empyrean, but we don't get any indication that St. Trina is one. In fact, the fact that St. Trina never received a Great Rune suggests she may not be regarded a demigod, either, which is strange to consider.\n\nAs far as we know, Ranni has no dual aspect. She has Blaidd, just as Marika has Maliketh, but Shadows are neither demigods nor Empyreans, despite having been created from some aspect of one. Malenia has no dual aspect nor shadow, and as for Melina and Messmer, it seems possible they could be cursed Empyreans like Miquella and Malenia owing to their singular god-parent.\n\nIf anything, someone else could have been an aspect of the GEQ, but that's if she *had* one... Until Marika established the Golden Order, twinned souls were apparently seen as abominations (as per Dariel and Devin's gear), so perhaps it wouldn't have made sense for the GEQ to have one back then anyway.",
        "score": 29
      },
      {
        "body": "I mostly agree with this, although I wouldn't link the crucified people around it to the theory. I would also argue that the GEQ isn't exactly a \"persona\" of Marika, it was just another way to rewrite history and hide her deeds.\n\nTo add to your theory, I would also suggest that each one of these types of churches represents a stage of Marika's life. I'll throw in one example using the term \"Smoldering\", and the assumption that Melina is a free-willed reincarnation of Marika:\n\nMelina is linked to the Smoldering Butterfly. The Smoldering Shield is found in a graveyard below the Prison Town on mount Gelmir with a bunch of jars, and there lies a single coffin which would appear to have some significance. Melina is burnt and bodiless. Outside of the Smoldering Church, we find a Sword Monument which tells of the end of Lord Godfreys campaign (war with the Giants, after which began the age of the Erdtree).",
        "score": 15
      }
    ]
  },
  {
    "title": "With Regards to Height in Elden Ring",
    "url": "https://www.reddit.com/gallery/1p29oyl",
    "score": 116,
    "subreddit": "EldenRingLoreTalk",
    "body": "So we know all the demigods and gods and Elden Ring experience a boost in height due to divinity. The demigods tower over most beings in the game. Even demigods such as Ranni are speculated to be eight feet tall when they had there empyrean flesh  and Miquella received growth burst when he uses the gate of divinity overcoming his curse of youth.\n\nOne can conclude that Divine Blood plays a role in ones height. The more one has divine blood in them the taller they can be.\n\nBut then there are outliers; Rennala, Rellana, Loretta, O'Neil, Godfrey, Loretta and Niall. Both exhibit heights that rival the demigods and gods. This includes Rennala herself being two feet taller then Marika and Radagon.\n\nSo divine blood clearly has its limits, that mortals can surpass. Now all the outliers have one two things in common; their all warriors/champions who fought in wars and their all old by real life standards.\n\nNow, it should be noted that there are other ancient figures that do not experience a height growth specifically the Carian Knights who are as old as Lorretta and remain Tarnish size.\n\nClearly age by itself does not effect the height but what about the other binding factor to the outliers; combat.\n\nWe only need to look to our own Tarnish who is capable of slaying many great champions and growing stronger but still witness no growth spurt.\n\nSo combat by itself is clearly not a factor for height in the Lands Between...\n\nBut What if  the factors of time and combat worked in tangent to contribute to height?\n\nI hypothesize a formula for height\n\n***Divine Blood + ( Time x Runes Gathered)= Height***\n\nLets plug this formula into certain characters to see if it matches out.\n\nThe greatest example of this is Radahn who in his star scourge form is one of the tallest humanoids in the Land Between.\n\nRadahn has the divine blood of Radagon/ Marika and he participated in allot of fights in the shattering which takes place over many years. All these factors would contribute to greater height for Radahn based on my proposed formula.\n\nNow lets take a look at our Tarnish and plug them into this formula. They have no divine blood so that factor would be zero. The Tarnishes journey from start to finish is pretty short compared to the history of the demigods and champions of the Lands Between  so the age factor would be a near zero as well. This leaves the runes gathered which is the only positive factor for the Tarnish but the effects of that requires more time to contribute to height.\n\nNow lets look at a demigod that that barely fights in the history of the Lands Between; Ranni before she became a doll.  It is speculated that Ranni's original height is around eight to nine feet tall. Now she does have some fights under her belt as seen with her besting Adula, but in order for it to count to the rune factor she has to kill and take the runes of those she defeat. So Ranni rune factor is near zero so no matter how old she gets she wont grow that much. Ranni does show the limits of  how much divine blood can impact height by itself. With one parent of divinity the height is eight to nine feet tall.\n\n\n\nNow lets look at a trickery example the Carian Knights. We only fight two in game one protecting Rennala and one protecting Rellana. Neither of them have divine blood so that factor would be zero. Their both pretty old so that factor would be high but despite being very good at combat they are only Tarnish size. Now remember what I said about Rannis combat factor being low because she didn't kill anyone directly. The Carian Knights were renown for their skills in combat but said skills might have been acquired through friendly spares with each other improving their blade work. Since no deaths occurred their rune factor would remain  near zero. When looking at the what the two Carian Knights are doing in game this makes perfect sense; their both body guards protecting the Carian Sisters, not warriors leading the charge against the enemies of Caria.\n\nCompare that to another Carian Knight who most likely played a more active role; Loretta. She has zero divine blood but probably participated in both Liurnian Wars allowing her to gain quite a bit of runes over time contributing to her height.\n\nSpeaking of Liurnian Wars we have Rennala, who participated in two wars against the Erd Tree.  She has no divine blood so that factor would be zero for her, but seeing how she was the champion of Liurnia and fought in two wars her rune count would be pretty high, enough to catch the eyes of Radagon.\n\nAnd one final example; Malenia. Her divine blood grants her a default height of eight feet tall but she is short despite being warrior. I believe similar to the Carian Knights, Malenia combat experience was built up over the years through friendly spares and training under her mentor that taught her to resist the scarlet rot.  Malenia is a empyrean too precious to lose in a war so she would most likely be forbidden from fighting against hostile forces while Marika was still active. Not to mention she was the protector of Miquella and acted as a body guard for him similar to that of the two Carian Knights in game who protect their lieges. Finally we have the cinematic where Radahn fights Malenia in which Malenia is forced to reattach her prosthetic arm mid fight something which foes less honorable then Radahn would take advantage of and use the opportunity to kill the child of Marika. I think these factors indicate that Malenia despite being one of the most skilled combatants in the Lands between has a low rune factor contributing to her height being way less then that of Radahn. So for Malenia she would only have divine blood working towards her height.\n\nIn conclusion I believe that height in Elden Ring is determine by the amount of divine blood in a individual and a  factor of runes that kicks in over time.",
    "category": "Demigods",
    "scraped_at": "2025-12-09T15:36:04.624634",
    "comments": [
      {
        "body": "i think this is failing to take into account two things:\n\n1. bosses and enemies are scaled larger than the player so the player has a clear read on incoming attacks. the exceptions to this are npcs that use the player models\n\n2. the sword of night and flame insinuates a close relationship between the carians and the giants; i think you are supposed to read rennala and her children specifically as part giant",
        "score": 26
      },
      {
        "body": "Ok, we've been at this for 14 years now, Height is mostly a gameplay consideration unless we're told otherwise. Gods tend to be bigger than average in Fromsoft games, but they're not massive unless stated otherwise like with Radahn and his lore.",
        "score": 17
      },
      {
        "body": "I believe you’ll find that most of the Carian Knights we encounter are [actually](https://eldenring.wiki.gg/wiki/Troll#Carian_Knight-0) [pretty huge](https://eldenring.wiki.gg/wiki/Troll#Carian_Knight-0).\n\nMoongrum and Moonrithyll seem to be some type of bodyguards for Rennala and Rellana, so it makes sense that they’re of a size to be able to enter human-sized structures.",
        "score": 11
      }
    ]
  }
]